[
    {
        "message_id": 1650,
        "passage": "Malla looks upset at hearing her son's cry.\n\n                            IMPERIAL OFFICER\n                    (to Malla)\n               That will keep him busy for a while.\n\n66.",
        "dictionary": {
            "IMPERIAL OFFICER": "High-Ranking Government Official"
        }
    },
    {
        "message_id": 1651,
        "passage": "Lumpy sees his bantha doll in pieces. He picks up the \n     head and hugs it to his chest. He then picks up the body \n     and carries the parts over to his bed. He lays the head \n     and body on his bed and covers them up with a blanket. He\n     then starts to search his room for the cassette that came\n     with the gift that Saundan brought him earlier. He finds \n     it and inserts it into the monitor in his room. The tape\n     starts to play and show a man holding an assembled \n     mini-transmitter. A woman's voice begins to speak.\n\n                            WOMAN'S VOICE\n                    (over speaker)\n               This product was packed under strict \n               quality control on the system Amorphia \n               and this instructional cassette provided \n               by the manufacturer. It offers a unique \n               chance for consumers everywhere to meet \n               an Amorphian being. The motor abilities \n               of Amorphian citizens are frequently \n               impaired by malfunctions which results in \n               a temporary loss of power. This in no way \n               reflects on the safety of our product, \n               rather it should serve as a guarantee of \n               our high standards of long wear and \n               durability.\n\n     The Amorphian puts the transmitter on a table and starts \n     his instructions.\n\n                            AMORPHIAN BEING\n                    (on monitor)\n               Thank you for selecting our brand of \n               mini-transmitter. If you assemble it \n               properly, following the instructions I'm \n               about to give you. It will provide\n                    (slowing down)\n               many years of fun and valuable services.\n                    (normally)\n               But, now let's get started, shall we? \n               First, find the sealed package containing \n               all the tools you'll need. Ah, it looks \n               like this. \n\n     The man picks up a clear zip-lock bag. Lumpy picks up \n     his, also.\n\n                            AMORPHIAN BEING\n               Try not to rip it open because it makes a \n               very handy storage case for your tools \n               until you need them again. \n\n     He pulls a small tool out of his bag.\n\n                            AMORPHIAN BEING\n               Now, this is the first thing you'll need. \n               Please be careful not to hurt yourself on \n               the sharp edges.\n\n     He touches the tool's point and pulls his hand back in \n     pain.\n\n                            AMORPHIAN BEING\n                    (slowing down)\n               Ouch.\n\n     He picks up a very small item. Lumpy looks through his \n     stuff to find his.\n\n                            AMORPHIAN BEING\n                    (normally)\n               Now, find the circuit breaker module and \n               by the way, let's start calling these \n               components by their proper names.\n                    (slowing down)\n               Circuit breaker module.\n                    (normally)\n               Remember, every one of the ten thousand \n               terminals on your circuit breaker module \n               is marked in a particular color. Beautiful, \n               aren't they? Like a rainbow. These must be\n               connected with the wires with the \n               corresponding colors. So, red goes to red. \n               Blue goes to blue and so on. Now, watch me \n               closely.\n                    (irregular speed)\n               And we'll assemble our mini-transmitters \n               together. Let us work slowly and \n               methodically because this is a job worth \n               doing well.\n                    (normally)\n               Well, I see time is running out. So, we \n               better turn our attention to the assembly \n               of the impulse to voice translator. The \n               impulse to voice translator. The very \n               heart of the mini-transmitter which \n               converts electronic energy which provide \n               into any of a thousand\n                    (slowing down)\n               recognizable languages. We must remain \n               alert for this very complicated procedure.\n               Endurance and concentration are the key \n               words here and the total utilization of \n               our neural cranial synapsis is absolutely\n               essential.\n\n     While the Amorphian is saying his last part of dialogue, \n     he crumples slowly to the floor until his head comes to \n     rest on the table. The cassette ends. Lumpy gets to work \n     on assembling his mini-transmitter.\n\n67.",
        "dictionary": {
            "Amorphia": "Unknown Planet",
            "mini-transmitter": "Small Communication Device",
            "neural cranial synapsis": "Brain Function",
            "system Amorphia": "Planet's Infrastructure"
        }
    },
    {
        "message_id": 1652,
        "passage": "The camera zooms in on the second story of Chewbacca's\n     family's home.\n\n68.",
        "dictionary": {
            "Chewbacca's": "the Wookiee's",
            "Wookiee": "canine"
        }
    },
    {
        "message_id": 1653,
        "passage": "Lumpy is seated on the floor. He is busy at work putting\n     together his mini-transmitter.\n\n69.",
        "dictionary": {}
    },
    {
        "message_id": 1654,
        "passage": "The Imperial officer and guard are talking quietly with \n     one another. The wall screen beeps and the Imperials walk\n     over to see what the announcement is. The screen shows a \n     view of Tatooine from space.\n\n                            MALE ANNOUNCER\n                    (over speaker)\n               The following live broadcast is \n               recommended by the Imperial council in \n               the belief that your commitment to remain\n               upstanding citizens will be reinforced. \n               It is required viewing for all members of \n               the Imperial forces.\n\n     The screen cuts to various scenes of activity in the \n     streets of Mos Eisley.\n\n                            FEMALE ANNOUNCER\n                    (over speaker)\n               Time now for life on Tatooine. Brought to \n               viewers everywhere in the hope that our \n               own lives may be uplifted by the \n               comparison and enriched with the \n               gratitude of relief. This transmission is\n               unrehearsed and unedited and is hereby \n               begun without further comment as to its \n               lack of moral value.\n\n     The monitor cuts to a view inside of a cantina. There are\n     dozens of bizarre aliens seated throughout. The bar's \n     patrons are being entertained by a Bith band. Tork, the \n     bar's bouncer, picks up a customer from his seat and \n     takes him out of the bar. A man walks into the bar past \n     the exiting Tork and companion. The man is Krelman and he \n     is carrying a flower in his hand. The bartender, Ackmena,\n     interrupts two aliens seated at the bar who are \n     conversing.\n\n                            ACKMENA\n               Well, I'm certainly not going to get rich \n               with customers like you. I thought I \n               taught you to drink faster than that. Well, \n               at least you're steady. Oh, come on now. \n               Drink up. There's plenty more where that \n               came from.\n\n     Krelman walks up to the bar and takes a seat. He places \n     the flower on the countertop.\n\n                            ACKMENA\n                    (to Krelman)\n               What'll it be?\n\n                            KRELMAN\n               Hello, Ackmena.\n\n                            ACKMENA\n               Okay, we'll do it your way. Hello. Now, \n               we'll do it my way. What'll it be?\n\n                            KRELMAN\n               Can we talk?\n\n                            ACKMENA\n               Well of course we can talk. We are talking. \n               You're not ordering. I'm not pouring. We \n               are not drinking. We are talking. \n\n     Ackmena moves the flower aside that He brought.\n\n                            ACKMENA\n               I'm moving this to make room for a drink, \n               so that next time I say \"what'll it be\" \n               and you tell me. I can put it right there.\n\n                            KRELMAN\n               Doesn't matter. Give me anything. \n\n     He points to a red pitcher behind the bar. \n\n                            KRELMAN\n               I'll have one of those. \n\n     Ackmena gets the pitcher and pours some of it's contents \n     into a glass in front of him.\n\n                            KRELMAN\n               I'm sorry I couldn't get back before.\n\n                            ACKMENA\n               Ah, before what?\n\n                            KRELMAN\n               Uh, until now, until tonight. I thought \n               about it a dozen times. I had to be sure.\n\n                            ACKMENA\n               Ah, excuse me. I have a customer waiting. \n               I'll be right back.\n\n     She walks away from him.\n\n                            KRELMAN\n               \"Come back soon, I'll be waiting.\"\n\n     Ackmena pours a drink for an Ithorian who is seated \n     farther down the bar. Krelman pours his drink into the \n     top of his head. \n\n                            KRELMAN\n               Ackmena?\n\n     She hesitantly walks back over to Krelman.\n\n                            ACKMENA\n               How's your drink?\n\n                            KRELMAN\n               It's all gone. Look, there's a flower on \n               top of it.\n\n                            ACKMENA\n               I see there is. Do you want another drink?\n\n                            KRELMAN\n               The flower is for you. I wanted to bring \n               you something and that's all I could \n               think of.\n\n                            ACKMENA\n               I don't get many flowers. I uh... but you \n               didn't have to bring me anything Ah, ah...\n\n                            KRELMAN\n               Krelman.\n\n                            ACKMENA\n               Krelman, what a nice name.\n\n                            KRELMAN\n               When I left here the other night, I felt \n               something that I haven't felt in longer \n               than I care to remember. I felt alive \n               again. Someone made me feel like all the \n               years I've lived meant something. And all \n               you said was six simple words. \"Come back \n               soon, I'll be waiting.\"\n\n     He counts the last six words on the six fingers of his \n     left hand.\n\n                            ACKMENA\n               Well, after all, only words I probably...\n\n     He grabs her hand in his own.\n\n                            KRELMAN\n                    (interrupting)\n               ...more than words. I knew that at the \n               time. That's why I went home and thought \n               and thought about what you said.\n\n                            ACKMENA\n               Oh? What did I say?\n\n                            KRELMAN\n               It uh, it doesn't matter, silly. What you \n               said is not as important as what you meant.\n\n                            ACKMENA\n               Oh? What did I mean?\n\n                            KRELMAN\n               I decided what you meant was exactly the \n               thing I needed to hear.\n\n                            ACKMENA\n               Well, I'm glad about that.\n\n     Ackmena walks further down the bar. Krelman gets up and\n     follows her. He even goes behind the bar after her. She \n     is trying to clean behind the bar with a rag.\n\n                            KRELMAN\n               You know its funny. A man can live as \n               long as I have. Through all the ups and \n               downs and just when he thinks its all \n               over, someone cares for him again. I \n               wasn't looking for that when I came in \n               here. Maybe that's why it, it happened. \n               Because I wasn't asking for love anymore. \n               I wasn't desperate. I wasn't begging, \n               whining, ruffling, sniveling. I just came \n               in here for a drink and I find a lot more.\n\n     He hugs Ackmena from behind. She is at a loss for words.\n\n                            ACKMENA\n               Uh, uh, Kerlman...\n\n                            KRELMAN\n               Krelman.\n\n     She disengages herself from his embrace.\n\n                            ACKMENA\n               Uh, lis... listen uh, Krelman. You're, \n               you're kind and, and sweet and, and \n               terribly attractive but, if, if you're \n               saying what I think you're saying you\n               felt you meant I thought you needed to \n               hear then, I just have one thing to say. \n               I did not.\n\n                            KRELMAN\n               Ackmena, don't do this to me...\n\n                            ACKMENA\n                    (interrupting)\n               Now, please look! I have customers. \n\n     She motions for him to go back to the other side of the\n     counter and he complies.\n\n                            ACKMENA\n               Why don't you sit down. Finish your drink. \n               Have another drink. This one's on me.\n\n     Krelman is back in his seat. Ackmena pours a directly from\n     the pitcher into the top of his head.\n\n                            ACKMENA\n               Now, you stay just as long as you want. \n               But, I have business to attend to. I \n               really have no time for anything else.\n\n     She puts the pitcher down and walks away.\n\n                            KRELMAN\n               You'll change your mind. I just know you \n               will. Six simple words. I could wait \n               forever to hear it again because I know...\n\n     A customer at the bar gets up and leaves. Ackmena waves\n     farewell. \n\n                            ACKMENA\n                    (to customer)\n               Come back soon, I'll be waiting.\n\n     Krelman gets upset and puts his hood over his head. He \n     then puts his head down on the table. The wall screen \n     beeps and an Imperial officer appears on it. The music \n     and conversation stops as all attention is turned to the \n     wall screen.\n\n                            IMPERIAL OFFICER\n                    (on monitor)\n               Due to increased activity among subversive \n               forces, we are placing a curfew on the \n               entire Tatooine system effective \n               immediately. All inhabitants will return \n               to their homes at once. This order will \n               remain in effect until further notice.\n\n     All conversation resumes in the bar. Ackmena walks over \n     to the bandstand.\n\n                            ACKMENA\n                    (to band member)\n               Okay, Bobbarine. Take a break.\n\n     He says something back to her.\n\n                            ACKMENA\n               I don't know how long. Maybe forever. \n\n     The band has a fit at her answer.\n\n                            ACKMENA\n               Oh, don't leave me now. Please, please, I \n               have enough aggravation. Alright, one \n               more round before you leave. And this \n               one's on the me. \n                    (to Tork)\n               Tork, see what the boys on the bandstand \n               will have.\n\n     Tork heads over to follow her order. Ackmena goes back \n     behind the bar. She goes up to two aliens seated at the \n     bar. They are speaking to each other in an alien dialect.\n\n                            ACKMENA\n                    (to aliens)\n               Gentlemen, gentlemen, I don't know how to \n               tell you this but I guess the wall screen \n               said it all. We're closed. \n\n     The aliens just ignore her. She raises her voice to speak \n     to everyone.\n\n                            ACKMENA\n                    (yelling)\n               Gentlemen, I guess you didn't hear what I \n               said. The Empire has closed us down. Now, \n               I know this sort of thing happens all the \n               time. I... I'm sure it's just temporary, \n               fellas. The party is over.\n\n     Some of the patrons throw things at her. She gets angry. \n     Tork comes to her aid.\n\n                            ACKMENA\n                    (to patrons)\n               How dare you. You stop that.\n                    (to Tork)\n               Stop Tork, it's alright. I'll reason with them.\n\n     She goes over to two more aliens seated at the bar.\n\n                            ACKMENA\n                    (to two aliens)\n               Kelnor, Zutnor, come on you guys. Haven't \n               I always lent you money?\n\n     The continue their conversation as if she wasn't there. \n     She walks over to a table where Ludlow, a Rodian is \n     seated.\n\n                            ACKMENA\n                    (to Ludlow)\n               Ludlow, Ludlow, you of all creatures. \n               Please do me a favor and leave. \n\n     Ludlow looks down at the table and ignores her.\n\n                            ACKMENA\n               Ludlow, you're heartless. \n\n     She goes to another table.\n\n                            ACKMENA\n                    (to Thorp)\n               Thorp, Thorp, after all I've down for you. \n               Short memory, eh, Thorp?\n\n     He just  looks away from her.\n\n                            ACKMENA\n                    (yelling)\n               Short memory!\n\n     She goes to yet another table.\n\n                            ACKMENA\n                    (to creature, normally)\n               Helpmus, do you remember the time that... \n\n     She realizes that the creature she is talking to is not\n     Helpmus.\n\n                            ACKMENA\n               I don't believe we've met.\n\n     Two aliens enter the bar. Ackmena walks over to them.\n\n                            ACKMENA\n                    (to aliens)\n               We're closed! I said, we're closed. Look, \n               I'm sorry we are closed. The Empire just \n               imposed a curfew on this planet. Everybody \n               has to leave right now. Now... \n\n     One of the aliens pulls a blaster on her. Tork comes to\n     her aid. She stops him.\n\n                            ACKMENA\n                    (to Tork)\n               Tork, I don't want anymore trouble. You, \n               take care of the door.\n\n     The two aliens go into the bar and take a seat. The crowd\n     begins to pound their empty glasses on the tables.\n \n                            ACKMENA\n               Alright, alright, alright, alright. I can \n               take a hint. We'll have one more round. \n               This one's on the house. \n\n     They crows stop banging the tables and cheer her. She \n     heads back behind the bar. The band starts to play again.\n\n                            ACKMENA\n                    (under her breath)\n               I'll run a tab for the Empire.\n\n     Ackmena pours a drink and begins to sing. Drinks are \n     poured for everyone.\n\n                            ACKMENA\n                    (singing)\n               Just one more round, friend. Then homeward \n               bound, friend. Don't forget me in your \n               dreams. Just one more song, friend. The \n               night's get shorter it seems. Just one \n               more rhyme, friend. Yes, it's a crime, \n               friend. But you know time, friend. Time \n               can fly. \n\n     Some of the creatures get up and leave. Ackmena waves to\n     them.\n\n                            ACKMENA\n                    (still singing)\n               So it's goodnight, friend. Goodnight, but \n               not goodbye. Just one more drop, friend. \n               Before we stop, friend. One more moment \n               face to face. Next time you're dry, friend. \n               Try stopping by, friend. If there's a \n               light in the place. We may not cry, friend. \n               But we survive, friend. Look, we're alive, \n               friend. You and I. \n\n     Some more creatures leave the cantina.\n\n                            ACKMENA\n                    (still singing)\n               So say goodnight, friend. Goodnight, but \n               not goodbye. \n\n     An alien comes up to her and pulls her to the dance floor.\n     She begins to dance with him.\n\n                            ACKMENA\n                    (still singing)\n               Just one more dance, friend. Just one more \n               chance, friend. One more chorus, one more \n               tune. It's not the end, friend. If you're \n               a friend, friend. Then you come back to me \n               soon. But it's too late, pal. To celebrate, \n               pal. You have to wait, pal. Don't you cry. \n               Now, it's goodnight, friend. Goodnight \n               friend. Goodnight friend. Follow me! \n\n     Ackmena starts a line of creatures following her, \n     swinging their glasses in the air. She leads them to the \n     door and they begin to file out. Tork takes the glasses \n     from their outstretched hands as they leave.\n\n                            ACKMENA\n                    (still singing)\n               You're such a dear, friend. You know I'm \n               here, friend. Is that a tear, friend. In \n               your eye? Now, it's goodnight, friend.\n               Goodnight friend. \n\n     The last few people have just left. Ackmena closes the \n     door.\n\n                            ACKMENA\n                    (still singing)\n               Goodnight but not...\n\n     She walks back into the bar. Krelman is standing behind \n     the counter holding his flower. He hands the flower to \n     her. The wall screen goes off. The Imperial officer's \n     comlink beeps. He takes it off of his belt and pulls out \n     the antenna. \n\n                            VOICE\n                    (over comlink)\n               Return to base. Return to base. Return to \n               base. Return to base...\n\n                            IMPERIAL OFFICER\n                    (into comlink)\n               Message received and obeyed. \n\n     He closes the antenna and puts the comlink back on his \n     belt. He turns to his men.\n\n                            IMPERIAL OFFICER\n                    (to men)\n               We leave at once. \n\n     The stormtroopers turn to go. The officer stops one of \n     them.\n\n                            IMPERIAL OFFICER\n                    (to stormtrooper)\n               You, stay here. There's a male missing \n               from this household and I want you to be \n               here when he returns. It's possible, he's \n               one of the Rebels we're looking for.\n\n     The officer, guard, and stormtrooper all leave the house.\n     From upstairs is heard a voice.\n\n                            VOICE\n                    (from upstairs)\n               Return to base. Return to base. Return to \n               base. Return to base...\n\n     The stormtrooper goes up the staircase to investigate.\n\n70.",
        "dictionary": {
            "Tatooine": "A distant desert planet",
            "Imperial": "Governmental",
            "Rebels": "Opponents",
            "Mos Eisley": "A city on Tatooine",
            "Ackmena": "A bar owner",
            "Krelman": "A customer",
            "Ackmena's": "A bar's",
            "Ithorian": "A species",
            "Bith": "A species",
            "Rodian": "A species",
            "Thorp": "A customer",
            "Helpmus": "A customer",
            "Ludlow": "A customer",
            "Kelnor": "A customer",
            "Zutnor": "A customer",
            "Bobbarine": "A band member",
            "Tork": "A bouncer"
        }
    },
    {
        "message_id": 1655,
        "passage": "The stormtrooper walks up behind Lumpy who is on the \n     floor using his mini-transmitter.\n\n                            VOICE\n                    (from machine)\n               Return to base. Return to base. Return to \n               base. Return to base...\n\n     Lumpy turns around and sees the stormtrooper. He picks up \n     the machine and backs up against the wall. The \n     stormtrooper approaches a terrified Lumpy. He roughly \n     grabs the machine from Lumpy's hands and throws it to the\n     floor. It breaks into pieces. Lumpy runs past him and \n     goes downstairs. The stormtrooper follows.\n\n71.",
        "dictionary": {
            "stormtrooper": "Imperial soldier",
            "mini-transmitter": "small communication device"
        }
    },
    {
        "message_id": 1656,
        "passage": "Lumpy runs down the stairs and out the door closely \n     followed by the stormtrooper. \n\n72.",
        "dictionary": {
            "stormtrooper": "armored soldier"
        }
    },
    {
        "message_id": 1657,
        "passage": "Lumpy runs out the door. The stormtrooper stops in the\n     doorway with his blaster aimed at Lumpy. Chewie is \n     standing to one side of the stormtrooper. He starts to \n     take his bowcaster form his shoulder but stops because of \n     his son's danger. The stormtrooper motions with his \n     blaster for him to go over by Lumpy. Han sneaks up behind \n     the stormtrooper and knocks the blaster out of his hand. \n     Han makes a move to grab the fallen blaster and so does \n     the stormtrooper. The stormtrooper trips over some wood \n     on the porch and trips. He breaks thru the railing and \n     falls to his death. Han barely catches his balance and \n     saves himself from the same fate.\n\n                            HAN\n                    (to Lumpy)\n               Lumpy, are there any more inside? Come \n               here sweetheart. \n\n     Han picks up Lumpy in his arms.\n\n                            HAN\n               It's okay. It's alright now. Everything's \n               okay now. Here's your daddy. \n\n     Han hands Lumpy over to Chewie's waiting arms\n\n                            HAN\n                    (to Chewie)\n               Boy, has he grown. \n\n73.",
        "dictionary": {
            "stormtrooper": "Imperial soldier",
            "blaster": "laser gun",
            "bowcaster": "energy crossbow"
        }
    },
    {
        "message_id": 1658,
        "passage": "Han enters the home.\n\n                            HAN\n               It's okay everybody. He's gone. \n\n     Chewie and Lumpy come in the door. Chewie leaves his\n     bowcaster on the floor by the door. Han goes up to Malla \n     and hugs her.\n\n                            HAN\n                    (to Malla)\n               How are ya? Malla! Ha,ha! \n                    (to Itchy)\n               Itchy, you look wonderful. Doing well, \n               huh? Your son's been doin' you proud. \n               He's saved my tail more'n a couple of \n               times. \n\n     Malla growls something to Han.\n\n                            HAN\n                    (to Malla)\n               Look Malla, I'd love to but, I can't. I \n               gotta get back to the Falcon before \n               somebody stumbles across her. \n\n     Lumpy runs up to Han and hugs his leg.\n\n                            HAN\n               Hey, will you look at Lumpy? He's sure \n               grown, huh? \n\n     Han kneels down in front of Lumpy.\n\n                            HAN\n               An' I think his voice is changin'. \n\n     Lumpy lowers his head in embarrassment.\n\n                            HAN\n                    (to Lumpy)\n               Come on, I'm just teasin' ya. Well, look. \n\n     Han stands up and faces Malla.\n     \n                            HAN\n                    (to Malla)\n               I gotta go. Have a nice Life Day. But be \n               careful, a lotta troopers in the area. \n                    (to Chewie)\n               Chewie, check and see if the coast is \n               clear, will ya? \n                    (to everyone)\n               You're like a family to me. \n\n     Chewie looks out the door and growls back at Han.\n\n                            HAN\n               I know, bye.\n\n     Han turns and walks toward the door.\n\n                            HAN\n                    (to Chewie) \n               Okay pal? \n\n     Chewie growls. Han turns back to the wookiee family and\n     waves.\n\n                            HAN\n               Bye everybody.\n\n     Han and chewie turn and walk through the door. \n\n74.",
        "dictionary": {
            "Life Day": "Holiday",
            "Falcon": "Spaceship"
        }
    },
    {
        "message_id": 1659,
        "passage": "Han and Chewie embrace.\n\n                            HAN\n               Well pal, be careful. \n\n     Hans sees the stormtrooper's blaster on the ground. He \n     picks it up and tosses it off of the porch.\n\n                            HAN\n               They'll be lookin' for him. Take care.\n\n     Han leaves. Chewie goes back inside his home.\n\n75.",
        "dictionary": {
            "Hans": "John",
            "stormtrooper's": "soldier's"
        }
    }
]