[
    {
        "message_id": 1340,
        "passage": "A pristine and mighty OCEAN. Endless BLUE, dotted with\n          random, beautiful, mountainous BLACK ROCK ISLANDS, dotted\n          with countless GREEN TREES.\n          The Millennium Falcon FLIES INTO VIEW, BANKS toward one of\n          the ISLANDS.",
        "dictionary": {
            "Millennium Falcon": "Legendary Spacecraft",
            "OCEAN": "Sea",
            "BLUE": "Cerulean",
            "BLACK ROCK ISLANDS": "Dark Rocky Islands",
            "GREEN TREES": "Emerald Forest"
        }
    },
    {
        "message_id": 1341,
        "passage": "Rey, her staff strapped to her back, begins her hike up the\n          considerable mountain, glancing back at Chewie and R2-D2,\n          who watch her from the bottom of the ramp. A deep breath\n          and Rey continues her journey.",
        "dictionary": {
            "Chewie": "the Wookiee",
            "R2-D2": "the droid"
        }
    },
    {
        "message_id": 1342,
        "passage": "Built within the rock and foliage of this idyllic island are\n          seemingly endless ANCIENT STONE STEPS. Rey continues to\n          climb them, determined, despite her fatigue.",
        "dictionary": {
            "ANCIENT STONE STEPS": "timeless stone stairs"
        }
    },
    {
        "message_id": 1343,
        "passage": "Rey arrives at a clearing. Small, modest, primitive stone\n          structures. But no one around. Rey walks past them, sees,\n          senses no one.\n\n          And then she stops. Feels something. She turns.\n          Standing forty feet away from her, his back to us, is a MAN,\n          in a CLOAK AND ROBE.\n\n          Rey stares, knowing exactly who it is. But she just stares\n          for what seems like forever. Until he finally TURNS, SLOWLY,\n          to her. Pulls back his hood.\n\n          IT IS LUKE SKYWALKER.\n\n          Older now, white hair, bearded. He looks at Rey. A kindness\n          in his eyes, but there's something tortured, too. He doesn't\n          need to ask her who she is, or what she is doing here. His\n          look says it all.\n\n          In response, Rey pulls something from the pack.\n\n          LUKE'S LIGHTSABER.\n          And she holds it out to him. An offer. A plea. The galaxy's\n          only hope.\n\n          HOLD ON LUKE SKYWALKER'S INCREDIBLE FACE, amazed and\n          conflicted at what he sees, as our MUSIC BUILDS, the promise\n          of an adventure, just beginning...",
        "dictionary": {
            "Luke Skywalker": "The legendary Jedi Master",
            "Lightsaber": "Energy sword"
        }
    },
    {
        "message_id": 1344,
        "passage": "STAR WARS EPISODE 3: REVENGE OF THE SITH SCRIPT \n\nGeorge Lucas \n\n\n1",
        "dictionary": {}
    },
    {
        "message_id": 1345,
        "passage": "A long time ago in a galaxy far, far away. \n\nA vast sea of stars serves as the backdrop for the Main Title, followed by a rollup, which crawls into infinity. \n\nWar! The Republic is crumbling under attacks by the ruthless Sith Lord, Count Dooku. There are heroes on both sides. Evil is everywhere. \n\nIn a stunning move, the fiendish droid leader, General Grievous, has swept into the Republic capital and kidnapped Chancellor Palpatine, leader of the Galactic Senate. \n\nAs the Separatist Droid Army attempts to flee the besieged capital with their valuable hostage, two Jedi Knights lead a desperate mission to rescue the captive Chancellor. . . . \n\nPAN DOWN to reveal a REPUBLIC ATTACK CRUISER. Continue to PAN with the Cruiser as TWO JEDI STARFIGHTERS enter and head toward an enemy Battle Cruiser. TRUCK with the Jedi Fighters as they maneuver in unison, dodging flack and enemy laser fire. R2-D2 is on Anakin's ship. R4-P17 is on Obi-Wan's ship. A giant space battle is revealed as the tiny Jedi ships continue their assault in a synchronous ballet. \n\n2",
        "dictionary": {
            "A long time ago in a galaxy far, far away": "In a distant past in a vast universe",
            "Sith Lord": "Powerful Dark Sorcerer",
            "Galactic Senate": "Interstellar Assembly",
            "Separatist Droid Army": "Robot Rebellion Forces",
            "Jedi Knights": "Guardians of Peace",
            "Republic Attack Cruiser": "Government Warship",
            "Jedi Starfighters": "Peacekeepers' Fighter Jets",
            "R2-D2": "Robot Assistant",
            "R4-P17": "Computer Companion",
            "Battle Cruiser": "Warship"
        }
    },
    {
        "message_id": 1346,
        "passage": "OBI-WAN bounces through the flack with a frown. His ship rocks violently. \n\n3",
        "dictionary": {
            "OBI-WAN": "Captain"
        }
    },
    {
        "message_id": 1347,
        "passage": "ANAKIN smiles as he blasts a TRADE FEDERATION DROID DROP FIGHTER. \n\nANAKIN: There isn't a droid made that can out fly you, Master, and no other way to get to the Chancellor . . . \n\nOBI-WAN: Look out, four droids inbound . . . \n\n4",
        "dictionary": {
            "TRADE FEDERATION": "Confederation",
            "DROID DROP FIGHTER": "Aerial Drone"
        }
    },
    {
        "message_id": 1348,
        "passage": "The TWO JEDI FIGHTERS swerve in unison as FOUR TRADE FEDERATION DROID DROP FIGHTERS attack. After several clever moves by the Jedi, two of the FEDERATION DROID DROP FIGHTERS collide with each other in a ball of flame. \n\n5",
        "dictionary": {
            "TWO JEDI FIGHTERS": "Two Pilots",
            "FOUR TRADE FEDERATION DROID DROP FIGHTERS": "Four Enemy Jets",
            "FEDERATION DROID DROP FIGHTERS": "Enemy Drones"
        }
    },
    {
        "message_id": 1349,
        "passage": "OBI-WAN struggles to maintain control of his ship. \n\nOBI-WAN: We've got to split them up. \n\nANAKIN: Break left, fly through the guns on that tower. \n\nOBI-WAN flies to the left of a huge tower on a REPUBLIC CRUISER. The TWO DROID DROP FIGHTERS follow. \n\nOBI-WAN: Easy for you to say . . . why am I always the bait? \n\nANAKIN: Don't worry. I'm coming around behind you. \n\nOBI-WAN deftly maneuvers around a large Starship's superstructure, but the TWO DROID FIGHTERS stay on his tail, BLASTING him with intense laser fire. \n\nOBI-WAN: Anakin, they're all over me! \n\nANAKIN: Dead ahead! Closing . . . lock onto him, Artoo . . . \n\nARTOO BEEPS his reply as ANAKIN swoops in for the kill. ANAKIN BLASTS one of the DROID DROP FIGHTERS. It EXPLODES. \n\nANAKIN: (continuing, laughs) We got him, Artoo! \n\nANAKIN BLASTS away at the second DROID DROP FIGHTER as ARTOO BEEPS an angry warning. \n\nANAKIN: I copy, Artoo. \n\nOBI-WAN: I'm going down on the deck. \n\nANAKIN: Good idea ... I need some room to maneuver. \n\nOBI-WAN dives toward the surface of one of the larger TRADE FEDERATION BATTLESHIPS and is forced to fly through a maelstrom of laser flack. He skims the surface, followed by the DROID DROP FIGHTER, which is followed by ANAKIN. \n\nANAKIN: (continuing) Cut right. Do you hear me?! Cut right. Don't let him get a handle on you. Come on, Artoo, lock on! Lock on! \n\nARTOO BEEPS. The crosshairs merge on the DROID DROP FIGHTER. \n\nOBI-WAN: Hurry up! I don't like this! \n\nOBI-WAN flies through a narrow gap between two towers on a Battleship. The DROID DROP FIGHTER hits one of Obi-Wan's wings with a laser blast, and parts of the ship go flying around Obi-Wan's Astro Droid, ARFOUR. \n\nOBI-WAN: (continuing) Ouch! \n\nR-4 BEEPS a blue streak. \n\nOBI-WAN: (continuing) Don't even try to fix it, Arfour. I've shut it down. \n\nANAKIN: We're locked on ... we've got him . . . \n\nANAKIN drops in behind the DROID DROP FIGHTER and blows him apart. ARTOO SQUEALS with delight. \n\nANAKIN: (continuing) Yeah! We got him . . . good going, Artoo. \n\nOBI-WAN: Next time you're the bait . . . Now let's find the Command Ship and get on with it ... \n\nR-4 BEEPS a blue streak. \n\nANAKIN: Lock onto them, Artoo. Master, General Grievous's ship is directly ahead. \n\nARTOO BEEPS a reply, and it reads out in Anakin's cockpit. \n\nANAKIN: (continuing) The one crawling with vulture droids. \n\n6",
        "dictionary": {
            "REPUBLIC CRUISER": "Galactic Warship",
            "TWO DROID DROP FIGHTERS": "Two Aerial Drones",
            "ARTOO": "Droid Assistant",
            "DROID DROP FIGHTER": "Aerial Drone",
            "TRADE FEDERATION BATTLESHIPS": "Imperial Warships",
            "OBI-WAN": "Master Pilot",
            "ANAKIN": "Young Pilot",
            "R-4": "Astro Droid",
            "ARFOUR": "Mechanical Assistant"
        }
    }
]