[
    {
        "message_id": 20,
        "passage": "QUI-GON and OBI-WAN swim behind JAR JAR, who is very much at home in the\nwater. Down they swim into murky depths. In the distance the glow of Otoh\nGunga, an underwater city made up of large bubbles, becomes more distinct.\nThey approach the strange, art nouveau habitat. JAR JAR swims magically\nthrough one of the bubble membranes, which seals behind him. OBI-WAN and\nQUI-GON follow.",
        "dictionary": {
            "Otoh Gunga": "Underwater Metropolis",
            "Jar Jar": "Exotic Aquatic Guide",
            "Qui-Gon": "Jedi Master",
            "Obi-Wan": "Jedi Knight"
        }
    },
    {
        "message_id": 21,
        "passage": "GUNGANS in the square scatter when they see the strange JEDI. Four GUARDS\narmed with long electro-poles ride two-legged KAADUS into the square. The\nGUARDS, led by CAPTAIN TARPALS, point their lethal poles at the dripping\ntrio.\n\nJAR JAR : Heyo-dalee, Cap'n Tarpals, Mesa back!\nCAPT. TARPALS : Noah gain, Jar Jar. Yousa goen tada Bosses. Yousa in big\ndudu this time.\n\nCAPT. TARPALS gives JAR JAR a slight zap with his power pole. JAR JAR jumps\nand moves off, followed by the two JEDI.\n\nJAR JAR : How wude.",
        "dictionary": {
            "GUNGANS": "Aliens",
            "JEDI": "Mystics",
            "KAADUS": "Mechanical Beasts",
            "GUARDS": "Enforcers",
            "CAPTAIN TARPALS": "Commander",
            "JAR JAR": "Character",
            "Bosses": "Authorities",
            "dudu": "trouble"
        }
    },
    {
        "message_id": 22,
        "passage": "The Bosses' Board Room has bubble walls, with small lighted fish swimming\naround outside like moving stars. A long circular judge's bench filled with\nGUNGAN OFFICIALS dominates the room. OBI-WAN and QUI-GON stand facing BOSS\nNASS, who sits on a bench higher than the others.\n\nBOSS NASS : Yousa cannot bees hair. Dis army of mackineeks up dare tis new\nweesong!\nQUI-GON : That droid army is about to attack the Naboo. We must warn them.\nBOSS NASS : Wesa no like da Naboo! Un dey no like uss-ens. Da Naboo tink\nday so smarty den us-ens. Day tink day brains so big.\nOBI-WAN : After those droids take control of the surface, they will come\nhere and take control of you.\nBOSS NASS : No, mesa no tink so. Mesa scant talkie witda Naboo, and no\nnutten talkie it outlaunders. Dos mackineeks no comen here! Dey not know of\nuss-en.\nOBI-WAN : You and the Naboo form a symbiont circle. What happens to noe of\nyou will affect the other. You must understand this.\nBOSS NASS : Wesa wish no nutten in yousa tings, outlaunder, and wesa no\ncare-n about da Naboo.\nQUI-GON : (waves his hand) Then speed us on our way.\nBOSS NASS : Wesa gonna speed yousaway.\nQUI-GON : We need a transport.\nBOSS NASS : Wesa give yousa una bongo. Da speedest way tooda Naboo tis goen\nthrough da core. Now go.\nQUI-GON : Thank you for your help. We go in peace.\n\nQUI-GON and OBI-WAN turn to leave.\n\nOBI-WAN : Master, whats a bongo?\nQUI-GON : A transport, I hope.\n\nThe JEDI notice JAR JAR in chains to one side, waiting to hear his verdict.\nQUI-GON stops. JAR JAR gives him a forlorn look.\n\nJAR JAR : Daza setten yous up. Goen through da planet core is bad bombin!!\nQUI-GON : Thank you, my friend.\nJAR JAR : Ahhh...any hep hair would be hot.\n\nJAR JAR's soulful look is counterpointed by a sheepish grin.\n\nOBI-WAN : We are short of time, Master.\nQUI-GON : We'll need a navigator to get us through the planet's core. This\nGungan my be of help.\n\nQUI-GON walks bact to BOSS NASS.\n\nQUI-GON : (cont'd) What is to become of Jar Jar Binks here?\nBOSS NASS : Binkss brokeen the nocombackie law. Hisen to be pune-ished.\nQUI-GON : He has been a great help to us. I hope the punishment will not be\ntoo severe.\nBOSS NASS : Pounded unto death.\nJAR JAR : (grimacing) Oooooh...Ouch!\n\nOBI-WAN looks concerned. QUI-GON is thinking.\n\nQUI-GON : We need a navigator to get us through the planet's core. I have\nsaved Jar Jar Binks' life. He owes me what you call a \"life.debt.\"\nBOSS NASS : Binks. Yousa havena liveplay with thisen hisen?\n\nJAR JAR nods and joins the JEDI. QUI-GON waves his hand.\n\nQUI-GON : Your gods demand that his life belongs to me now.\nBOSS NASS : Hisen live tis yos, outlauder. Begone wit him.\nJAR JAR : Count mesa outta dis! Better dead here, den deader in da\ncore...Yee guds, whata mesa sayin?!",
        "dictionary": {
            "GUNGAN OFFICIALS": "High-ranking officials",
            "OBI-WAN": "A wise Jedi",
            "QUI-GON": "A wise Jedi",
            "BOSS NASS": "A stubborn leader",
            "Mackineeks": "Droids",
            "Naboo": "A planet",
            "Bongo": "A transport",
            "JAR JAR": "A Gungan",
            "Gungan": "An alien species",
            "Nocombackie law": "A law",
            "Life.debt": "A debt of gratitude",
            "Yousa": "You",
            "Ussa": "Us",
            "Uss-en": "Us",
            "Nutmeg": "Nothing",
            "Outlaunder": "An outsider",
            "Symbiont circle": "A mutually beneficial relationship"
        }
    },
    {
        "message_id": 23,
        "passage": "A strange little submarine propels itself away from the Otoh Gunga, leaving\nthe glow of the settlement in the distance.",
        "dictionary": {
            "Otoh Gunga": "underwater city",
            "submarine": "watercraft"
        }
    },
    {
        "message_id": 24,
        "passage": "OBI-WAN in the co-pilots seat, JAR JAR guides the craft.\n\nJAR JAR : Dis is nusen.\nOBI-WAN : Master, why do you keep dragging these pathetic life forms along\nwith us?...Here, take over.\nJAR JAR : Hey, ho? Where wesa goen??\nQUI-GON : You're the navigator.\nJAR JAR : Yo dreamen mesa hopen...,br QUI-GON : Just relax, the Force will\nguide us...\nJAR JAR : Ooooh, maxibig...\"da Force\"...Wellen, dat smells stinkowiff.\n\nJAR JAR veers the craft to the left and turns the lights on. The coral\nvistas are grand, fantastic, and wonderous.\n\nOBI-WAN : Why were you banished, Jar Jar?\nJAR JAR : Tis a long tale, buta small part wawdabe\nmesa...ooooh...aaaa.....clumsy.\nOBI-WAN : They banished you because you're clumsy?\n\nAs the little sub glides into the planet core, a large dark shape begins to\nfollow.\n\nJAR JAR : Mesa cause-ed mabee one or duey lettal bitty axadentes...yud-say\nboom da gasser, un crash Der Bosses heyblibber...den banished.\n\nSuddenly there is a loud CRASH, and the little craft lurches to one side.\nQUI-GON looks around and sees a huge, lumimnous OPEE SEA KILLER has hooked\nthem with its long gooey tongue.\n\nQUI-GON : Full speed ahead.\n\nInstead of full ahead, JAR JAR jams the controls into reverse. The sub\nflies into the mouth of the creature.\n\nJAR JAR : Oooops.\nOBI-WAN : Give me the controls.\n\nOBI-WAN takes over the controls and the OPEE SEA KILLER instantly releases\nthe sub from its mouth.\n\nJAR JAR : Wesa free!\n\nAs the sub zooms away they see a larger set of jaws, munching on the\nhapless KILLER. The jaws belong to the incredible SANDO AQUA MONSTER. The\nlights on the tiny sub begin to flicker as they cruise deeper into the\ngloom.\n\nQUI-GON : There's always a bigger fish.",
        "dictionary": {
            "OPEE SEA KILLER": "Giant Squid",
            "JAR JAR": "First Officer",
            "da Force": "the Power",
            "heyblibber": "nonsense",
            "Der Bosses": "the Authorities",
            "yud-say boom da gasser": "make a big explosion",
            "OBI-WAN": "Co-Pilot",
            "QUI-GON": "Captain"
        }
    },
    {
        "message_id": 25,
        "passage": "NUTE and RUNE stand before a hologram of DARTH SIDIOUS.\n\nNUTE : The invasion is on schedule, My Lord.\nDARTH SIDIOUS : Good. I have the Senate bogged down in procedures. By the\ntime this incident comes up for a vote, they will have no choice but to\naccept your control of the system.\nNUTE : The Queen has great faith the Senate will side with her.\nDARTH SIDIOUS : Queen Amidala is yound and naive. You will find controlling\nher will not be difficult. You have done well, Viceroy.\nNUTE : Thank you, My Lord.\n\nDARTH SIDIOUS fades away.\n\nRUNE : You didn't tell him about the missing Jedi?\nNUTE : No need to report that to him, until we have something to report.",
        "dictionary": {
            "DARTH SIDIOUS": "The Emperor",
            "Viceroy": "Governor",
            "My Lord": "Your Excellency"
        }
    },
    {
        "message_id": 26,
        "passage": "Sparks are flying, and water is leaking into the cabin. The sound of the\npower drive drops.\n\nOBI-WAN : .....we're losing power.\n\nOBI-WAN is working with the sparking wires. JAR JAR panics.\n\nQUI-GON : Stay calm. We're not in trouble yet.\nJAR JAR : What yet? Monstairs out dare! Leak'n in here, all'n sink'n, and\nnooooo power! You nutsen! WHEN YOUSA TINK WESA IN TROUBLE?!!!?\nOBI-WAN : Power's back.\n\nThe lights flicker on, revealing an ugly COLO CLAW FISH right in front of\nthem.\n\nJAR JAR : Monstairs back!\n\nThe large COLO CLAW FISH is surprised and rears back. The sub turns around\nand speeds away.\n\nJAR JAR : (cont'd) Wesa in trouble now??\nQUI-GON : Relax.\n\nQUI-GON puts his hand on JAR JAR's shoulder. JAR JAR relaxes into a coma.\n\nOBI-WAN : You overdid it.\n\nThe COLO CLAW FISH leaps after the fleeing sub as it shoots out of the\ntunnel and into the waiting jaws of the SANDO AQUA MONSTER.\n\nOBI-WAN (cont'd) This is not good!\n\nJAR JAR regains consciousness.\nJAR JAR : Wesa dead yet?? Oie Boie!\n\nJAR JAR's eyes bulge, and he faints again. The sub narrowly avoids the\ndeadly teeth of the AQUA MONSTER. The COLO CLAW FISH chasing them isn't so\nlucky. It is munched in half by the larger predator. The little sub slips\naway.\n\nQUI-GON : Head for that outcropping.",
        "dictionary": {
            "Monstairs": "Sea Monsters",
            "Colo Claw Fish": "Large Fish",
            "Sando Aqua Monster": "Sea Predator",
            "Nutsen": "Crazy",
            "Oie Boie": "Oh No",
            "Yo'Sa": "You're",
            "Wesa": "We're"
        }
    },
    {
        "message_id": 27,
        "passage": "The long columns of the DROID ARMY move down the main road leading to\nTheed, the Naboo capital.",
        "dictionary": {
            "DROID ARMY": "Robot Legion",
            "Theed": "Naboo City"
        }
    },
    {
        "message_id": 28,
        "passage": "As the QUEEN watches helplessly from a window in the palace, a transport\ncarrying NUTE and RUNE lands in Theed Plaza. They exit the transport.\n\nNUTE : Ah, victory!",
        "dictionary": {
            "QUEEN": "Monarch",
            "Theed": "Capital City",
            "NUTE": "General",
            "RUNE": "Commander"
        }
    },
    {
        "message_id": 29,
        "passage": "The little sub continue to propel itself toward the surface, which is\nbrightly lit.\n\nJAR JAR : Wesa dude it!",
        "dictionary": {
            "JAR JAR": "This guy"
        }
    }
]