[
    {
        "message_id": 1400,
        "passage": "OBI-WAN and ANAKIN lead PALPATINE down a hallway toward the hangar bay. \n\n57",
        "dictionary": {
            "OBI-WAN": "Wise Mentor",
            "ANAKIN": "Young Pilot",
            "PALPATINE": "Supreme Leader"
        }
    },
    {
        "message_id": 1401,
        "passage": "It is extremely windy as bits and pieces are continually sucked into space. The hangar bay doors are closed, but great stresses are being exerted as the ship twists, re-entering the atmosphere of Coruscant. They stop in a doorway leading into the hangar bay. \n\nOBI-WAN: None of those ships will get us anywhere. \n\nANAKIN: I agree. \n\nPALPATINE: What are we going to do? \n\nANAKIN: I don't know. \n\nOBI-WAN: Don't look at me. I don't know. \n\nANAKIN and PALPATINE both look to OBI-WAN. He shrugs his shoulders. Anakin's Fighter has been sucked out of the hangar bay and is totaled. Suddenly, the ship turns on its side. \n\nANAKIN: Here, Chancellor, lock this around your waist, and hold on. \n\nOBI-WAN: We'll head toward the bridge and see if we can find an escape pod. \n\nANAKIN hands PALPATINE the end of a cable that is attached to his utility belt. PALPATINE attaches it around his waist. ANAKIN and OBI-WAN throw their utility cables to some pipes in the ceiling and swing to a second set of pipes. \n\n58",
        "dictionary": {
            "Coruscant": "Capital Planet",
            "OBI-WAN": "Captain Smith",
            "ANAKIN": "Lieutenant Johnson",
            "PALPATINE": "Government Official",
            "Chancellor": "Head of State"
        }
    },
    {
        "message_id": 1402,
        "passage": "OBI-WAN grabs onto the pipes that run along what was the ceiling and is now the wall. As he moves out into the hangar, TWO SUPER BATTLE DROIDS start firing at him. The Jedi ignites his lightsaber and deflects the bolts back at the DROIDS, blowing them up. ANAKIN and PALPATINE follow OBI-WAN along the pipes running along the ceiling of the hangar. PALPATINE struggles against the escaping air of the pressurized hangar. PALPATINE loses his grip as a pipe breaks, causing a rush of steam, but ANAKIN manages to maintain his grasp on the pipe as the CHANCELLOR dangles on the other end of the utility cable. They are surrounded by SPARKS and EXPLOSIONS as the ship twists and tries to break apart. ANAKIN moves out of the steam and struggles to pull PALPATINE back to safety. ANAKIN is almost pulled loose in the buffeting winds. The ceiling behind them buckles, causing pipes to break, creating geysers of steam. Some bits of pipe go hurling into the blast doors and out into space. They make it through a hangar doorway and close it behind them. \n\n59",
        "dictionary": {
            "OBI-WAN": "Jedi Master",
            "SUPER BATTLE DROIDS": "High-Tech Defense Systems",
            "DROIDS": "Robots",
            "Jedi": "Warrior Monk",
            "lightsaber": "Energy Sword",
            "ANAKIN": "Young Padawan",
            "PALPATINE": "Chancellor",
            "utility cable": "Safety Line",
            "SPARKS": "Electric Discharges",
            "EXPLOSIONS": "Detonations"
        }
    },
    {
        "message_id": 1403,
        "passage": "OBI-WAN, ANAKIN and PALPATINE are out of breath. \n\nANAKIN/OBI-WAN: Well, that was close. \n\nThey laugh. \n\n60",
        "dictionary": {
            "OBI-WAN": "Wise Mentor",
            "ANAKIN": "Young Hero"
        }
    },
    {
        "message_id": 1404,
        "passage": "BODYGUARD: General, we found the Jedi. They're in hallway 328. \n\nGENERAL GRIEVOUS: Activate ray shields. \n\n61",
        "dictionary": {
            "Jedi": "Knights",
            "General Grievious": "Commander"
        }
    },
    {
        "message_id": 1405,
        "passage": "They run down the hallway. Suddenly, ray shields drop around them, putting them in an electronic box in the middle of the hallway. \n\nANAKIN: Ray shields! \n\nOBI-WAN takes a deep breath to express his total disappointment. \n\nOBI-WAN: Wait a minute, how'd this happen! We're smarter than this. \n\nANAKIN: Apparently not, Master. This is the oldest trap in the book . . . Well ... I was distracted. \n\nOBI-WAN: Oh, so all of a sudden it's my fault. \n\nANAKIN: You're the Master. I'm just a hero. \n\nOBI-WAN: I'm open to suggestions here. \n\nPALPATINE: Why don't we let them take us to General Grievous. Perhaps with Count Dooku's demise, we can negotiate our release. \n\nThe Jedi look at each other in disbelief. \n\nANAKIN: I say . . . patience. \n\nOBI-WAN: Patience! That's your plan, is it? \n\nANAKIN: Yes, Artoo will be along in a few moments and he'll release the ray shields . . . \n\nARTOO comes skidding across the hallway and bashes into the opposite wall. He takes a moment to compose himself. \n\nANAKIN: (continuing) See! No problem. \n\nSuddenly several doorways open, revealing TWO DESTROYER DROIDS. SIXTEEN SUPER BATTLE DROIDS emerge from behind the DESTROYER DROIDS. \nARTOO turns and zaps one of the SUPER BATTLE DROIDS who then kicks ARTOO over. \n\nSUPER BATTLE DROID: Don't move, dummy. Ouch! Zap this. \n\nOBI-WAN: Do you have a plan B? \n\n62",
        "dictionary": {
            "Ray shields": "Energy barriers",
            "Anakin": "Luke",
            "Palpatine": "Senator"
        }
    },
    {
        "message_id": 1406,
        "passage": "OBI-WAN, ANAKIN PALPATINE, and ARTOO are captured by GENERAL GRIEVOUS. They stand before the ALIEN DROID GENERAL. \n\nGENERAL GRIEVOUS: Oh yes. General Kenobi, the Negotiator. We've been waiting for you. That wasn't much of a rescue. \n\nA BATTLE DROID walks to GENERAL GRIEVOUS and hands him the JEDI'S lightsabers. \n\nOBI-WAN: That depends upon your point of view. Hah! \n\nGENERAL GRIEVOUS: And Anakin Skywalker ... I was expecting someone with your reputation to be a little older. \n\nANAKIN: General Grievous . . . Supreme Commander of the Droid Armies. You're shorter than I expected. \n\nGENERAL GRIEVOUS: Ahhhh, Jedi scum . . . \n\nOBI-WAN: Anakin, try not to upset him. We have a job to do. \n\nGENERAL GRIEVOUS: Your lightsabers will make a fine addition to my collection. \n\nOBI-WAN: Not this time. And this time you won't escape. \n\nANAKIN: Artoo. \n\nARTOO creates a distraction by extending all his arms, shooting out electrical pulses, and bouncing around. \nOBI-WAN, hands restrained with electrobonds, spins around, reaches out and, using the Force, yanks his lightsaber out of the General's hand, ignites it, and cuts his bonds. He continues to spin around and cuts Anakin free. \n\nGENERAL GRIEVOUS: Crush them! Make them suffer! \n\nANAKIN uses the Force to yank his lightsaber out of the General's hand. \n\nThe DROIDS that surround them begin to FIRE. OBI-WAN and ANAKIN jump into the line of fire. The bridge degenerates into chaos. OBI-WAN and ANAKIN are locked in a pitched battle between electro staffs and laser swords with GENERAL GRIEVOUS's TWO BODYGUARDS. \n\nCHANCELLOR PALPATINE is taken away by two BATTLE DROIDS. GENERAL GRIEVOUS walks around the bridge directing the BATTLE DROIDS. \n\nGENERAL GRIEVOUS: Stay and watch your stations. \n\nOBI-WAN fights one of General Grievous's BODYGUARDS. The BODYGUARD carries an electrified staff about five feet long. When the laser sword hits it, electrical bolts fly everywhere and surround the laser sword. OBI-WAN is unable to cut the staff. The Jedi gets whacked pretty good a couple of times and is knocked halfway across the bridge. \nOBI-WAN pulls himself together and attacks again, cutting off the DROID BODYGUARD'S head. The DROID BODYGUARD keeps attacking. ANAKIN struggles to defend himself against the other manic DROID BODYGUARD. He cuts the DROID BODYGUARD in half. TWO BATTLE DROIDS try to take the CHANCELLOR away. \nANAKIN follows them down the hallway and cuts them down, rescuing the Chancellor. \nOBI-WAN finishes off the headless BODYGUARD. It crumbles to the floor in pieces. \nALARMS SOUND as the giant spacecraft begins to list and fall out of orbit. A PILOT yells at GENERAL GRIEVOUS. \n\nPILOT: Sir, we are falling out of orbit. All aft control cells are dead. \n\nGENERAL GRIEVOUS: Stay on course . . . Don't bother with them. Keep the ship in orbit. \n\nOBI-WAN and ANAKIN destroy the remaining DROIDS. GENERAL GRIEVOUS retrieves one of the BODYGUARD'S staffs and faces OBI-WAN. ANAKIN leaps over a console and lands behind GENERAL GRIEVOUS. \n\nGENERAL GRIEVOUS: You lose, General Kenobi. \n\nOne of the PILOTS stands next to the General. \n\nPILOT: The ship is breaking up! \n\nGENERAL GRIEVOUS: We've run out of time. \n\nOBI-WAN tries to get at GENERAL GRIEVOUS. ANAKIN runs at the General from the opposing side. GENERAL GRIEVOUS turns and throws his electrified staff at the window. It breaks, causing chaos as everything that is not nailed down is sucked into space. GENERAL GRIEVOUS is the first one sucked out into space. He fires a cable from his arm that attaches to the ship. He swings in and lands firmly on the side of the ship. \nOBI-WAN, ANAKIN, and PALPATINE hold on for dear life. A blast shield closes around where the window used to be. \n\n63",
        "dictionary": {
            "ALIEN DROID GENERAL": "Extraterrestrial Warlord",
            "JEDI'S lightsabers": "Knights' Swords",
            "DROID BODYGUARD": "Robotic Sentinel",
            "BATTLE DROID": "War Droid",
            "GENERAL GRIEVOUS": "Warlord Grievous",
            "Supreme Commander of the Droid Armies": "Commander of the Robot Legions",
            "Jedi scum": "Despicable Knights",
            "DROIDS": "Robots",
            "electrobonds": "Energy Restraints",
            "Force": "Telekinetic Power",
            "electro staffs": "Energy Staves",
            "laser swords": "Energy Blades",
            "PILOT": "Astronaut"
        }
    },
    {
        "message_id": 1407,
        "passage": "OBI-WAN continues to fight the BATTLE DROIDS. The DROIDS have backed him into a corner. OBI-WAN hides behind a control panel as the DROIDS blast away at him. He jumps up and over the DROIDS, cutting most of them down before he lands. He destroys the DROIDS and joins ANAKIN. \nANAKIN and OBI-WAN cut through the rest of the DROIDS as if they were made of butter. PALPATINE stands in shock as he watches the carnage. Droid parts are firing everywhere. OBI-WAN and ANAKIN stand back to back and cut down the last of the DROIDS just as there is a huge shudder, followed by more alarms. SPARKS begin to fly outside the windows. \n\nPALPATINE: The hull is burning up! \n\n64",
        "dictionary": {
            "BATTLE DROIDS": "Robot Soldiers",
            "DROIDS": "Robots",
            "OBI-WAN": "Master Jedi",
            "ANAKIN": "Young Padawan",
            "PALPATINE": "Supreme Chancellor"
        }
    },
    {
        "message_id": 1408,
        "passage": "GENERAL GRIEVOUS detaches his cable and crawls along the exterior hull of the Federation Cruiser, using his magnetized hands and feet. He reaches a row of escape pods and enters an airlock. \n\n65",
        "dictionary": {
            "General Grievous": "High-ranking Officer"
        }
    },
    {
        "message_id": 1409,
        "passage": "GENERAL GRIEVOUS enters the escape pod bay through the hatch. The Droid General goes to a control panel and opens an escape pod. \n\nGENERAL GRIEVOUS: Time to abandon ship. \n\nGENERAL GRIEVOUS pulls a row of switches, and one by one the escape pods are jettisoned. \n\n66",
        "dictionary": {
            "Droid General": "Robot Commander",
            "jetissoned": "launched"
        }
    }
]