[
    {
        "message_id": 1610,
        "passage": "The Falcon is heading towards the green planet of Kashyyyk.\n\n26.",
        "dictionary": {
            "Kashyyyk": "the green planet",
            "Wookiee": "alien inhabitant"
        }
    },
    {
        "message_id": 1611,
        "passage": "HAN\n               I've never seen so much Imperial traffic \n               in this system. \n\n     A display is shown of the Imperial traffic to show Han's\n     point.\n\n                            HAN\n               Better land on the north side. It'll be \n               safer there.\n\n     Chewie growls.\n\n                            HAN\n               So, it's a long walk. A little exercise \n               never hurt anybody. \n\n27.",
        "dictionary": {
            "HAN": "Captain",
            "Imperial": "Government"
        }
    },
    {
        "message_id": 1612,
        "passage": "The Falcon is just about to enter the atmosphere of the\n     planet.\n\n28.",
        "dictionary": {
            "Falcon": "Spacecraft",
            "atmosphere of the planet": "planetary environment"
        }
    },
    {
        "message_id": 1613,
        "passage": "HAN\n               Happy Life Day, pal.\n\n29.",
        "dictionary": {
            "HAN": "Captain",
            "Happy Life Day": "Joyful Celebration"
        }
    },
    {
        "message_id": 1614,
        "passage": "The Falcon flies over a forest on the surface of the \n     planet Kashyyyk.\n\n30.",
        "dictionary": {
            "Kashyyyk": "exotic planet",
            "Falcon": "high-speed aircraft"
        }
    },
    {
        "message_id": 1615,
        "passage": "Lumpy looks up at the sound of a ship flying overhead. He\n     becomes very excited.\n\n31.",
        "dictionary": {
            "Lumpy": "Excitable Youth"
        }
    },
    {
        "message_id": 1616,
        "passage": "Malla and Saundan are seated at the table as they hear the\n     sound of the ship. The stand up excitedly.\n\n                            SAUNDAN\n               Sounds like a starship. What I tell ya? \n               Must be Chewbacca now!\n\n     Malla growls happily at his announcement.\n\n32.",
        "dictionary": {
            "starship": "spaceship",
            "Chewbacca": "Captain"
        }
    },
    {
        "message_id": 1617,
        "passage": "Lumpy runs towards the stairs and heads down.\n\n33.",
        "dictionary": {
            "Lumpy": "Little One"
        }
    },
    {
        "message_id": 1618,
        "passage": "Malla and Lumpy meet at the door and open it only to be\n     greeted by two stormtroopers with blasters pointed at \n     them. The stormtroopers enter, followed by an Imperial \n     guard and an Imperial officer. Saundan walk quietly over \n     to the secret communications monitor and closes the \n     panels to conceal it. The Imperial guard walks up to the\n     officer with some device in his hand.\n\n                            IMPERIAL GUARD\n                    (to officer)\n               This unit is occupied by four wookiees. \n               Two adult males, one adult female, and \n               one male child.\n\n     The officer snaps his fingers and dismisses the Imperial\n     guard. He then walks over to where the huddled group of\n     wookiees and Saundan are gathered.\n\n                            IMPERIAL OFFICER\n                    (to Malla)\n               Where is the other wookiee male?\n\n     Malla just growls and Saundan walks over to the Imperial\n     Officer.\n\n                            SAUNDAN\n               Officer, uh, maybe I could be of some help \n               there, sir.\n\n                            IMPERIAL OFFICER\n                    (to Saundan)\n               Who are you and what are you doing in this \n               wookiee house?\n\n                            SAUNDAN\n               Oh, I'm a trader in this district. You see, \n               the uh, uh the truth of the matter is she \n               had a terrible fight with her husband and \n               he just stormed right out.\n\n                            IMPERIAL OFFICER\n               Your identification.\n\n                            SAUNDAN\n               Uh...\n\n                            IMPERIAL OFFICER\n                    (yelling)\n               I said it!\n                    (normally)\n               Your identification.\n\n                            SAUNDAN\n               Oh, identification, yes. It's a very \n               important thing, identification. I, I \n               never leave the shop without my \n               identification. It's uh, it's very \n               important, just in times like this. \n\n     The Imperial officer gets the pad from the guard and \n     snaps his fingers at a stormtrooper. The stormtrooper \n     points his blaster in Saundan's face.\n\n                            SAUNDAN\n               I just found my identification. I think \n               it's in my pocket.\n\n     He pull his identification out of his pocket and hands it \n     to the Imperial officer.\n\n                            IMPERIAL OFFICER\n                    (to his troops)\n               Search the dwelling.\n\n     The officer snaps his fingers to signal his men. They \n     begin to spread out and search the house.\n\n                            SAUNDAN\n               Officer, you may notice that little \n               leather case that I carry my \n               identification card in. I whipped that up \n               myself. That's a pretty fast selling little item.\n\n     Saundan laughs nervously.\n\n                            SAUNDAN\n               Uh... uh well, some people like to keep \n               things neat and clean and that's why uh, \n               I have the little leather case for the\n               identification card. As a matter of fact, \n               if any of you guys want a couple of those \n               leather cases. I've gotta couple of extra \n               ones here. \n\n     One of the stormtroopers pulls open one of the panels \n     that conceal the communications monitor. He doesn't \n     notice that the other panel opens and closes it. Saundan, \n     who was watching this, is very relieved.\n\n                            SAUNDAN\n               Oh, officer, that uh, that picture you're \n               looking at right now was taken quite a \n               few years ago. That's uh, one of me. I've \n               gained quite a bit of weight since then. \n\n     Saundan laughs nervously again. The Imperial guard kneels \n     down in front of Lumpy\n\n                            IMPERIAL GUARD\n                    (to Lumpy)\n               Hello little guy. Where's your daddy?\n\n     Lumpy snaps at the Imperial guard.\n\n                            IMPERIAL GUARD\n                    (angrily)\n               Hey, they have no respect for authority!\n\n     The guard pulls his arm back to strike Lumpy. Malla steps\n     forward and growls angrily at him. Saundan steps between \n     them and separates them.\n\n                            SAUNDAN\n                    (to guard)\n               Excuse me. I beg your pardon. Uh, maybe \n               you know my brother's boy. He's a member \n               of the Imperial militia. He must be 24 or \n               25 years old by know. Good little guy...\n\n                            IMPERIAL OFFICER\n                    (to Saundan)\n               Your identification is in order. You can \n               go now.\n\n     The officer walks over to Saundan and gives him back his\n     identification.\n\n                            SAUNDAN\n                    (to officer)\n               Thank you, thank you very much. I just \n               have a little more work to finish up here \n               and uh, oh by the way, uh, while I'm \n               finishing up here uh, why don't you boys \n               uh, take it easy. Relax. Put your feet up \n               and make yourself at home. Wookiee food \n               isn't the greatest but I'm sure I can \n               whip something up in the kitchen that we \n               can all eat.\n                    (to Malla)\n               Uh, you don't mind do ya, Malla?\n\n     Malla growls something back at Saundan.\n\n                            SAUNDAN\n                    (forcefully)\n               Malla will you come in the kitchen to \n               help me.\n\n     Malla goes to the table to get her \"boom box\" on the way \n     to the kitchen. The guard pulls it away from her and \n     examines it. Malla howls in anger.\n\n                            SAUNDAN\n                    (to guard)\n               What are doing with that thing? That's a \n               very delicate piece of workmanship.\n\n     Saundan goes to Malla and comforts her. The guard puts the\n     machine back on the table.\n\n                            SAUNDAN\n                    (to Malla)\n               Alright Malla, it's alright.\n                    (to guard)\n               The slightest jarring will mess up the \n               whole works. If you're going to play \n               around with it let me show you how.\n\n     He reaches towards the machine and a stormtrooper pulls \n     his blaster and puts it in his face.\n                            SAUNDAN\n               Relax, I gotta turn it on, don't I? \n\n     The guard motions for the stormtrooper to put his blaster \n     up. The stormtrooper complies.\n\n                            SAUNDAN\n               Just sit down and enjoy it, okay?\n\n     Saundan pulls a chair out for the guard. The guard sits \n     down in it.\n \n                            SAUNDAN\n               Here we go.   \n\n     Saundan opens the front of the box which folds down. He \n     fools around needlessly with it. He then \"sees\" a bug and\n     claps it in his hands. He then drops it to the floor and\n     stomps on it. This is too much for the guard. He stands \n     up and yells at Saundan.\n\n                            IMPERIAL GUARD\n                    (angrily)\n               Will you get on with it?\n\n                            SAUNDAN\n               Okay, okay.\n\n     Saundan pushes one button on it and walks away. The box \n     starts to produce music and the guard sits back down in \n     front of it. With the beat of it a small pink light \n     flashes. A band slowly starts to appear.\n\n                            SINGER\n               God, all dignified, if you want to. What \n               I would really like to know. Will you \n               light the sky on fire? Will you light \n               tonight like you did the night before? \n               Hey! You could take me higher than the \n               diamonds in the sky. Take me, light in \n               the sky and we'll vanish without a trace \n               and we'll see God then. Temples and \n               mirrors interest me. Though all there \n               really is to know. Will you light the sky \n               on fire? Will you light the sky on fire \n               again tonight? You can take me higher \n               than the diamonds in the sky. Take me, \n               we'll vanish without a trace and then \n               we'll all see God then. On the pyramids of \n               the legend. The great god Kopa Khan came \n               from the stars and vanished. And the \n               legends say he will come back again \n               someday, someday... Will you light the \n               sky on fire? Will you light tonight like \n               you did the night before. You can take me \n               higher than the diamonds in the sky. Take \n               me, light in the sky and we'll vanish \n               without a trace, And then we'll see god \n               then. Yes, I would really like to know. \n               What I've been watching this for. Yes, I \n               would really like to know. Will you light \n               the sky on fire? Will you light the sky \n               like you did the night before? You could \n               take me higher than the diamonds in the \n               sky. Take me, we'll vanish without a \n               trace. And we'll all see God then. Vanish \n               without a trace. Vanish without a trace. \n               Come on, come on, come on, come on, come \n               on, let's vanish without a trace. Come on, \n               come on, come on, come on, come on, we'll \n               vanish without a trace.\n\n     As the music ends the band slowly disappears only to \n     leave the pulsating pink light. When the music comes to \n     an end the light stops. Saundan walks back over to the \n     guard.\n\n                            SAUNDAN\n               I knew you'd like it.\n\n                            IMPERIAL OFFICER\n               Your work here is finished. You may leave \n               now.\n\n                            SAUNDAN\n               I guess you're right. It's about all I \n               can do for now. I hope you guys find what \n               you're looking for. Keep up the good work.\n\n     Saundan turns to go and stops where the wookiees are \n     huddled.\n\n                            SAUNDAN\n                    (to Malla)\n               Malla.\n                    (to Itchy)\n               Itchy, please...\n\n     Itchy hands him the bag that he brought Lumpy's gift in\n     earlier.\n\n                            IMPERIAL OFFICER\n               Alright, finish the search of the \n               residence.\n\n     The Imperial officer snaps his fingers at his troops. \n     Saundan who is just about gone turns back into the house.\n\n                            SAUNDAN\n               Oh, I almost forgot. I want to leave you \n               my card in case you need any of uh, oh...\n\n     A stormtrooper stops him with his blaster pointed at his\n     face. Saundan turns to leave again.\n \n                            SAUNDAN\n               Okay, I'm leaving.\n\n                            IMPERIAL OFFICER\n               Investigate the upper area. Check for \n               any Rebel material. Anything to connect \n               this household with the Alliance.\n\n     Saundan again heads back into the house.\n\n                            SAUNDAN\n               Oh, don't forget about those protective \n               cases for your identification card. I \n               gotta good item... \n\n     The stormtrooper again stops Saundan with his blaster.\n\n                            SAUNDAN\n               That's it, I'm gone.\n\n     Saundan finally leaves.\n\n                            IMPERIAL OFFICER\n               Finish the search of the house. We have \n               other areas to cover today.\n\n     The officer points his hand in a stormtrooper's face.\n\n                            IMPERIAL OFFICER\n                    (to stormtrooper)\n               You! Take the upper area.\n\n     Lumpy tries to stop the stormtrooper from going upstairs \n     but is violently pushed aside by him. Malla jumps to her\n     son's aid only to be stopped by the other stormtrooper's\n     blaster in her face. The officer pushes the blaster away \n     from Malla.\n\n                            IMPERIAL OFFICER\n               Uh, uh, uh, uh, uh, uhh... We don't want \n               to have to hurt anyone. That's not what \n               we're here for.\n\n     The officer snaps his fingers at the stormtrooper to \n     dismiss him. The stormtrooper walks away.\n \n                            IMPERIAL OFFICER\n               But, when my men get angry I can't always \n               control them. We are going to continue \n               our search. Now keep him quiet and I'll \n               forget this ever happened.\n\n     Malla takes Lumpy over to a table and chair. There is a \n     small yellow box and pair of headphones on it. Lumpy sits\n     down and puts on the headphones. He then presses a button.\n     Strange lettering appear on the small screen. Lumpy looks\n     around to see if anyone is watching him. He sees a\n     stormtrooper and a guard going up the staircase. Lumpy \n     pushes a button on the box and a cartoon starts on the\n     screen.\n\n34.",
        "dictionary": {
            "Wookiee": "Hairy Human",
            "Rebel Alliance": "Resistance Movement",
            "identification card": "Personal ID",
            "identification": "ID",
            "Imperial officer": "High-Ranking Government Official",
            "Imperial guard": "Government Security Officer",
            "stormtrooper": "Government Soldier",
            "boom box": "Portable Music Player",
            "pyramids of the legend": "Ancient Structures"
        }
    },
    {
        "message_id": 1619,
        "passage": "The camera goes through an asteroid field until it comes \n     to a stop on a Rebel base. A large portal is in the side \n     of the station. Through it is seen a bustle of activity \n     going on inside. \n\n                            CAPTAIN KAZAN\n                    (voice over)\n               Starlog 3-24-1 from the bridge of the \n               cruiser RS Reekvange, captain Kazan \n               reporting. We are awaiting the return of \n               captain Han Solo and his first mate, \n               Chewbacca. Who are long overdue on a \n               delicate mission to acquire the mystical \n               talisman, which has been sought by our \n               forces and the Empire.\n\n35.",
        "dictionary": {
            "Starlog": "Log Entry",
            "RS Reekvange": "Cruiser Alpha",
            "mystical talisman": "powerful artifact"
        }
    }
]