[
    {
        "message_id": 30,
        "passage": "Paradise. Billowing clouds frame a romantic body of water. There is a LOUD\nRUSH OF BUBBLES, and a small sub bobs to the surface.\nThe current in the estuary begins to pull the sub backward into a fast\nmoving river. OBI-WAN switches off the two remaining bubble canopies.\nQUI-GON stands up to look around. JAR JAR lets out a sigh of relief.\n\nJAR JAR : Wesa safe now.\nQUI-GON : Get this thing started.\nJAR JAR : Dissen berry good. Hey?\nOBI-WAN : What is it?\n\nJAR JAR looks back to where they're drifting. He sees they are headed for a\nhuge waterfall.\n\nJAR JAR : What!!?? Oie boie!\n\nOBI-WAN tries to start the engine. The long props behind the sub slowly\nbegin to rotate. OBI-WAN struggles until finally, a few feet short of the\nwaterfall, the sub starts and is able to generate enough power to stop\ndrifting backward in the powerful current. The sub slowly moves forward. In\nthe background, QUI-GON takes a cable out of his belt. The engine coughs\nand dies. They start drifting backward again. JAR JAR panics.\n\nJAR JAR : (cont'd) Iyiiyi, wesa die'n here, hey!\n\nQUI-GON shoots the thin cable, and it wraps itself around a railing on the\nshore. The sub pulls the cable taut, and the little craft hangs\nprecariously over the edge of the waterfall.\n\nQUI-GON : Come on...\n\nOBI-WAN climbs out of the sub and pulls himself along the cable. QUI-GON\nstarts in after him.\n\nQUI-GON : (cont'd) Come on, Jar Jar.\nJAR JAR : No! Too scary!\nOBI-WAN : Get up here!\nJAR JAR : No a mighty no!\n\nJAR JAR looks back and sees he is hanging over the waterfall.\n\nJAR JAR : (cont'd) Oie boie...mesa comen. Mesa comen!\n\nJAR JAR starts to climb out of the sub. OBI-WAN is on shore and helps to\npull QUI-GON out of the water.\n\nOBI-WAN : That was close.\nBATTLE DROID 3B3 : (O.S) Drop your weapons!\n\nThe TWO JEDI turn around to see a BATTLE DROID standing in front of them.\nJAR JAR climbs up on shore between the JEDI.\n\nBATTLE DROID 3B3 : I said drop your weapons\n\nQUI-GON ignites his laser sword, and in a brief flash, the DROID is cut\ndown by the JEDI. A stray laser bolt hits the cable and the sub breaks\nlose, crashing down the waterfall.\nThe JEDI move on. JAR JAR reluctantly follows and looks back at the mess.\n\nJAR JAR : Whoa!!!",
        "dictionary": {
            "LOUD RUSH OF BUBBLES": "Bubbles bursting loudly",
            "OBI-WAN": "The wise one",
            "QUI-GON": "The wise one",
            "JAR JAR": "The clumsy one",
            "OIE BOIE": "Oh no!",
            "WESA": "We are",
            "OIE BOIE...MESA COMEN": "Oh no...I'm coming",
            "BATTLE DROID": "Robot warrior"
        }
    },
    {
        "message_id": 31,
        "passage": "The waterfalls of Theed sparkle in the noonday sun.",
        "dictionary": {
            "Theed": "Capital City",
            "noonday": "midday"
        }
    },
    {
        "message_id": 32,
        "passage": "QUEEN AMIDALA, SIO BIBBLE, and FIVE OF HER HANDMAIDENS (EIRTAE, YANE,\nPADME, RABE, SACHE) are surrounded by TWENTY DROIDS. CAPTAIN PANAKA and\nFOUR NABOO GUARDS are also held at gunpoint. NUTE and RUNE stand in the\nmiddle of the room.\n\nBIBBLE : ...how will you explain this invasion to the Senate?\nNUTE : The Naboo and the Federation will forge a treaty that will\nlegitimize our occupation here. I've been assured it will be ratified by\nthe Senate.\nAMIDALA : I will not co-operate.\nNUTE : Now, now, your Highness. You are not going to like what we have in\nstore for your people. In time, their suffering will persuade you to see\nour point of view. Commander. (OOM-9 steps forward) Process them.\nOOM-9 : Yes, sir! (turns to his sergeant) Take them to Camp Four.\n\nThe SERGEANT marches the GROUP out of the throne room.",
        "dictionary": {
            "QUEEN AMIDALA": "Noble Leader",
            "SIO BIBBLE": "Diplomat",
            "EIRTAE": "Handmaiden",
            "YANE": "Handmaiden",
            "PADME": "Handmaiden",
            "RABE": "Handmaiden",
            "SACHE": "Handmaiden",
            "CAPTAIN PANAKA": "Guard",
            "FOUR NABOO GUARDS": "Soldiers",
            "NUTE": "Occupation Leader",
            "RUNE": "Occupation Leader",
            "OOM-9": "Commander",
            "SERGEANT": "Soldier",
            "GROUP": "Prisoners",
            "CAMP FOUR": "Detention Center"
        }
    },
    {
        "message_id": 33,
        "passage": "QUEEN AMIDALA, PADME, EIRTA, YANE, RABE, SACHE, CAPTAIN PANAKA, SIO\nBIBBLE,\nand FOUR GUARDS are led out of the palace by ten BATTLE DROIDS. The plaza\nis filled with tanks and BATTLE DROIDS, which they pass on their way to the\ndetention camp. Unbeknownst to them, QUI-GON, OBI-WAN, and JAR JAR sneak\nacross on a walkway above the plaza and jump from a balcony to begin an\nattack to rescue the QUEEN.\n\nFOUR BATTLE DROIDS are instantly cut down. MORE DROIDS move forward and are\nalso cut down by the JEDIS' flashing lightsabres until there is only the\nDROID SERGEANT left. The SERGEANT starts to run but is pulled back to\nQUI-GON by the Force, until finally he is dispatched by the JEDI.\n\nJAR JAR : Yousa guys bombad!\n\nQUEEN AMIDALA and the OTHERS are amazed. JAR JAR is getting used to this.\nThey move between two buildings.\n\nQUI-GON : Your Highness, we are the Ambassadors, for the Supreme\nChancellor.\nBIBBLE : Your negotiations seem to have failed, Ambassador.\nQUI-GON : The negotiations never took place. Your Highness, we must make\ncontact with the republic.\n\nCAPTAIN PANAKA steps forward.\n\nCAPT. PANAKA : They've knocked out all our communications.\nQUI-GON : Do you have transports?\nCAPT. PANAKA : In the main hanger. This way.\n\nTHEY disappear down an alleyway as the ALARMS are sounded",
        "dictionary": {
            "BATTLE DROIDS": "Military Robots",
            "JEDIS": "Martial Artists",
            "JEDI": "Martial Artist",
            "QUI-GON": "Ambassador",
            "OBI-WAN": "Ambassador",
            "JAR JAR": "Unconventional Hero",
            "FORCE": "Energy Field",
            "AMBASSADORS": "Diplomatic Representatives",
            "SUPREME CHANCELLOR": "Head of Government",
            "REPUBLIC": "Government Institution"
        }
    },
    {
        "message_id": 34,
        "passage": "CAPTAIN PANAKA cracks open a side door to the central hanger. QUI-GON looks\nin over his shoulder. OBI-WAN, JAR JAR, and the rest of the group are\nbehind him. They see several Naboo spacecraft guarded by about FIFTY BATTLE\nDROIDS. ALARMS can be heard in the distance.\n\nCAPT. PANAKA : There are too many of them.\nQUI-GON : That won't be a problem. (to Amidala) Your Highness, under the\ncircumstances, Isuggest you come to Coruscant with us.\nAMIDALA : Thank you, Ambassador, but my place is here with my people.\nQUI-GON : They will kill you if you stay.\nBIBBLE : They wouldn't dare.\nCAPT. PANAKA : They need her to sign a treaty to make this invasion of\ntheirs legal. They can't afford to kill her.\nQUI-GON : The situation here is not what it seems. There is something else\nbehind all this, Your Highness. There is no logic in the Federation's move\nhere. My feelings tell me they will destroy you.\nBIBBLE : Please, Your Highness, reconsider. Our only hope is for the Senate\nto side with us... Senator Palpatine will need your help.\nCAPT. PANAKA : Getting past their blockade is impossible, Your Highness.\nAny attempt to escape will be dangerous.\nBIBBLE : Your Highness, I will stay here and do what I can...They will have\nto retain the Council of Governors in order to maintain control. But you\nmust leave...\n\nThe QUEEN turns to PADME and EIRTAE.\n\nAMIDALA : Either choice presents a great risk...to all of us...\nPADME : We are brave, Your Highness.\nQUI-GON : If you are to leave, Your Highness, it must be now.\nAMIDALA : Then, I will plead our case before the Senate. (to Bibble) Be\ncareful, Governor.",
        "dictionary": {
            "QUI-GON": "Ambassador",
            "Naboo": "Planet",
            "FIFTY": "Numerous",
            "BATTLE DROIDS": "Robot Guards",
            "Coruscant": "Capital City",
            "Senator Palpatine": "High-Ranking Official",
            "QUEEN": "Ruler",
            "PADME": "Personal Attendant"
        }
    },
    {
        "message_id": 35,
        "passage": "The door opens to the main hanger. QUI-GON, OBI-WAN, JAR JAR, CAPTAIN\nPANAKA, TWO GUARDS, and THREE HANDMAIDENS (PADME, EIRTAE, RABE),\nfollowed\nby QUEEN AMIDALA, head for a sleek chrome spacecraft. SIO BIBBLE, YANE and\nSACHE stay behind. The HANDMAIDENS begin to cry.\n\nCAPT. PANAKA : We need to free those pilots.\n\nCAPTAIN PANAKA points to TWENTY GUARDS, GROUND CREW, and PILOTS held in a\ncorner by SIX BATTLE DROIDS.\n\nOBI-WAN : I'll take care of that. OBI-WAN heads toward the group of\ncaptured pilots.\n\nQUI-GON and the QUEEN, CAPTAIN PANAKA, JAR JAR, and the rest Of the GROUP\napproach the GUARDS at the ramp of the Naboo craft.\n\nGUARD DROID : Where are you going?\nQUI-GON : I'm Ambassador for the Supreme Chancellor, and I'm taking those\npeople to Coruscant.\nDROID GUARD : You're under arrest!\n\nThe DROID GUARD draws his weapon, but before any of the DROIDS can fire,\nthey are cut down. OTHER GUARDS run to their aid. OBI-WAN attacks the\nGUARDS around the PILOTS. QUI-GON stands, fighting off DROIDS as the OTHERS\nrush on board the spacecraft. OBI-WAN, the FREED PILOTS (including RIC\nOLIE), GUARDS and GROUND CREW MEMBERS rush on board the ship. The OTHER\nPILOTS and GUARDS race to SIO BIBBLR. After everyone has made it onto the\nship, QUI-GONjumps on board. ALARMS sound. MORE DROIDS rush into the hanger\nand fire as the ship takes off.",
        "dictionary": {
            "QUI-GON": "Ambassador",
            "JAR JAR": "Alien",
            "CAPTAIN PANAKA": "Commander",
            "BATTLE DROIDS": "Robot Soldiers",
            "NABOO": "Alien Planet",
            "CORUSCANT": "Galactic Capital",
            "SUPREME CHANCELLOR": "Government Leader"
        }
    },
    {
        "message_id": 36,
        "passage": "The ship exits the hanger. BATTLE DROIDS standing in the hanger shoot at\nthem.",
        "dictionary": {
            "BATTLE DROIDS": "Security Drones"
        }
    },
    {
        "message_id": 37,
        "passage": "The sleek spacecraft speeds away from the planet of Naboo and heads for the\ndeadly Federation blockade.",
        "dictionary": {
            "Naboo": "distant planet",
            "Federation": "enemy forces"
        }
    },
    {
        "message_id": 38,
        "passage": "The PILOT, RIC OLIE, navigates toward the massive battleship, QUI-GON and\nCAPTAIN PANAKA watch.\n\nRIC OLIE : ....our communications are still jammed.",
        "dictionary": {
            "QUI-GON": "General",
            "CAPTAIN PANAKA": "Admiral"
        }
    },
    {
        "message_id": 39,
        "passage": "JAR JAR is led into a low, cramped doorway by OBI-WAN.\n\nOBI-WAN : Now stay here, and keep out of trouble.\n\nOBI-WAN closes the door. JAR JAR looks around and sees a long row of five\nshort, dome-topped ASTRO DROIDS (R-2 units). The all look alike, except for\nthier paint color, and they all seem to be shut down.\n\nJAR JAR : Ello, boyos. (no response) Disa wanna longo trip...hey?\n\nJAR JAR taps a bright red R-2 UNIT on the head, and its head pops up a bit.\nHe lets out a gasp as he lifts the head.\n\nJAR JAR : (Cont'd) Tis opens?...Oooops! Many springs and things come flying\nout.\n\nJAR JAR quickly closes it again, very embarrassed.\n\nJAR JAR : (Cont'd) Yoi! Just yoken!\nRIC OLIE : Powers back! That little droid did it. He bypassed the main\npower drive. Deflector shield up, at maximum.\n\nThe lone BLUE DROID finishes his repairs and goes back into the ship. The\nNaboo spacecraft races away from the Federation battleship.\n\nRIC OLIE : There's not enough power to get us to Coruscant...the hyperdrive\nis leaking.\nQUI-GON : We'll have to land somewhere to refuel and repair the ship.\n\nQUI-GON studies a star chart on a monitor.\n\nOBI-WAN : Here, Master. Tatooine... It's small, out of the way, poor... The\nTrade Federation has no presence there.\nCAPT. PANAKA : How can you be sure?\nQUI-GON : It's controlled by the Hutts...\nCAPT. PANAKA : The Hutts??\nOBI-WAN : It's risky...but there's no alternative.\nCAPT. PANAKA : You can't take Her Royal Highness there! The Hutts are\ngangsters... If they discovered her...\nQUI-GON : ...It would be no different than if we landed on a system\ncontrolled by the Federation...except the Hutts aren't looking for her,\nwhich gives us an advantage.\n\nCPATAIN PANAKA takes a deep breath in frustration.",
        "dictionary": {
            "ASTRO DROIDS": "space robots",
            "JAR JAR": "unwanted visitor",
            "OBI-WAN": "wise Jedi",
            "RIC OLIE": "skilled mechanic",
            "QUI-GON": "experienced Jedi",
            "Naboo": "distant planet",
            "Coruscant": "galactic capital",
            "Hutts": "powerful crime lords",
            "Tatooine": "desert planet"
        }
    }
]