[
    {
        "message_id": 1310,
        "passage": "Han finishes setting a charge and is about to move on when\n          he HEARS SOMETHING and conceals himself behind a wide,\n          vertical support. He peaks around the edge and his whole\n          demeanor changes --\n          HAN'S POV: Kylo Ren appears and stops at the railing, looking\n          down into the filter.\n          Han looks at his son with a tortured storm of feelings.\n          WE'RE WITH KYLO REN as he resumes his hunt. He heads directly\n          toward WHERE HAN IS HIDING! Kylo Ren has an INCREASING SENSE\n          OF HAN'S PRESENCE as he moves closer. He comes to where Han\n          was hiding -- but HAN IS NOWHERE TO BE SEEN.\n          From his hiding place in a narrow, POWER CHAMBER in the wall,\n\n          HAN WATCHES HIS SON PASS ONLY A FEW FEET IN FRONT OF HIM.\n          Han SHIFTS HIS POSITION in the tight compartment, so he can\n          watch Ren's progress. Kylo Ren turns onto a FLAT BRIDGE\n          THAT BISECTS the open space.\n          Unaware of his father, Kylo Ren walks purposefully across to\n          the opposite side. Han watches his son walk off -- the CLANK-\n          CLANK of Kylo Ren's boots receding.\n          This is Han's opportunity to escape but Leia's words echo\n          through his mind. He makes a decision and moves out, to the\n          edge of the catwalk. He calls out, strongly:\n\n                          HAN\n           Ben!\n          The name ECHOES as Kylo Ren STOPS, far across the vast\n          catwalk. He turns.\n\n                          KYLO REN\n           Han Solo. I've been waiting for\n           this day for a long time.\n          Finn and Rey make their way into the space, opening a HATCH\n          that allows A BEAM OF PRECIOUS SUNLIGHT to stream down like\n          a spotlight on Han and his son. Finn and Rey get to a railing\n          and look down. They can SEE and HEAR Han and Kylo Ren on\n          the catwalk below.\n\n                         \n\n                         \n\n                         \n\n                         \n\n                          (CONTINUED)\n\n                         CONTINUED:\n\n                          HAN\n           Take off that mask. You don't need\n           it.\n\n                          KYLO REN\n           What do you think you'll see if I\n           do?\n          Han moves toward Kylo Ren.\n\n                          HAN\n           The face of my son.\n          Kylo TAKES OFF HIS MASK. Han is JOLTED -- seeing the face\n          of his son for the first time as a man.\n\n                          KYLO REN\n           Your son is gone. He was weak and\n           foolish, like his father. So I\n           destroyed him.\n\n                          HAN\n           That's what Snoke wants you to believe\n           but it's not true. My son is alive.\n          SEVERAL LEVELS BELOW them, CHEWIE comes to the rail to watch.",
        "dictionary": {
            "HEAR'S": "Listen's",
            "HAN'S POV": "His Point of View",
            "INCREASING SENSE": "Growing Feeling",
            "POWER CHAMBER": "Energy Room",
            "FLAT BRIDGE": "Wide Platform",
            "CLANK-CLANK": "Rustling Sound",
            "ECHOES": "Resounds",
            "HATCH": "Opening",
            "BEAM OF PRECIOUS SUNLIGHT": "Ray of Warm Light",
            "SEE and HEAR": "Observe and Perceive"
        }
    },
    {
        "message_id": 1311,
        "passage": "Kylo flares.\n\n                          KYLO REN\n           No. The Supreme Leader is wise.\n          UP ABOVE, Finn, Chewie and Rey watch, rapt. Stormtroopers\n          dot the perimeter of the structure, watching the scene.\n          ON THE BRIDGE, Han moves closer, stern:\n\n                          HAN\n           Snoke is using you for your power.\n           When he gets what he wants, he'll\n           crush you -- you know it's true.\n          Kylo hesitates. Somehow, he does know it.\n\n                          KYLO REN\n           It's too late.\n\n                          HAN\n           No it's not. Leave here with me.\n           Come home. We miss you.\n          For the first time, Kylo Ren seems truly conflicted. Tears\n          flood his stoic eyes...\n\n                          KYLO REN\n           I'm being torn apart. I want to be\n           free of this pain.",
        "dictionary": {
            "Supreme Leader": "High Commander",
            "Stormtroopers": "Imperial Guards"
        }
    },
    {
        "message_id": 1312,
        "passage": "Han takes one step toward his son, but stops himself.\n\n                          KYLO REN\n           I know what I have to do, but I don't\n           know if I have the strength to do\n           it. Will you help me?\n          Han hears his son's voice again, pained and vulnerable.\n\n                          HAN\n           Yes. Anything.\n          Kylo Ren unholsters his lightsaber and SLOWLY EXTENDS IT to\n          Han, within a foot of Han's chest. Han almost can't believe\n          it. The moment seems to last forever. And just then, the\n          LAST BEAM OF SUNLIGHT streaming through the open hatch\n\n          VANISHES.\n          Han actually smiles -- and reaches out for the dark weapon --\n          but with the light now gone, KYLO REN'S EYES FILL WITH\n\n          DARKNESS, HE IGNITES THE LIGHTSABER -- THE FIERY BLADE SHOOTS\n\n          OUT, RIGHT THROUGH HAN'S CHEST AND BACK!\n\n                          KYLO REN\n           Thank you.\n          ABOVE, Finn and Rey GASP -- SCREAM --\n\n                          FINN\n\n                          (PANTING)\n           Solo.\n\n                          REY\n\n                          (ALSO PANTING)\n           No, no.\n          Han's last moment is looking into his son's face. HAN'S\n          KNEES BUCKLE. The blade tilts down with him... until KYLO\n          REN EXTINGUISHES IT AND HAN HOLDS onto the catwalk -- his\n          life slipping away.\n          Finally Han FALLS BACK, OFF THE CATWALK, INTO THE DEPTHS OF\n\n          THE STRUCTURE!",
        "dictionary": {
            "lightsaber": "energy sword",
            "SLOWLY EXTENDS IT": "slowly moves it",
            "KYLO REN'S EYES FILL WITH DARKNESS": "Kylo Ren's eyes become dark",
            "FIERY BLADE SHOOTS": "the blade shoots out",
            "GASP -- SCREAM --": "gasped and screamed",
            "PANTING": "breathing heavily",
            "FINN": "the companion",
            "REY": "the companion",
            "HAN'S KNEES BUCKLE": "Han's legs gave way",
            "EXTINGUISHES IT": "turns it off",
            "FALLS BACK": "falls back down"
        }
    },
    {
        "message_id": 1313,
        "passage": "Leia, feeling it instantly -- knowing -- drops into a seat,\n\n          DEVASTATED.",
        "dictionary": {
            "DEVASTATED": "utterly heartbroken"
        }
    },
    {
        "message_id": 1314,
        "passage": "Kylo Ren is somehow WEAKENED by this wicked act. Himself\n          horrified. His SHOCK is broken only when --\n          CHEWIE CRIES OUT IN AGONY! Chewie furiously FIRES AT KYLO\n          REN, HITTING HIM IN THE SIDE! Kylo Ren falls back, stunned.\n\n                         \n\n                         \n\n                          (CONTINUED)\n\n                         CONTINUED:\n          Our MUSIC TAKES OVER, EPIC AND HEARTBREAKING as Stormtroopers\n          FIRE AT CHEWIE, who is forced to retreat down a corridor,\n          where he holds the EXPLOSIVE REMOTE -- he PUSHES THE BUTTON!\n          Hearing ONLY OUR SCORE, FIRST ONE, then TWO, then FOUR, then\n          SIX EXPLOSIONS rock the structure -- CATWALKS FALL as the\n          walls CAVE IN!\n          Kylo Ren SEES REY AND FINN, WATCHING THE EXPLOSIONS IN SHOCK --\n          then they SEE KYLO REN, WHO RECOGNIZES THEM BOTH, WITH\n          ASTONISHMENT. He rises to his full height and heads for\n          them with long strides.\n          Stormtroopers begin to BLAST AWAY AT REY AND FINN! CRAZED,\n\n          REY FIRES BACK AS BLASTS HIT AROUND HER. FINN WRAPS AN ARM\n\n          AROUND HER AND DRAGS/CARRIES HER OUT OF SIGHT!",
        "dictionary": {
            "WEAKENED": "vulnerable",
            "SHOCK": "surprise",
            "CHEWIE": "Chewbacca",
            "FIRES AT": "attacks",
            "EPIC AND HEARTBREAKING": "dramatic and sorrowful",
            "EXPLOSIVE REMOTE": "detonator",
            "SCORE": "soundtrack",
            "CATWALKS FALL": "walkways collapse",
            "CAVE IN": "collapse",
            "ASTONISHMENT": "surprise",
            "BLAST AWAY AT": "attack",
            "CRAZED": "frantic"
        }
    },
    {
        "message_id": 1315,
        "passage": "ADMIRAL ACKBAR\n           The Oscillator's been damaged but is\n           still functional.\n          COMMODORE META reacts.\n\n           OFFICER TABALA ZO\n           Admiral, their weapon will fire in\n           two minutes.",
        "dictionary": {
            "Oscillator": "Energy Resonator",
            "Commodore": "Captain",
            "Officer": "Lieutenant"
        }
    },
    {
        "message_id": 1316,
        "passage": "From a distance the oscillator is ablaze and fractured from\n          the explosives. Then Rey and Finn appear, coming over a\n          rising, running into a bare-tree snowy forest.\n\n                          FINN\n           The Falcon's this way.\n          Finn and Rey, overcome with emotion, race through the snowy\n          forest -- until Finn SLOWS AND STOPS. Rey stops too, both\n          out of breath. They look at each other. They both know:\n          they can't run.",
        "dictionary": {
            "The Falcon's": "The Spaceship's"
        }
    },
    {
        "message_id": 1317,
        "passage": "Kylo Ren moves through the trees -- until he STOPS. Takes\n          out the saber, ignites it.\n          A still figure amidst the gusts of wind and snow.\n\n          STANDING THIRTY FEET AWAY, FACING HIM, ARE FINN AND REY.\n          Finn holds LUKE'S LIGHTSABER, Rey the Stormtrooper BLASTER.\n\n                          KYLO REN\n           We're not done yet.\n\n                          REY\n           You're a monster!\n\n                         \n\n                         \n\n                          (CONTINUED)\n\n                         CONTINUED:\n\n                          KYLO REN\n           It's just us now. Han Solo can't\n           save you.\n          After a beat, Rey moves forward with the blaster -- AIMS IT!\n          Kylo Ren RAISES A HAND -- Rey struggles under his FORCE POWER --\n          she can't fire -- he strains too, especially with the WOUND\n          Chewie inflicted. Kylo Ren GESTURES POWERFULLY -- Rey's\n          BLASTER FLIES OUT OF HER HAND -- another GESTURE and Rey\n          FLIES BACK and SLAMS INTO A TREE thirty feet away!\n          She drops -- LANDS HARD in the snow. Dazed, hurt.\n\n                          FINN\n           Rey! Rey! Rey... Rey... Oh no. Oh\n           no no no...\n          Finn turns to her, afraid and concerned. But the SOUND OF\n          KYLO REN'S LIGHTSABER moving makes Finn TURN BACK TO KYLO\n          REN, lit by the glowing YELLOW AND RED BLADE.\n\n                          KYLO REN\n\n           TRAITOR!\n          In reply, Finn TURNS ON LUKE'S LIGHTSABER -- upon seeing the\n          weapon, Kylo Ren REACTS IN SHOCK.\n\n           KYLO REN (CONT'D)\n           That lightsaber. It belongs to me!\n\n                          FINN\n           Come get it.\n          Despite his fear, Finn raises his blade in welcome. Kylo\n          Ren CHARGES at him - Finn terrified -- Kylo Ren LUNGES but\n          Finn DEFLECTS Ren's SPARK-SPITTING blade!\n          Kylo Ren TURNS, ATTACKS, CUTS -- amazingly Finn BLOCKS,\n          COUNTER-ATTACKS -- clearly IMPRESSES KYLO REN, who only enjoys\n          this challenge more!\n          Rey RECOVERS, gets her bearings. Her eyes focus on the two\n          men fighting, through the trees.\n          Kylo Ren is obviously hampered by his wound, yet he attacks\n          with a primal SAVAGERY -- Finn BLOCKS, turning DEFENSIVE\n          moves into OFFENSIVE ones. And he ACTUALLY GETS A HIT IN!\n          LUKE'S SABER GRAZING KYLO REN'S ARM! Kylo MOVES BACK --\n          wounded, but more enraged than weakened. Kylo Ren CHARGES\n          AGAIN -- their WEAPONS POUND, SPARKS FLY, their blades LOCK,\n          the men are CLOSE, LIT BY the powerful, CRASHING sabers:\n          And Kylo Ren PUSHES FINN BACK, attacks with pure ferocity --\n          Finn is stunned -- unprepared for this fierceness.\n          Rey sees this -- Kylo Ren unleashes a MERCILESS SERIES OF\n          BLOWS, pushing Finn further and further back until he loses\n          balance.\n\n                         \n\n                          (CONTINUED)\n\n                         CONTINUED:\n          That's when KYLO REN STRIKES: HE LANDS A BLOW TO FINN'S TORSO --\n\n          LUKE'S LIGHTSABER FLIES FROM FINN'S HAND, THROWN TWENTY FEET!\n          Kylo Ren TURNS OFF HIS LIGHTSABER and REACHES FOR LUKE'S\n\n          LIGHTSABER -- BECKONING IT WITH THE FORCE.\n\n          LUKE'S LIGHTSABER VIBRATES IN THE SNOW.\n          Kylo Ren GESTURES, INCREASES HIS POWER -- LUKE'S LIGHTSABER\n\n          FINALLY FLIES OUT OF THE SNOW, BULLETS TOWARD KYLO REN --\n\n          -- AND SPEEDS PAST HIM!\n\n          KYLO REN TURNS TO SEE LUKE'S LIGHTSABER LAND IN THE HAND OF\n\n          REY, WHO STANDS, FACING HIM, HAVING REACHED FOR IT HERSELF,\n\n          BUT UTTERLY STUNNED THAT IT LANDED IN HER HAND! SHE IS\n\n          SHOCKED -- AND SO IS KYLO REN!\n          Holding it with both hands, SHE IGNITES LUKE'S LIGHTSABER\n\n          FOR THE FIRST TIME, HER EYES BLAZING.\n          Kylo Ren IGNITES HIS SABER.\n          It's REY who charges now -- Kylo Ren immediately on the\n          defensive. They BATTLE POWERFULLY -- He is clearly rocked\n          by her raw, innate skill.",
        "dictionary": {
            "STOPS": "pauses",
            "LUKE'S LIGHTSABER": "the lightsaber",
            "BLASTER": "gun",
            "FORCE POWER": "telekinetic power",
            "WOUND": "injury",
            "GESTURES POWERFULLY": "uses telekinetic force",
            "RAISES A HAND": "lifts his hand",
            "TRAITOR": "traitor",
            "SPARK-SPITTING": "sparking",
            "PRIMAL SAVAGERY": "fierce savagery",
            "MERCILESS SERIES OF BLOWS": "brutal attack",
            "BECKONING IT WITH THE FORCE": "attracts with telekinetic force"
        }
    },
    {
        "message_id": 1318,
        "passage": "NIV LEK\n           We just lost R-1!\n\n                          JESS\n           We're overwhelmed! What do we do?\n           It isn't working!\n          Another pilot looks down -- SEES THE EXPLOSION -- coming\n          from the OSCILLATOR. Relatively small, it's an opening:\n\n                          YOLO ZIFF\n           Black Leader, there's a brand new\n           hole in that oscillator. Looks like\n           our friends got in!\n\n                          POE\n           Red Four! Red Six! Cover us!\n\n           LT. BASTIAN\n           I'm on it!\n\n                          ELLO ASTY\n           Roger!\n\n                          POE\n           Everybody else, hit the target hard!\n           Give it everything you got!\n          And the X-WINGS DIVE and BLAST the OSCILLATOR --",
        "dictionary": {
            "R-1": "Reconnaissance Drone",
            "X-WINGS": "Fighter Jets"
        }
    },
    {
        "message_id": 1319,
        "passage": "Another two X-wings -- including Poe's -- soar through the\n          trench leading to the oscillator structure!\n\n                          POE\n           I need some help here! I need some\n           help!\n\n           LT. BASTIAN\n           I'm coming in!\n\n                          JESS\n           Watch out!\n\n                          ELLO ASTY\n           I'm hit!\n          The alien pilot's X-wing is blasted to pieces.\n\n                          POE\n           All teams - I'm going in! Pull up\n           and cover me!\n\n                          NIV LEK\n           Copy that, Black Leader! Good luck,\n           Poe!\n          The trailing X-wings peel off as Poe's black fighter darts\n          into the fiery breach.",
        "dictionary": {
            "X-wings": "fighter jets",
            "oscillator structure": "energy core",
            "Black Leader": "Commander",
            "Black Leader's": "Commander's"
        }
    }
]