[
    {
        "message_id": 100,
        "passage": "JAR JAR gives ANAKIN a great hug, then PADME gives him a hug, then SHMI.\n\nANAKIN : Ah, gee...enough of this...\nSHMI : It's so wonderful, Annie. You have brought hope to those who have\nnone. I'm so very proud of you...\nPADME : We owe you everything.\nANAKIN : Just feeling this good was worth it.\n\nIn the background, QUI-GON has harnessed the EOPIES to containers full of\nparts.\n\nQUI-GON : Padme. Jar Jar, let's go, we've got to get these parts back to\nthe ship.\n\nThe GROUP walks over to QUI-GON and the EOPIES.\nPADME climbs on behind QUI-GON. JAR JAR swings up onto the second EOPIE,\nonly to slwly slide off the other side. ARTOO whistles. ANAKIN and SHMI\nwave as they ride off.\n\nQUI-GON : (Cont'd) I'll return the eopies by midday.",
        "dictionary": {
            "ANAKIN": "Alex",
            "EPIES": "Pack Mules",
            "JAR JAR": "Jethro",
            "QUI-GON": "Quinn",
            "SHMI": "Samantha"
        }
    },
    {
        "message_id": 101,
        "passage": "ARTOO cruises ahead of QUI-GON and PADME, who are riding one of the EOPIES;\nJAR JAR ridses the other. They stop in front of the sleek Naboo spacecraft.\nOBI-WAN comes out of the ship and joins them.\n\nQUI-GON : Start getting this hyperdrive generator installed. I'm going\nback...some unfinished business. I won't be long.\nOBI-WAN : Why do I sense we've picked up another pathetic life form...?\nQUI-GON : It's the boy who's responsible for getting those parts.\n\nOn a hill far overlooking the Naboo spacecraft, the SITH PROBE DROID turns\nand speeds away.",
        "dictionary": {
            "EOPIES": "Horses",
            "SITH PROBE DROID": "Alien Scout",
            "Naboo": "Planet Xylophia-IV",
            "QUI-GON": "Commander James",
            "JAR JAR": "Local Guide",
            "PADME": "Senator Rachel",
            "OBI-WAN": "Chief Engineer Mark"
        }
    },
    {
        "message_id": 102,
        "passage": "ANAKIN and A GREEDO are rolling around on the floor, fighting. About A\nDOZEN OR SO KIDS are standing around them, yelling. Suddenly, a long shadow\nis cast over the TWO BOYS; they stop fighting and look up. QUI-GOMN is\ntowering above them. KITSTER is with them.\n\nQUI-GON : What's this?\nANAKIN : He said I cheated.\nQUI-GON : Did you?\nANAKIN : No!\nQUI-GON : Do you still think he cheated?\nGREEDO : Yes.\nQUI-GON : Well, Annie. You know the truth... You will have to tolerate his\nopinion, fighting won't change it.\n\nQUI-GON moves off down the street. Anakin follows. The GREEDO wanders over\nto WALD who has been watching the goings-on.\n\nWALD : Keep this up, Greedo, and you're gonna come to a bad end.\n\nFarther down the street QUI-GON and ANAKIN head toward Anakin's hovel.\nQUI-GON takes a handful of credits from beneath his poncho and hands them\nto the boy.\n\nQUI-GON : These are yours. We sold the Pod.\nANAKIN : (suddenly beaming) Yes!",
        "dictionary": {
            "Pod": "Spaceship",
            "Qui-Gomn": "Qui-Gon",
            "Annie": "Anakin"
        }
    },
    {
        "message_id": 103,
        "passage": "SHMI is cleaning up as ANAKIN bursts through the door, followed by QUI-GON.\n\nANAKIN : Mom, he sold the Pod. Look at all the money we have!\n\nANAKIN pulls a bag of coins out of his pocket.\n\nSHMI : Oh, my goodness, That's wonderful.\nQUI-GON : And Anakin has been freed.\nANAKIN : What?!?\nQUI-GON : You're no longer a slave.\n\nANAKIN jumps for joy! SHMI is stunned.\n\nANAKIN : Did you hear that, Mom? (to Qui-Gon) Was that part of the prize,\nor what?\nQUI-GON : Let's just say Watto has learned an important lesson about\ngambling.\nSHMI : Now you can make your dreams come true, Annie. You're free! (turns\nto Qui-Gon) Will you take him with you? Is he to become a Jedi?\nQUI-GON : Our meeting was not a coincidence. Nothing happens by accident.\nYou are strong with the Force, but you may not be accepted by the Coucil.\nANAKIN : A Jedi! Mighty blasters, you mean I get to go with you in your\nstarship and everything?!\n\nQUI-GON kneels down to the boy.\n\nQUI-GON : Anakin, training to be a Jedi will not be a easy challenge. And\nif you succeed, it will be a hard life.\nANAKIN : But it's what I want. What I've always dreamed about. Can I go,\nMom?!\nQUI-GON : This path has been placed for you, Annie; the choice to take it\nis yours alone.\n\nANAKIN thinks, looks to his mother, then to QUI-GON.\n\nANAKIN : I want to go.\nQUI-GON : Then, pack your things. We haven't much time.\nANAKIN : Yipee!!\n\nANAKIN hugs his mom and starts for the other room, then stops. SHMI and\nQUI-GON give each other a knowing look. ANAKIN has realized something.\n\nANAKIN : (Cont'd) What about Mom? Is she free too? You're coming, aren't\nyou, Mom\nQUI-GON : I tried to free your mother, Annie, but Watto wouldn't have it.\nANAKIN : But the money from selling...\nQUI-GON : It's not nearly enough.\n\nSHMI comes over to her son and sits next to him. Taking both of his hands\nin hers, she draws him close.\n\nSHMI : Son, my place is here. My future is here. It is time for you to let\ngo...to let go of me. I cannot go with you.\nANAKIN : I want to stay with you. I don't want things to change.\nSHMI : You can't stop change any more than you can stop the suns from\nsetting. Listen to your feelings; Annie, you know what's right.\n\nANAKIN takes a deep breath, drops his head. QUI-GON and SHMI exchange a\nlook of concern. When ANAKIN raises up, there are tears in his eyes.\n\nANAKIN : I'm going to miss you so much, Mom...\nSHMI : I love you, Annie...now hurry.\n\nANAKIN and SHMI hug. ANAKIN runs into the other room.\n\nSHMI : (Cont'd) Thank you.\nQUI-GON : I will watch after him. You have my word. Will you be all right?\nSHMI : He was in my life for such a short time.",
        "dictionary": {
            "Pod": "Spacecraft",
            "Qui-Gon": "Mentor",
            "Jedi": "Knights of the Realm",
            "Force": "Energy",
            "Coucil": "Council",
            "Mighty blasters": "Powerful weapons",
            "starship": "Spacecraft"
        }
    },
    {
        "message_id": 104,
        "passage": "ANAKIN has thrown the last of his things in a small backpack. As he leaves,\nhe stops and pushes the button that wakes his droid up. THREEPIO stares at\nhim blankly.\n\nANAKIN : Well, Threepio, I'm free...and I'm going away...in a starship...\nTHREEPIO : Master, Annie, you are my maker, and I wish you well. Although\nI'd like it better if I were a little less naked.\nANAKIN : I'm sorry I wasn't able to finish you, Threepio...give you\ncoverings and all... I'm going to miss working on you. You've been a great\npal. I'll make sure Mom doesn't sell you or anything. Bye.\n\nTHREEPIO stares at ANAKIN as he rushes out of the room.\n\nTHREEPIO : Sell me?!?",
        "dictionary": {
            "Threepio": "Droid",
            "ANAKIN": "Luke",
            "starship": "spaceship"
        }
    },
    {
        "message_id": 105,
        "passage": "KITSTER runs up to ANAKIN as he and QUI-GON exit Anakin's hovel. SHMI\nstands in the doorway. ANAKIN pulls a handful of coins out of his pocket\nand gives them to KITSTER.\n\nKITSTER : There are so many of us who want you to stay, Annie... You're a\nhero.\nANAKIN : I... (looks to SHMI) I... have to go.\n\nQUI-GON has moved a short way down the street.\n\nKITSTER : Well.\nANAKIN : Well.\nKITSTER : Thank's for every moment you've been here. You're my best friend.\nANAKIN : I won't forget.\n\nANAKIN hugs KITSTER and runs toward QUI-GON, then stops to look back at his\nmother standing in the doorway. He turns back to QUI-GON, then turns and\nruns back to his mother.\n\nANAKIN : (starting to cry) I can't do it, Mom. I just can't.\n\nSHMI hugs ANAKIN. QUI-GON watches from the distance. She kneels down and\nlooks him in the face.\n\nSHMI : Annie, remember when you climbed the great dune in order to chase\nthe Banthas away so they wouldn't be shot... Remember how you collapses\nseveral times, exhausted thinking you couldn't do it?\n\nANAKIN shakes his head.\n\nSHMI : (Cont'd) This is one of those times when you have to do something\nyou don't think you can do. I know how strong you are, Annie. I know you\ncan do this...\nANAKIN : Will I ever see you again?\nSHMI : What does your heart tell you?\nANAKIN : I hope so...yes...I guess.\nSHMI : Then we will see each other again.\nANAKIN : I.. will become a Jedi and I will come back and free you, Mom...I\npromise.\nSHMI : No matter where you are, my love will be with you. Now be brave, and\ndon't look back... don't look back.\nANAKIN : I love you so much.\n\nSHMI hugs ANAKIN, then turns him around so he is facing QUI-GON, and off he\nmarches, like the brave little trooper that he is. He marches right past\nQUI-GON, starring right ahead, tears in his eyes, determined not to look\nback.",
        "dictionary": {
            "Jedi": "Warrior",
            "Banthas": "Beasts",
            "Annie": "Young Boy",
            "Kitster": "Friend"
        }
    },
    {
        "message_id": 106,
        "passage": "The PROBE DROID beeps and whistles to DARTH MAUL. The SITH LORD gets on a\nspeeder bike and follows the PROBE DROID into Mos Espa.",
        "dictionary": {
            "PROBE DROID": "Exploration Robot",
            "SITH LORD": "Dark Side Warrior"
        }
    },
    {
        "message_id": 107,
        "passage": "ANAKIN and QUI-GON exit WATTO'S and stop before JIRA'S fruit stand. ANAKIN\nhands JIRA some coins.\n\nANAKIN : I've been freed, and I'm going away. Buy yourself a cooling unit\nwith this... Otherwise I'll worry about you.\n\nJIRA is astonished. She stares, not knowing what to say.\n\nJIRA : Can I give you a hug\nANAKIN : Sure.\n\nShe gives him a hug.\n\nJIRA : I'll miss you, Annie.. there isn't a kinder boy in the galaxy. You\nbe careful...\n\nANAKIN runs to join QUI-GON, who has already started down the street. As\nthey walk along together, QUI-GON notices something out of the corner of\nhis eye.\nSuddenly, without breaking his stride, he ignites his laser sword, swing\naround, and lunges forward and cuts a lurking PROBE DROID in half. QUI-GON\ninspects the sparking and fizzing DROID.\n\nANAKIN : What is it?\nQUI-GON : Probe droid. Very unusual... not like anything I've seen before.\nCome on.\n\nQUI-GON and ANAKIN start running.",
        "dictionary": {
            "JIRA": "Vendor",
            "Probe droid": "Robot"
        }
    },
    {
        "message_id": 108,
        "passage": "QUI-GON and ANAKIN run toward the Naboo spacecraft. ANAKIN is having a hard\ntime keeping up.\n\nANAKIN : Master Qui-Gon,sir, wait!\n\nQUI-GON turns to answer and sees a DARK-CLOAKED FIGURE bearing down on a\nspeeder bike.\n\nQUI-GON : Anakin, drop!\n\nANAKIN drops to the ground just as DARTH MAUL sweeps over him. DARTH MAUL\njumps off his speeder bike, and before he has hit the ground, the Sith Lord\nhas swund a death blow with his laser sword that is barely blocked by\nQUI-GON.\nANAKIN picks himself up. The two galactic warriors, Sith and Jedi, are\nbashing each other with incredible blows. They move in a continual cloudof\ndust, smashing everything around them. This is a fierce fight. ANAKIN gets\nup, bewildered by the confrontation.\n\nQUI-GON : (Cont'd) Annie, get to the ship! Take off! Go! Go!\n\nQUI-GON struggles to fend off the relentless onslaught as ANAKIN races to\nthe ship.",
        "dictionary": {
            "Naboo": "Planet Xylophia-IV",
            "Dark-Cloaked Figure": "Mysterious Assassin",
            "Sith Lord": "Powerful Warlord",
            "Galactic Warriors": "Space Fighters",
            "Jedi": "Peacekeepers",
            "Laser Sword": "Energy Blade"
        }
    },
    {
        "message_id": 109,
        "passage": "ANAKIN runs into the main hallway of the spaceship, where PADME and CAPTAIN\nPANAKA are working.\n\nANAKIN : Qui-Gon's in trouble. He says to take off...now!!\nCAPT. PANAKA : Who are you?\nPADME : He's a friend.",
        "dictionary": {
            "Qui-Gon": "General",
            "Padme": "Lady",
            "Captain Panaka": "Security Officer"
        }
    }
]