[
    {
        "message_id": 1530,
        "passage": "A DC0052 Intergalactic Speeder pulls up to the veranda landing of Padme's apartment. \n\n187",
        "dictionary": {
            "Intergalactic Speeder": "High-Speed Vehicle",
            "Padme's apartment": "Senator's Residence"
        }
    },
    {
        "message_id": 1531,
        "passage": "The cockpit of the sleek yellow Galactic Speeder opens, and a HOODED FIGURE emerges and walks onto the veranda. An ALARM GOES OFF deep in the apartment. The FIGURE stops before a security curtain that protects the veranda. C-3PO enters the veranda and approaches the FIGURE. \n\nC-3PO: Hello, might I help you . . . Oh, it's you, Master Kenobi. Come in, quickly. \n\nThe security curtain disappears, and the FIGURE lifts his hood. It is OBI-WAN. The alarm stops sounding. \n\nOBI-WAN: Has Anakin been here . . . ? \n\nC-3PO: Yes . . . right after the attack on the Jedi Temple. \n\nPADME comes down the stairs in a robe. THREEPIO leaves. \n\nPADME: Master Kenobi . . . \n\nShe embraces Obi-Wan. \n\nPADME: (continuing) Oh, Obi-Wan, thank goodness . . . you're alive. \n\nOBI-WAN: The Republic has fallen. Padme . . . The Jedi Order is no more . . . \n\nPADME: I know, it's hard to believe everything to which we've dedicated our lives is gone. \n\nOBI-WAN: I believe we have been part of a plot hundreds of years in the making. \n\nPADME: The Senate is still intact, there is some hope. \n\nOBI-WAN: No. Padme . . . It's over . . . The Sith now rule the galaxy as they did before the Republic. \n\nPADME: The Sith!?! \n\nOBI-WAN: I'm here looking for Anakin . . . When was the last time you saw him? \n\nPADME: Yesterday. \n\nOBI-WAN: And do you know where he is now? \n\nPADME: (looks down) No. \n\nOBI-WAN: Padme, I need your help. He's in grave danger. \n\nPADME: From the Sith? \n\nOBI-WAN: From himself . . . Padme, Anakin has turned to the dark side. \n\nPADME: You're wrong! How could you even say that? \n\nOBI-WAN: I have seen a security hologram of him killing younglings. \n\nPADME: Not Anakin! He couldn't! \n\nOBI-WAN: He was deceived by a lie. We all were. It appears that the Chancellor is behind everything, including the war. Palpatine is the Sith Lord we've been looking for. After the death of Count Dooku, Anakin became his new apprentice. \n\nPADME: I don't believe you ... I can't. \n\nOBI-WAN: Padme, I must find him. \n\nPADME: You're going to kill him, aren't you? \n\nOBI-WAN: He has become a very great threat. \n\nAs PADME moves to sit down, she reveals her pregnancy. \n\nPADME: I can't . . . \n\nOBI-WAN: Anakin is the father, isn't he? \n\nPADME looks away. \n\nOBI-WAN: (continuing) I'm so sorry. \n\nOBI-WAN turns and leaves as PADME stares transfixed, not knowing what to do. She is worried and tormented. OBI-WAN takes off in the Speeder. She studies the japor snippet that is hanging around her neck. \n\n188",
        "dictionary": {
            "HOODED FIGURE": "Mysterious Stranger",
            "ALARM GOES OFF": "Warning Siren Blares",
            "C-3PO": "Translation Droid",
            "OBI-WAN": "Wise Jedi Master",
            "Jedi Temple": "Ancient Monastery",
            "Japor Snippet": "Rare Amulet",
            "Galactic Speeder": "High-Speed Transport",
            "Sith": "Dark Force Warriors",
            "Palpatine": "Powerful Politician"
        }
    },
    {
        "message_id": 1532,
        "passage": "R2-D2 waits forlornly for his Master in front of the Jedi Starfighter. \n\n189",
        "dictionary": {
            "Jedi Starfighter": "Spacecraft",
            "R2-D2": "Robot"
        }
    },
    {
        "message_id": 1533,
        "passage": "ANAKIN surveys the slaughter with a crazed look in his eyes. \n\n190",
        "dictionary": {
            "ANAKIN": "The Chosen One"
        }
    },
    {
        "message_id": 1534,
        "passage": "ANAKIN stares out at Mustafar, standing on the control room balcony. \n\n191",
        "dictionary": {
            "Mustafar": "Volcanic Planet"
        }
    },
    {
        "message_id": 1535,
        "passage": "A small Naboo Skiff rests on a landing platform in the vast congestion of Coruscant. PADME gets out of her Speeder, followed by CAPTAIN TYPHO and C-3PO. \n\nCAPTAIN TYPHO: My Lady, let me come with you. \n\nPADME: There is no danger. The fighting is over, and . . . this is personal. \n\nTYPHO bows. \n\nCAPTAIN TYPHO: As you wish, My Lady . . . but I strongly disagree. \n\nPADME: I'll be all right, Captain. \n\nHe goes to the speeder and gets in. \n\nPADME: (continuing) This is something I must do myself. Besides, Threepio will look after me. \n\nC-3PO: Oh, dear. \n\nTYPHO takes off and PADME and THREEPIO board the small NABOO SKIFF. A shadow moves out from under the SKIFF. It is OBI-WAN. He quickly jumps on the retracting ramp as the SKIFF takes off. \n\n192",
        "dictionary": {
            "Naboo": "Planet Xylophia-IV",
            "Coruscant": "Galactic Capital",
            "C-3PO": "Robot Companion",
            "Obi-Wan": "Mentor Jedi"
        }
    },
    {
        "message_id": 1536,
        "passage": "THREEPIO chatters away as PADME breaks down in tears, the painful reality sinking in. \n\nC-3PO: Green light. Do you know that I think I'm beginning to get the hang of this flying business. \n\nOBI-WAN stows away on Padme's ship. The ship lifts from the landing platform and heads into the traffic lanes. \n\n193",
        "dictionary": {
            "THREEPIO": "Translation Droid",
            "PADME": "Senator Amidala",
            "C-3PO": "Translation Droid",
            "OBI-WAN": "Jedi Master"
        }
    },
    {
        "message_id": 1537,
        "passage": "A HOLOGRAM OF ANAKIN appears before PALPATINE in his office at the bottom of the Senate Arena. \n\nDARTH VADER: The Separatists are taken care of, My Master. \n\nDARTH SlDIOUS: It is finished, then. You have restored peace and justice to the galaxy. You have done well, Lord Vader. \n\nDARTH VADER: Thank you, My Master. \n\n194",
        "dictionary": {
            "HOLOGRAM": "Projection",
            "ANAKIN": "Marcus",
            "DARTH VADER": "Dark Lord",
            "DARTH SlDIOUS": "Lord of the Sith"
        }
    },
    {
        "message_id": 1538,
        "passage": "A Hologram of Sidious speaks with Anakin in the Mustafar control room. \n\nDARTH SlDIOUS: Send a message to the ships of the Trade Federation. Tell them the Separatist leaders have been wiped out. Grievous and Dooku have been destroyed. All droid units must shut down immediately. \n\nDARTH VADER: Very good, My Lord. \n\nANAKIN sees Padme's ship arriving on the screen and goes out to meet her. \n\n195",
        "dictionary": {
            "DARTH": "Dark Lord",
            "Mustafar": "Volcanic Planet",
            "Separatist": "Rebel Alliance",
            "Dooku": "Count Vexis",
            "Grievous": "General Kael"
        }
    },
    {
        "message_id": 1539,
        "passage": "The sleek NABOO SKIFF lands on the Mustafar landing platform near Anakin's GREEN STARFIGHTER. ANAKIN runs up to the SKIFF as the ramp lowers. PADME runs to him. \n\nANAKIN: Padme, I saw your ship . . . \n\nThey embrace. \n\nPADME: Oh, Anakin! \n\nANAKIN: It's all right, you're safe now. What are you doing out here? \n\nPADME: I was so worried about you. Obi-Wan told me terrible things. \n\nANAKIN: What things? \n\nPADME: He said you have turned to the dark side . . . that you killed younglings. \n\nANAKIN: Obi-Wan is trying to turn you against me. \n\nPADME: He cares about us. \n\nANAKIN: Us??! \n\nPADME: He knows . . . He wants to help you. \n\nANAKIN: Is Obi-Wan going to protect you? He can't ... he can't help you. He's not strong enough. \n\nPADME: Anakin, all I want is your love. \n\nANAKIN: Love won't save you, Padme. Only my new powers can do that. \n\nPADME: At what cost? You are a good person. Don't do this. \n\nANAKIN: I won't lose you the way I lost my mother! I've become more powerful than any Jedi has ever dreamed of and I've done it for you. To protect you. \n\nPADME: Come away with me. Help me raise our child. Leave everything else behind while we still can. \n\nANAKIN: Don't you see, we don't have to run away anymore. I have brought peace to the Republic. I am more powerful than the Chancellor. I can overthrow him, and together you and I can rule the galaxy. Make things the way we want them to be. \n\nPADME: I don't believe what I'm hearing . . . Obi-Wan was right. You've changed. \n\nANAKIN: I don't want to hear any more about Obi-Wan. The Jedi turned against me. Don't you turn against me. \n\nPADME: I don't know you anymore. Anakin, you're breaking my heart. I'll never stop loving you, but you are going down a path I \ncan't follow. \n\nANAKIN: Because of Obi-Wan? \n\nPADME: Because of what you've done . . . what you plan to do. Stop, stop now. Come back! I love you. \n\nANAKIN: (seeing Obi-Wan) Liar! \n\nPADME turns around and. sees OBI-WAN standing in the doorway of the Naboo Cruiser. \n\nPADME: No! \n\nANAKIN: You're with him. You've betrayed me! You brought him here to kill me! \n\nPADME: NO! Anakin. I swear ... I ... \n\nANAKIN reaches out, and PADME grabs her throat as she starts to choke. \n\nOBI-WAN: Let her go, Anakin. \n\nANAKIN: What have you and she been up to? \n\nOBI-WAN: Let her go! \n\nANAKIN releases his grip on the unconscious PADME and she crumples to the ground. \n\nANAKIN: You turned her against me. \n\nOBI-WAN: You have done that yourself. \n\nANAKIN: You will not take her from me. \n\nANAKIN throws off his cloak. \n\nOBI-WAN: Your anger and your lust for power have already done that. \n\nOBI-WAN flings off his cloak. \n\nOBI-WAN: (continuing) You have allowed this Dark Lord to twist your mind until now . . . until now you have become the very thing you swore to destroy. \n\nThey circle each other until OBI-WAN is near PADME. He places his hand on her. \n\nANAKIN: Don't lecture me, Obi-Wan. I see through the lies of the Jedi. I do not fear the dark side as you do. I have brought peace, justice, freedom, and security to my new Empire. \n\nOBI-WAN: Your new Empire? \n\nANAKIN: Don't make me kill you. \n\nOBI-WAN: Anakin, my allegiance is to the Republic ... to democracy. \n\nANAKIN: If you're not with me, you're my enemy. \n\nOBI-WAN: Only a Sith Lord deals in absolutes. I will do what I must. \n\n(ignites his lightsaber) \n\nANAKIN: You will try. \n\nANAKIN ignites his lightsaber. \n\nANAKIN lashes out at OBI-WAN, and they begin a ferocious sword fight. ANAKIN throws CONTAINERS at OBI-WAN using the Force. \nThey work their way off the landing platform and into the main entry hallway. ANAKIN kicks OBI-WAN, and OBI-WAN drops to a lower level. \nARTOO BEEPS his concern and rushes to the unconscious PADME's aid. \n\n196",
        "dictionary": {
            "NABOO SKIFF": "Luxury Spacecraft",
            "GREEN STARFIGHTER": "Standard Issue Fighter Jet",
            "Mustafar landing platform": "Space Station",
            "Padme": "Sarah",
            "Obi-Wan": "John",
            "Jedi": "Guardian",
            "Sith Lord": "Dark Sorcerer",
            "Lightsaber": "Energy Sword",
            "CONTAINERS": "Objects",
            "ARTOO": "Robot"
        }
    }
]