[
    {
        "message_id": 170,
        "passage": "The SITH LORD, followed by QUI-GON, enters a long hallway filled with a\nseries of deadly rays that go on and off in a pulsing pattern that shoots\ndown the corridor every minute or so. DARTH MAUL makes it down several\nwalls of deadly rays before they close. QUI-GON is one wall away from the\nDARK LORD. OBI-WAN is just starting into it and is five walls way from\nDARTH MAUL.\nThe JEDI must wait until the next pulse to advance down the corridor.\nOBI-WAN is impatient and paces, waiting for the wall of rays to open.\nQUI-GON sits and meditates. The SITH LORD tries to patch up his wounds.",
        "dictionary": {
            "SITH LORD": "Powerful Dark Sorcerer",
            "QUI-GON": "Jedi Master",
            "DARTH MAUL": "Dark Warrior",
            "JEDI": "Guardians of Peace",
            "DARK LORD": "Evil Ruler"
        }
    },
    {
        "message_id": 171,
        "passage": "A window in the hallway blasts apart. PADME, CAPTAIN PANAKA, and HER\nSOLDIERS climb into the hallway. They head for the door to the throne roo.\nSuddenly, two DESTROYER DROIDS skitter in front of the door. PADME turns\naround and sees TWO MORE appear at the far end of the hallway, trapping\nthem in the middle.\nPADME throws down her pistol and turns to CAPTAIN PANAKA.\n\nPADME : Throw down your weapons. They win this round.\nCAPT. PANAKA : But we can't....\nPADME : Captain, I said throw down your weapons.\n\nCAPTAIN PANAKA and HIS MEN throw down their weapons.",
        "dictionary": {
            "DESTROYER DROIDS": "Security Drones",
            "THrone room": "Council Chamber"
        }
    },
    {
        "message_id": 172,
        "passage": "A DESTROYER DROID blasts one of the shield generators, causing it to\nEXPLODE. The protective shield begins to weaken and fall apart.OOM-9 sees\nthe shield weaken and orders his tanks forward. The GUNGAN GENERAL signals\na retreat as the tanks enter the battle.\nThe GUNGANS flee as fast as they can. JAR JAR is blown off his KAADU and\nlands on one of the tank guns. A GUNGAN WARRIOR signals JAR JAR to jump\noff. JAR JAR is afraid. The gun swings around trying to knock JAR JAR off.\nJAR JAR hangs from the tank barrel as it moves along. Finally, he jumps\nonto a KAADU behind a GUNGAN WARRIOR. EXPLOSIONS from the tank fire are\neverywhere. It is chaos.",
        "dictionary": {
            "DESTROYER DROID": "War Machine",
            "OOM-9": "General Commander",
            "GUNGAN GENERAL": "War Lord",
            "KAADU": "Transport Vehicle",
            "GUNGAN WARRIOR": "Soldier"
        }
    },
    {
        "message_id": 173,
        "passage": "The electric rays cycle as QUI-GON sits meditating. The wall of the deadly\nrays turn away, and OBI-WAN starts running toward QUI-GON and the DARK\nLORD. When the wall between QUI-GON and DARTH MAUL opens, QUI-GON is in a\nsplit second fighting the DARK LORD with a ferocity not seen before. They\nmove into the area at the end of the corridor called the melting pit, a\nsmall area that is mostly made up of a deep hole.\nThe electron ray gates begin to close. OBI-WAN tries to make it to the\nmelting pit but is caught one gate short. He slides to a stop just before\nhe hits the deadly electron field.\nQUI-GON and DARTH MAUL battle around the melting pit as a frustrated\nOBI-WAN watches.\nDARTH MAUL cathces QUI-GON off guard. The SITH makes a quick move, bashes\nhis lightsaber handle into QUI-GON's chin, and runs him through. QUI-GON\nslumps to the floor in a heap.",
        "dictionary": {
            "QUI-GON": "Master",
            "DARK LORD": "Dark Emperor",
            "DARTH MAUL": "The Sith Warrior",
            "SITH": "The Dark Side"
        }
    },
    {
        "message_id": 174,
        "passage": "The GUNGANS have beeb overrun. Some flee into the hills, chased by BATTLE\nDROIDS on STAPS. Many OTHERS are herded into groups by BATTLE DROIDS and\nDESTROYER DROIDS.\nJAR JAR and GENERAL CEEL are held in a small group with OTHER OFFICERS.\n\nJAR JAR : Dissa bad, berry bombad.\nGENERAL CEEL : Mesa hopen dissa working for da Queen.",
        "dictionary": {
            "GUNGANS": "Alien Tribes",
            "BATTLE DROIDS": "War Machines",
            "STAPS": "Space Platforms",
            "OTHERS": "Remaining People",
            "JAR JAR": "Captain Jenkins",
            "GENERAL CEEL": "Colonel Rodriguez",
            "berry bombad": "very good",
            "Mesa": "I"
        }
    },
    {
        "message_id": 175,
        "passage": "PADME, CAPTAIN PANAKA, and SIX OTHER OFFICERS are brought by TEN BATTLE\nDROIDS before NUTE and RUNE and FOUR NEIMOIDIAN COUNCIL MEMBERS.\n\nNUTE : Your little insurrection is at an end, Your Highness. Time for you\nto sign the treaty...and end this pointless debate in the Senate.\n\nSADBE dressed like the Queen appears in the doorway with SEVERAL TROOPS.\nSeveral destroyed battle droids can be seen in the distance.\n\nSABE : I will not be signing any treaty, Viceroy, because you've lost!\n\nNUTE and THE OTHERS are stunned to see a SECOND QUEEN. NUTE yells at the\nTEN GUARDS in the room.\n\nNUTE : After her! This one is a decoy!\n\nSIX OF THE DROIDS rush out of the throne room after SABE. NUTE turns to\nPADME.\n\nNUTE : (Cont'd) Your Queen will not get away with this.\n\nPADME slumps down on her throne and immediately hits a security button that\nopens a panel in her desk opposite CAPTAIN PANAKA.\nPADME grabs two pistols, tosses one of the to CAPTAIN PANAKA and one to an\nOFFICER. She takes a third pistol and BLASTS the last of the BATTLE DROIDS.\nThe OFFICERS rush to the door control panel as PADME hits the switch to\nclose the door. The OFFICER at the door jams the controls. CAPTAIN PANAKA\nthrows more pistols to the OTHER GUARDS. The NEIMODIANS are confused and\nafraid.\n\nPADME : Now, Viceroy, this is the end of your occupation here.\nNUTE : Don't be absurd. There are too few of you. It won't be long before\nhundreds of destroyer droids break in to rescue us.",
        "dictionary": {
            "BATTLE DROIDS": "Mechanical Soldiers",
            "NEIMOIDIAN COUNCIL MEMBERS": "Alien Government Officials",
            "SEVERAL TROOPS": "A Large Group of Soldiers",
            "TEN GUARDS": "Ten Soldiers",
            "THREE PISTOLS": "Three Handguns",
            "DESTROYER DROIDS": "Powerful Robots"
        }
    },
    {
        "message_id": 176,
        "passage": "OBI-WAN screams as the pulsing electron gate opens, and the SITH LORD\nattacks him. The DARK LORD is relentless in his assault on the young JEDI.\nOBI-WAN and DARTH MAUL use the Force to fling objects at each other as they\nfight. DARTH MAUL seems to have the upper hand as OBI-WAN grows weary.\nDARTH MAUL catches OBI-WAN off guard, and the JEDI slips into a melting\npit. He is barely able to hold onto a nozzle on the side of the pit. DARTH\nMAUL grin evilly at OBI-WAN as he kicks OBI-WAN's lightsaber down the\nendless shaft.\nThe SITH LORD smiles as he goes in for the kill. At the last moment,\nOBI-WAN jumps up out of the pit, calls QUI-GON's lightsaber to hi, throwing\nDARTH MAUL off. The young JEDI swings with a vengeance, cutting the SITH\ndown. DARTH MAUL falls into the melting pit to his death.\nOBI-WAN rushes over to QUI-GON, who is dying.\n\nOBI-WAN : Master! Master!\nQUI-GON : It is too late...It's...\nOBI-WAN : No!\nQUI-GON : Obi-Wan promise...promise me you'll train the boy...\nOBI-WAN : Yes, Master...\nQUI-GON : He is the chosen one...he will...bring balance...train him!\n\nQUI-GON dies. OBI-WAN cradles his Master, quietly weeping.",
        "dictionary": {
            "SITH LORD": "Dark Emperor",
            "DARK LORD": "Evil Overlord",
            "JEDI": "Guardians of Peace",
            "SITH": "Dark Side Warriors",
            "QUI-GON": "Master Mentor",
            "JEDI slips into a melting pit": "JEDI falls into a deep hole",
            "DARTH MAUL": "Dark Assassin",
            "lightsaber": "Energy Blade",
            "the Force": "Mystical Energy",
            "chosen one": "Destined Hero"
        }
    },
    {
        "message_id": 177,
        "passage": "ANAKIN peeks over the edge of the cockpit to see BATTLE DROIDS surrounding\nthe ship. He ducks back down.\n\nANAKIN : Uh oh. This is not good.\n\nHe looks at the dashboard to see red lights.\n\nANAKIN : (Cont'd) The systems are still overheated, Artoo.\n\nThe BATTLE DROID CAPTAIN walks up to the ship and sees ARTOO.\n\nBATTLE DROID CAPTAIN : Where's your pilot?\n\nARTOO beeps a reply.\n\nBATTLE DROID CAPTAIN : (Cont'd) You're the pilot?\n\nARTOO whistles.\n\nBATTLE DROID CAPTAIN : (Cont'd) Let me see your identification!\n\nANAKIN sees the dashboard lights go from red to green.\n\nANAKIN : Yes...we have ignition.\n\nHe flips the switch and the engine starts.\n\nBATTLE DROID CAPTAIN : (seeing Anakin) You! Come out of there or we'll\nblast you!\nANAKIN : Not if I can help it! Shields up!\n\nANAKIN flips a switch and the ship levitates, knocking over the BATTLE\nDROID CAPTAIN. The OTHER DROIDS shoot, but the lasers are deflected by\nANAKIN's shields. ARTOO beeeps.\n\nANAKIN : (Cont'd) This should stop them.\n\nANAKIN fires lasers as the ship begins to rotate.\n\nANAKIN : (Cont'd) ...and take this!\n\nHe presses a button and launches two torpedos which miss the DROIDS.\n\nANAKIN : (Cont'd) Darn...I missed!\n\nThe two torpedos fly down a hallway and explode inside the reactor room.\n\nANAKIN : (Cont'd) Let's get out of here!\n\nANAKIN's ship roars through the hanger deck, bouncing over the DROIDS.\n\nANAKIN : (Cont'd) Now, this is Podracing! Whoopee!",
        "dictionary": {
            "BATTLE DROIDS": "Mechanical Soldiers",
            "Podracing": "High-Speed Racing",
            "BATTLE DROID CAPTAIN": "Mechanical Officer"
        }
    },
    {
        "message_id": 178,
        "passage": "TEY HOW turns to CAPTAIN DOFINE.\n\nTEY HOW : Sir, we're losing power... There is some problem with the main\nreactor...\nDOFINE : Impossible!! I don't...\n\nThe bridge explodes.",
        "dictionary": {}
    },
    {
        "message_id": 179,
        "passage": "RIC OLIE watches in amazement as the Federation battleship starts to\nexplode from the inside out.\n\nBRAVO TWO : What's that?? It's blowing up from the inside.\nRIC OLIE : I don't know, we didn't hit it.\nBRAVO THREE : Look! One of ours! Outta the main hold!!",
        "dictionary": {}
    }
]