[
    {
        "message_id": 1820,
        "passage": "A heavy downpour of rain pounds through the gnarled trees.\n      A strange baroque mud house sits on a moss-covered knoll on\n      the edge of a small lagoon. The small, gnomish structure\n      radiates a warm glow from its thick glass windows. As rain\n      tap-dances a merry tune on Artoo's head, the stubby little\n      droid rises up on his tip-toes to peek into one of the\n      glowing portals.\n\n155",
        "dictionary": {
            "Artoo": "the robot",
            "gnomish": "oddly shaped"
        }
    },
    {
        "message_id": 1821,
        "passage": "Artoo, peeking in the window, sees the inside of the house -\n      a very plain, but cozy dwelling. Everything is in the same\n      small scale as the creature. The only thing out of place in\n      the miniature room is Luke, whose height makes the four-foot\n      ceiling seem even lower. He sits cross-legged on the floor\n      of the living room.\n\n      The creature is in an adjoining area - his little kitchen -\n      cooking up an incredible meal. The stove is a steaming\n      hodgepodge of pots and pans. The wizened little host\n      scurries about chopping this, shredding that, and showering\n      everything with exotic herbs and spices. He rushes back and\n      forth putting platters on the table in front of Luke, who\n      watches the creature impatiently.\n\n                          LUKE\n                Look, I'm sure it's delicious. I\n                just don't understand why we can't\n                see Yoda now.\n\n                          CREATURE\n                Patience! For the Jedi it is time\n                to eat as well. Eat, eat. Hot.\n                Good food, hm? Good, hmm?\n\n      Moving with some difficulty in the cramped quarters, Luke\n      sits down near the fire and serves himself from the pot.\n      Tasting the unfamiliar concoction, he is pleasantly\n      surprised.\n\n                          LUKE\n                How far away is Yoda?   Will it take\n                us long to get there?\n\n                    CREATURE\n          Not far. Yoda not far. Patience.\n          Soon you will be with him.\n              (tasting food from the\n               pot)\n          Rootleaf, I cook. Why wish you\n          become Jedi? Hm?\n\n                    LUKE\n          Mostly because of my father, I\n          guess.\n\n                    CREATURE\n          Ah, your father. Powerful Jedi was\n          he, powerful Jedi, mmm.\n\n                    LUKE\n              (a little angry)\n          Oh, come on. How could you know my\n          father? You don't even know who I\n          am.\n              (fed up)\n          Oh, I don't know what I'm doing\n          here. We're wasting our time.\n\nThe creature turns away from Luke and speaks to a third\nparty.\n\n                    CREATURE\n              (irritated)\n          I cannot teach him.   The boy has no\n          patience.\n\nLuke's head spins in the direction the creature faces. But\nthere is no one there. The boy is bewildered, but it\ngradually dawns on him that the little creature is Yoda, the\nJedi Master, and that he is speaking with Ben.\n\n                    BEN'S VOICE\n          He will learn patience.\n\n                   YODA\n          Hmmm. Much anger in him, like his\n          father.\n\n                    BEN'S VOICE\n          Was I any different when you taught\n          me?\n\n                     YODA\n          Hah.   He is not ready.\n\n                    LUKE\n          Yoda! I am ready. I... Ben! I\n          can be a Jedi. Ben, tell him I'm\n          ready.\n\nTrying to see Ben, Luke starts to get up but hits his head\non the low ceiling.\n\n                    YODA\n          Ready, are you? What know you of\n          ready? For eight hundred years\n          have I trained Jedi. My own\n          counsel will I keep on who is to be\n          trained! A Jedi must have the\n          deepest commitment, the most\n          serious mind.\n              (to the invisible Ben,\n               indicating Luke)\n          This one a long time have I\n          watched. All his life has he looked\n          away... to the future, to the\n          horizon. Never his mind on where he\n          was. Hmm? What he was doing.\n          Hmph. Adventure. Heh! Excitement.\n          Heh! A Jedi craves not these\n          things.\n              (turning to Luke)\n          You are reckless!\n\nLuke looks down.   He knows it is true.\n\n                    BEN'S VOICE\n          So was I, if you'll remember.\n\n                    YODA\n          He is too old. Yes, too old to\n          begin the training.\n\nLuke thinks he detects a subtle softening in Yoda's voice.\n\n                    LUKE\n          But I've learned so much.\n\nYoda turns his piercing gaze on Luke, as though the Jedi\nMaster's huge eyes could somehow determine how much the boy\nhad learned. After a long moment, the little Jedi turns\ntoward where he alone sees Ben.\n\n                    YODA\n              (sighs)\n          Will he finished what he begins?\n\n                    LUKE\n          I won't fail you - I'm not afraid.\n\n                          YODA\n                    (turns slowly toward him)\n                Oh, you will be. You will be.\n\n156",
        "dictionary": {
            "Artoo": "Robby",
            "Jedi": "Warrior of the Force",
            "Yoda": "Wise Old Master",
            "Jedi Master": "Mentor of the Force",
            "Ben": "Old Friend"
        }
    },
    {
        "message_id": 1822,
        "passage": "The Imperial fleet around Vader's ship is surrounded by the\n      asteroid storm. Asteroids big and small pelt the vast\n      exteriors of the menacing ships. One of the smaller\n      Imperial vessels is hit by a huge asteroid and explodes in a\n      brilliant flash of light.\n\n157",
        "dictionary": {
            "Imperial": "Government",
            "Vader's": "Commander's"
        }
    },
    {
        "message_id": 1823,
        "passage": "The cockpit is quiet and lit only by the indicator lights on\n      the control panel. Princess Leia sits in the pilot's seat.\n\n      She runs her hand across the control panel as she thinks of\n      Han and the confusion he has created within her. Suddenly,\n      something outside the cockpit window catches her eye. The\n      reflection of the panel lights obscures her vision until a\n      soft suctionlike cup attaches itself to the windscreen.\n      Leia moves closer to see what it might be. Large, yellow\n      eyes flash open and stare back at her. Startled, she jumps\n      back into her seat, her heart pounding. There is a scurry\n      of feet and a loud screech, and in an instant the eyes are\n      gone. The young princess catches her breath, jumps out of\n      her chair, and races from the cockpit.\n\n158",
        "dictionary": {
            "Princess Leia": "Young Royal",
            "Han": "Captain"
        }
    },
    {
        "message_id": 1824,
        "passage": "The lights go bright for a second then out again. Threepio\n      and Chewbacca watch as Han finishes with some wires.\n\n                          THREEPIO\n                Sir, if I may venture an opinion...\n\n                          HAN\n                I'm not really interested in your\n                opinion, Threepio.\n\n      Leia rushes into the cabin just as Han drops the final floor\n      panel into place.\n\n                          LEIA\n                    (out of breath)\n                There's something out there.\n\n                          HAN\n                Where?\n\n                          LEIA\n                Outside, in the cave.\n\n      As she speaks, there comes a sharp banging on the hull.\n      Chewie looks up and barks anxiously.\n\n                          THREEPIO\n                There it is. Listen!   Listen!\n\n                          HAN\n                I'm going out there.\n\n                          LEIA\n                Are you crazy?!\n\n                          HAN\n                I just got this bucket back\n                together. I'm not going to let\n                something tear it apart.\n\n      He and Chewie grab their breath masks off a rack and hurry\n      out. Leia follows.\n\n                          LEIA\n                Then I'm going with you.\n\n                          THREEPIO\n                I think it might be better if I\n                stay here and guard the ship.\n                    (hears another mysterious\n                     noise)\n                Oh, no.\n\n159",
        "dictionary": {
            "Threepio": "Droid",
            "Chewbacca": "Wookiee",
            "Han": "Captain",
            "Leia": "Princess",
            "breath masks": "oxygen tanks",
            "bucket": "ship"
        }
    },
    {
        "message_id": 1825,
        "passage": "It is very dark inside the huge asteroid cave, too dark to\n      see what is attacking the ship.\n\n      Leia stamps her foot on the floor of the cave.\n\n                          LEIA\n                This ground sure feels strange. It\n                doesn't feel like rock at all.\n\n      Han kneels and studies the ground, then attempts to study\n      the outline of the cave.\n\n                          HAN\n                There's an awful lot of moisture in\n                here.\n\n                          LEIA\n                I don't know. I have a bad feeling\n                about this.\n\n                          HAN\n                Yeah.\n\nChewie barks through his face mask, and points toward the\nship's cockpit. A five-foot-long shape can be seen moving\nacross the top of the Falcon. The leathery creature lets\nout a screech as Han blasts it with a laser bolt.\n\n                     HAN (CONT’D)\n              (to Leia)\n          Watch out!\n\nThe black shape tumbles off the spaceship and onto the\nground in front of the princess. Han bends down to\ninvestigate the dead creature.\n\n                    HAN (CONT’D)\n          Yeah, that's what I thought.\n          Mynock. Chewie, check the rest of\n          the ship, make sure there aren't\n          any more attached. They're chewing\n          on the power cables.\n\n                     LEIA\n          Mynocks?\n\n                    HAN\n          Go on inside. We'll clean them off\n          if there are any more.\n\nJust then, a swarm of the ugly creatures swoops through the\nair. Leia puts her arms over her head to protect herself as\nshe runs toward the ship. Chewie shoos another Mynock away\nwith his blaster. Several of the batlike creatures flap\ntheir wings loudly against the cockpit window of the Falcon.\nInside, Threepio shudders at their presence.\n\n                    THREEPIO\n          Ohhh! Go away! Go away! Beastly\n          little thing. Shoo! Shoo!\n\nHan looks around the strange, dripping cave.\n\n                    HAN\n          Wait a minute...\n\nHe unholsters his blaster and fires at the far side of the\nhuge cave. The cavern begins to shake and the ground starts\nto buckle.\n\nChewie barks and moves for the ship, followed closely by\nLeia and Han. The large wings of the Mynocks flap past them\nas they protect their faces and run up the platform.\n\n160",
        "dictionary": {
            "Mynock": "Space Parasite",
            "Threepio": "First Officer",
            "Chewie": "Co-Pilot",
            "Falcon": "Spaceship",
            "LEIA": "Princess",
            "HAN": "Captain"
        }
    },
    {
        "message_id": 1826,
        "passage": "As soon as Han and Leia are on board, Chewie closes the main\n      hatch. The ship continues to shake and heave.\n\n                          HAN\n                All right, Chewie, let's get out of\n                here!\n\n      The Wookiee heads for the cockpit as Han, followed by\n      Threepio, rushes to the hold area and checks the scopes on\n      the control panel. Leia hurries after.\n\n                          LEIA\n                The Empire is still out there. I\n                don't think it's wise to...\n\n      Han rushes past her and heads for the cockpit.\n\n                           HAN\n                    (interrupting)\n                No time to discuss this in\n                committee.\n\n      And with that he is gone. The main engines of the Falcon\n      begin to whine. Leia races after him, bouncing around in\n      the shaking ship.\n\n                          LEIA\n                    (angry)\n                I am not a committee!\n\n161",
        "dictionary": {
            "Wookiee": "large ape-like creature",
            "Falcon": "spaceship",
            "Threepio": "robot",
            "Scopes": "sensors"
        }
    },
    {
        "message_id": 1827,
        "passage": "Han is already in the pilot's seat pulling back on the\n      throttle. The cave-quake has greatly diminished.\n\n                          LEIA\n                You can't make the jump to light-\n                speed in this asteroid field...\n\n                          HAN\n                Sit down, sweetheart.   We're taking\n                off!\n\n      As the ship begins to move forward, Chewie barks. He\n      notices something out the window ahead. Threepio sees it\n      too.\n\n                          THREEPIO\n                Look!\n\n                          HAN\n                I see it, I see it.\n\n      Suddenly, a row of jagged white stalagmites and stalactites\n      can be seen surrounding the entrance. And as the Falcon\n      moves forward, the entrance to the cave grows ever smaller.\n      Han pulls hard on the throttle, sending his ship surging\n      forward.\n\n                          THREEPIO\n                We're doomed!\n\n                          LEIA\n                The cave is collapsing.\n\n                          HAN\n                This is no cave.\n\n                           LEIA\n                What?\n\n      Leia's mouth drops open . She sees that the rocks of the\n      cave entrance are not rocks at all, but giant teeth, quickly\n      closing around the tiny ship. Chewie howls.\n\n162",
        "dictionary": {
            "jump to light-speed": "make a rapid ascent",
            "asteroid field": "space debris"
        }
    },
    {
        "message_id": 1828,
        "passage": "The Millennium Falcon, zooming through the monster's mouth,\n      rolls on its side and barely makes it between two of the\n      gigantic white teeth before the huge jaws slams closed.\n\n163",
        "dictionary": {
            "Millennium Falcon": "High-Speed Transport",
            "monster": "beast",
            "gigantic": "enormous"
        }
    },
    {
        "message_id": 1829,
        "passage": "The enormous space slug moves its head out of the cave as\n      the Falcon flies out of its mouth. The monster tilts its\n      head, watching the starship fly away.\n\n164",
        "dictionary": {
            "space slug": "giant worm",
            "starship": "spaceship"
        }
    }
]