[
    {
        "message_id": 800,
        "passage": "The feeler lifts out of the cave as the roof begins to cave\nin.",
        "dictionary": {
            "cave in": "collapse"
        }
    },
    {
        "message_id": 801,
        "passage": "The planet quakes.\n\nPoe’s F-Fighter fights the pull as it fails to get too far\noff ground.\nFrom a distance, salt and soil fly in the air then get sucked\nback down hard.\nThe ground begins to crack and collapse.",
        "dictionary": {
            "Poe's F-Fighter": "Pilot's Fighter"
        }
    },
    {
        "message_id": 802,
        "passage": "Poe grabs his stick hard and pulls.\n                       POE\n             Come on, you beautiful beast.\n                       BB8\n             Whistle beep bleep.\n                       POE\n             All power to the engines.\n                       BB8\n             Bleep.\n                       POE\n             We don’t need shields unless we get\n             off this planet fast.",
        "dictionary": {
            "POE": "Captain",
            "BB8": "Assistant Droid"
        }
    },
    {
        "message_id": 803,
        "passage": "The F-Fighter begins to get pulled into the ground.\nA BLAST of engine pushes the ship up, and it fights through\nas the ground around collapses.",
        "dictionary": {
            "F-Fighter": "High-Speed Craft",
            "BLAST": "Forceful Propulsion"
        }
    },
    {
        "message_id": 804,
        "passage": "The F-Fighter escapes the planet as it simultaneously\nexplodes and implodes.",
        "dictionary": {
            "F-Fighter": "Spacecraft"
        }
    },
    {
        "message_id": 805,
        "passage": "Poe turn around to BB8 and laughs.\n                        POE\n             Good job, pal. How about next time\n             you drive?\n\n                       BB8\n             Bleep whistle beep.\n                       POE\n             You get a day off as soon as I\n             become in charge.\nThey fly off away from the space debris.",
        "dictionary": {
            "BB8": "Robot Companion",
            "POE": "Captain"
        }
    },
    {
        "message_id": 806,
        "passage": "Kelly Marie Tran From Comedy Bang Bang and Finn walk through\na doorway, two TWILEK greeters nod and smile at them, they\nplace HOLOLEI on the two customers.\n\nFinn’s eyes widen and jaw drops.\nThe sound explodes to life with the noise and hubbub of\ngambling, singing, laughing, drunken stupors, anything Reno\nor Atlantic City might be but about 500 times bigger.\n                    FINN\n          Oh my days.\n\nFinn nods his head and walks across the grand casino.\nKelly Marie Tran From Comedy Bang Bang follows, looking high\nand low as she does.\n                    FINN (CONT’D)\n          I know we’re on a super secret\n          important cool mission but you\n          think we could...\nFinn mimes popping a coin and pulling a lever, then splashing\ncoins in his face.\nJohn Boyega makes it work.\n\n                    KELLY MARIE TRAN FROM COMEDY BANG BANG\n          She’s not gonna be in the main\n          halls. Santha works the\n          entertainment rooms.\n\nFinn looks to Kelly Marie Tran From Comedy Bang Bang.\n                      FINN\n          Ohohohoo.\n\n                      KELLY MARIE TRAN FROM COMEDY BANG BANG\n          No.\n\nKelly Marie Tran From Comedy Bang Bang slaps Finn’s arm.\nThe two walk past a Sabak table where two players lay cards\ndown.\nA DEALER looks over the cards.\n                    DEALER\n          Three gleblorgs, house wins.\n\nThe two players gargle in anger, one is placed in chains and\nwalked away, the other takes out a blaster, we cut before...",
        "dictionary": {
            "TWILEK": "Alien beings",
            "HOLOLEI": "Greeting device",
            "FINN": "Character name",
            "Reno": "Casino city",
            "Atlantic City": "Casino city",
            "gambling, singing, laughing, drunken stupors": "Loud and boisterous atmosphere",
            "gleblorgs": "Unknown game cards"
        }
    },
    {
        "message_id": 807,
        "passage": "Finn and Kelly Marie Tran From Comedy Bang Bang walk over to\na path edge with railings, beyond the two is a giant spinning\nroulette wheel.\nA gigantic ball drops.\n                    CASINO ANNOUNCER (V.O.)\n          Final bets please.\n\nThe duo watch this giant ball bounce around. A few people\nhover over, flapping wings, trying to push the ball into\nvarious directions.\nIt is like Rocket League with Watto. Watto League. Coming to\nPSP this holiday season.\n\nThrough the commotion we hear the gentle hums of a song the\nsoundtrack will list as ‘GLABON NANGTO THRAN’\n                    KELLY MARIE TRAN FROM COMEDY BANG BANG\n          You hear that?\n                    CASINO ANNOUNCER (V.O.)\n          Red Four, folks. Red four.\n\nFinn shakes his head.\n                    FINN\n          That’s three fours in a row. This\n          place is rigged.\n                    KELLY MARIE TRAN FROM COMEDY BANG BANG\n          That voice, singing.\n\nFinn turns around. He nods.\n                    FINN\n          Yeah. Wait... Is that?\n                    KELLY MARIE TRAN FROM COMEDY BANG BANG\n          Maybe.\nThe dynamic duo bolt from the wheel-balcony and through the\ncasino.",
        "dictionary": {
            "Watto League": "Giant Ball Game",
            "PSP": "Portable Gaming System"
        }
    },
    {
        "message_id": 808,
        "passage": "SANTHA, early 20s, stands on stage. She’s probably played by\na notable instagram influencer with a decent voice. A less-\nexpensive Zendaya.\n\nFinn and Kelly Marie Tran From Comedy Bang Bang walk into the\nlounge, and are immediately handed oversized cocktail\nglasses, with large Shrimp-like creatures in them.\nThe two sit down and watch.\nThe two shrimp-beings open their eyes and sway along to the\nsong in the glasses.\n\nThe glasses are quickly placed on a table and pushed aside.\nAs the song finishes, Finn and Kelly Marie Tran From Comedy\nBang Bang join in on a gentle applause.\nKelly Marie Tran From Comedy Bang Bang heads over to the\nstage.\n\nFinn walks with her, but looks around the room.\nWe suddenly see a few First Order uniformed officials walking\nthrough the Lounge, and out to another place.\nFinn begins to wander in that direction.\n\n                    KELLY MARIE TRAN FROM COMEDY BANG BANG\n          Finn?\nFinn looks over, Kelly Marie Tran From Comedy Bang Bang waves\nFinn over.\n\n                    FINN\n          One second, yeah?\nFinn hops off, on the scent of the First Order.\nKelly Marie Tran From Comedy Bang Bang and Santha run towards\none another and have a huge hug.\nFinn leans out of the room.",
        "dictionary": {
            "First Order": "Imperial Forces",
            "Shrimp-like creatures": "Giant Crustaceans"
        }
    },
    {
        "message_id": 809,
        "passage": "From Finn’s POV we see three First Order officials walking\nquickly towards the back of the gigantic casino, before a\nswarm of gamblers walk around and make them seemingly\ndisappear.\n\nFinn begins to follow.",
        "dictionary": {
            "First Order": "High Command",
            "POV": "viewpoint"
        }
    }
]