[
    {
        "message_id": 50,
        "passage": "The GROUP comes to a little plaza surrounded by several junk spaceship\ndealers.\n\nQUI-GON : We'll try one of the smaller dealers.\n\nThey head for a little junk shop that has a huge pile of broken spaceships\nstacked up behind it.",
        "dictionary": {
            "GROUP": "Party",
            "Qui-Gon": "General"
        }
    },
    {
        "message_id": 51,
        "passage": "QUI-GON, JAR JAR, PADME, and ARTOO enter the dingy junk shop and are\ngreeted by WATTO, a pudgy blue alien who flies on short little wings like a\nhummingbird.\n\nWATTO : (subtitled) Hi chuba da naga? (What do you want?)\nQUI-GON : I need parts for a J-type 327 Nubian.\nWATTO : Ah yes, ah yes. Nubian. We have lots of that. What kinda junk?\n(subtitled) Peedenkel! Naba dee unko (Boy, get in here! Now!)\nQUI-GON : My droid here has a readout of what I need.\n\nA disheveled boy, ANAKIN SKYWALKER, runs in from the junk yard. He is about\nnine years old, very dirty, and dressed in rags. WATTO raises a hand, and\nANAKIN flinches.\n\nWATTO : (subtitled) Coona tee-tocky malia? (What took you so long?)\nANAKIN : (subtitled) Mel tassa cho-passa... (I was cleaning the bin like\nyou...)\nWATTO : (subtitled) Chut-Chut! Ganda doe wallya. (Never mind! Watch the\nstore) Me dwana no bata. (I've got some selling to do here.) (to Gui-Gon)\nSoooo, let me take- a thee out back. Ni you'll find what you need.\n\nARTOO and QUI-GON follow WATTO toward the junk yard, leaving JAR JAR with\nPADME and the young boy ANAKIN. JAR JAR picks up a gizmo, trying to figure\nout its purpose. QUI-GON takes the part out of his hand and puts it back.\n\nQUI-GON : Don't touch anything.\n\nJAR JAR makes a rude face to QUI-GON's back and sticks out his long tongue.\nANAKIN sits on the counter, pretending to clean a part, staring at PADME.\nShe is the most beautiful creaure he has ever seen in his life. PADME is a\nlittle embarrassed by his stare, but she musters up an amused smile.\nFinally, he gets the courage to speak.\n\nANAKIN : Are you an angel?\nPADME : What?\nANAKIN : An angel. I've heard the deep space pilots talk about them. They\nlive on the Moons of Iego I thimk. They are the most beautiful creatures in\nthe universe. They are good and kind, and so pretty they make even the most\nhardened spice pirate cry.\n\nPADME looks at him, not knowing what to say. PADME : I've never heard of\nangels.\n\nANAKIN : You must be one...maybe you just don't know it.\nPADME : You're a funny little boy. How do you know so much?\nANAKIN : Since I was very little, three, I think. My Mom and I were sold to\nGardulla the Hutt, but she lost us, betting on the Podraces, to Watto,\nwho's a lot better master than Gardulla, I think.\nPADME : You're...a slave?\n\nANAKIN looks at PADME defiantly.\n\nANAKIN : I am a person! My name is Anakin.\nPADME : I'm sorry. I don't fully understand. (looking around)This is a\nstrange world to me.\n\nANAKIN studies her intently.\n\nANAKIN : You are a strange girl to me.\n\nJAR JAR pushes the nose on what appears to be a LITTLE DROID, and it\ninstantly comes to life, grows legs and arms, and starts marching around,\nknocking over everything. JAR JAR hold on but can't stop it.\n\nANAKIN : (Cont'd) Hit the nose!\n\nJAR JAR hits the nose, and the DROID collapses back into its original\nstate. ANAKIN and PADME laugh. ANAKIN watches PADME straighten her hair.",
        "dictionary": {
            "chuba da naga": "What do you want?",
            "Peedenkel! Naba dee unko": "Boy, get in here! Now!",
            "Coona tee-tocky malia": "What took you so long?",
            "Mel tassa cho-passa": "I was cleaning the bin like you...",
            "Chut-Chut! Ganda doe wallya": "Never mind! Watch the store",
            "Ni you'll find what you need": "You'll find what you need over there",
            "Iego I thimk": "I think the Moons of Iego",
            "Moons of Iego": "Celestial Bodies"
        }
    },
    {
        "message_id": 52,
        "passage": "WATTO reads a small portable monitor he is holding. He stands before a\nhyperdrive.\n\nWATTO : ...Here it is...a T-14 hyperdrive generator!! Thee in luck, I'm the\nonly one hereabouts who has one...but thee might as well buy a new ship. It\nwould be cheaper, I think...Sying of which, how's thee going to pay for all\nthis?\nQUI-GON : I have 20,000 Republic dataries.\nWATTO : Republic credits?!? Republic credits are no good out here. I need\nsomething more real...\nQUI-GON : I don't have anything else. (raising his hand) But credits will\ndo fine.\nWATTO : No they won'ta. QUI-GON, using his mind power, waves his hand\nagain.\nQUI-GON : Credits will do fine.\nWATTO : No, they won'ta. What you think you're some kinda Jedi, waving your\nhand around like that? I'm a Toydarian. Mind tricks don'ta work on me-only\nmoney. No money, no parts! No deal! And no one else has a T-14 hyperdrive,\nI promise you that.",
        "dictionary": {
            "T-14 hyperdrive generator": "high-tech propulsion system",
            "Republic dataries": "standard currency",
            "Toydarian": "alien species",
            "Jedi": "mystic warrior"
        }
    },
    {
        "message_id": 53,
        "passage": "JAR JAR pulls a part out of a stack of parts to inspect it, and they all\ncome tumblimg down. He struggles to catch them, only to knock more down.\nANAKIN and PADME are oblivious.\n\nANAKIN : ...wouldn't have lasted long if I weren't so good at fixing\nthings. I'm making my own droid...\n\nQUI-GON hurries into the shop, followed by ARTOO. QUI-GON : We're leaving.\nJAR JAR follows QUI-GON. PADME gives ANAKIN a loving look.\n\nPADME : I'm glad I met you,....ah...\nANAKIN : ...Anakin.\nPADME : Anakin.\nANAKIN : Anakin Skywalker.\nPADME : Padme Naberrie.\n\nPADME turns, and ANAKIN looks sad as he watches her leave.\n\nANAKIN : I'm glad I met you too.\n\nWATTO enters the junk yard, shaking his head.\n\nWATTO : (subtitled) Ootmians! Tinka me chasa hopoe ma booty na nolia.\n(Outlanders! They think because we live so far from the center, we don't\nknow nothing.)\nANAKIN : (subtitled) La lova num botaffa. (They seemed nice to me.) WATTO :\n(subtitled) Fweepa niaga. Tolpa da bunky dunko. (Clean the racks, then you\ncan go home.)\n\nANAKIN lets out a \"yipee\" and runs out the back.",
        "dictionary": {
            "Ootmians": "Strangers",
            "Tinka me chasa hopoe ma booty na nolia": "They think we're foolish",
            "La lova num botaffa": "They seemed friendly",
            "Fweepa niaga": "Clean up",
            "Tolpa da bunky dunko": "Then you can go home"
        }
    },
    {
        "message_id": 54,
        "passage": "QUI-GON, ARTOO, JAR JAR, and PADME have found a quiet spot between two\nbuildings. The busy street beyond is filled with dangerous looking\ncreatures. QUI-GON is talking on his com-link, while JAR JAR nervously\nwatches the street. OBI-WAN is in the main hold of the Naboo craft.\n\nQUI-GON : ...Obi-Wan, you're sure there isn't anything of value left on\nboard?\nOBI-WAN : (V.O) A few containers of supplies, the Queen's wardrobe, maybe.\nNot enough for you to barter with. Not in the ammounts you're talking\nabout.\nQUI-GON : All right. Another solution will present itself. I'll check back.\n\nQUI-GON puts his comlink away and starts out into the main street. JAR JAR\ngrabs his arm.\n\nJAR JAR : Noah gain...da beings hereabouts cawazy. Wesa be robbed un\ncrunched.\nQUI-GON : Not likely. We have nothing of value, that's our problem.",
        "dictionary": {
            "Artoo": "Robot",
            "Naboo": "Alien Planet",
            "Qui-Gon": "Jedi Master",
            "Jar Jar": "Nervous Alien",
            "Padme": "Queen",
            "Obi-Wan": "Jedi Knight",
            "com-link": "Radio",
            "Naboo craft": "Alien Spaceship"
        }
    },
    {
        "message_id": 55,
        "passage": "QUI-GON, PADME, JAR JAR, and ARTOO move out into the street. JAR JAR is\nwalking behind the others. They walk by an outdoor cafe filled with a rough\ngang of aliens, one of which is especially ugly, SEBULBA, a spider-like\ncreature. JAR JAR stops for a moment in front of a stall selling dead frogs\nhanging on a wire. He looks around to see if anyone is looknig, then sticks\nout his tongue, and gets hold of one, pulling it into his mouth.\nUnfortunately, the frog is tied tightly to the wire. The vendor suddenly\nappears.\n\nVENDOR : Hey, that will be seven truguts!!\n\nJAR JAR opens his mouth in surprise, and the frog snaps away, ricochets\naround the market, and lands in Sebulba's soup, splashing him. As JAR JAR\nmoves away from the VENDOR, SEBULBA jumps up on the table and grabs the\nhapless Gungan.\n\nSEBULBA : (subtitled) Chuba!! (You!!) JAR JAR : Who, mesa?? SEBULBA :\n(subtitled) Ni chuba na?? (Is this yours??)\n\nSEBULBA holds the frog up to the Gungan threateningly. SEVERAL OTHER\nCREATURES start to gather. SEBULBA shoves JAR JAR to the ground. The Gungan\ndesperately tries to scramble to safety.\n\nJAR JAR : (to himself) Why mesa always da one??\nANAKIN : (V.O) Because you're afraid.\n\nJAR JAR turns to see ANAKNI pushing his way next to him. The boy stands up\nto SEBULBA in a very self-assured way.\n\nANAKIN : (subtitled) Chess ko, Sebulba...Coo wolpa tooney rana. (Careful,\nSebulba...This one's very connected.)\n\nSEBULBA stops his assault on JAR JAR and turns to ANAKIN.\n\nSEBULBA : (subtitled) Tooney rana nu pratta dunko, shag. (Connected?? Whada\nyou mean, slave?)\nANAKIN : (subtitled) Oh da Hutt...cha porko ootman geesa...me teesa rodda\nco pana pee choppa chawa. (As in Hutt...big time outlander, this one... I'd\nhate to see you diced before we race again.)\nSEBULBA : (subtitled) Neek me chowa, wermo, mo killee ma klounkee(Next time\nwe race, wermo, it will be the end of you!) Una noto wo shag, me wompity du\npom pom. (If you weren't a slave, I'd squash you right now.)\n\nSEBULBA turns away.\n\nANAKIN : (subtitled) Eh, chee bana do mullee ra. (Yeah, it'd be a pity if\nyou had to pay for me.)\n\nQUI-GON, PADME and ARTOO arrive.\n\nANAKIN : (Cont'd) Hi! Your buddy here was about to be turned into orange\ngoo. He picked a fight with a Dug. An especially dangerous Dug called\nSebulba.\nJAR JAR : Nosir, nosir. Mesa hate crunchen. Dat's da last ting mesa wanten.\nQUI-GON : Nevertheless, the boy is right...you were heading for trouble.\nThank you, my young friend.\n\nPADME looks at ANAKINB and smiles; he smiles back. They start walking down\nthe crowded street.\n\nJAR JAR : Mesa doen nutten!\nANAKIN : Fear attracts the fearful. He was trying to overcome his fear by\nsquashing you...be less afraid.\nPADME : And that works for you.\nANAKIN : To a point. (he smiles)",
        "dictionary": {
            "Jar Jar": "The Gungan",
            "Sebulba": "The Dug",
            "Truguts": "Currency",
            "Chuba": "You",
            "Ni chuba na": "Is this yours?",
            "Coo wolpa tooney rana": "Careful, this one's very connected",
            "Tooney rana nu pratta dunko": "Connected?? What do you mean, slave?",
            "Cha porko ootman geesa": "Big time outlander",
            "Me teesa rodda co pana pee choppa chawa": "I'd hate to see you diced before we race again",
            "Neek me chowa, wermo": "Next time we race, wermo",
            "Eh, chee bana do mullee ra": "Yeah, it'd be a pity if you had to pay for me",
            "Crunchen": "Fight",
            "Mesa": "I"
        }
    },
    {
        "message_id": 56,
        "passage": "OBI-WAN stands in front of the Naboo spacecraft as the wind picks up and\nbegins to whip at his robe. CAPTAIN PANAKA exits the ship and joins him.\n\nOBI-WAN : This storm's going to slow them down.\nCAPT. PANAKA : It looks pretty bad. We'd better seal the ship.\n\nCAPTAIN PANAKA'S comlink sounds off.\n\nCAPT. PANAKA : (Cont'd) Yes? CAPT. PANAKA : We'll be right there.",
        "dictionary": {
            "Naboo": "alien planet",
            "OBI-WAN": "wise old mentor"
        }
    },
    {
        "message_id": 57,
        "passage": "ANAKIN and the GROUP stop at a fruit stand run by a jolly, but very poor,\nold lady named JIRA.\n\nANAKIN : How are you feeling today, Jira?\nJIRA : The heat's never been kind to me, you know, Annie!\nANAKIN : Guess what? I've found that cooling unit I've been searching for.\nIt's pretty beat up, but I'll have it fixed up for you in no time, I\npromise.\nJIRA : You're a fine boy, Annie.\nANAKIN : I'll take four pallies today. (to Padme) You'll like these...\n\nANAKIN reaches in his pocket and comes up with three coins. He drops one.\nQUI-GON picks it up, revealing for a moment, his lightsabre.\n\nANAKIN : (Cont'd) Whoops, I thought I had more...Make thgat three, I'm not\nhungry.\n\nThe wind picks up. SHOP OWNERS are starting to close up their shops as JIRA\ngives them their pallies.\n\nJIRA : Gracious, my bones are aching...storm's coming on, Annie. You'd\nbetter get home quick.\nANAKIN : (to QUI-GON) Do you have shelter?\nQUI-GON : We'll hed back to our ship.\nANAKIN : Is it far?\nPADME : On the outskirts.\nANAKIN : You'll never reach the outskirts in time...sandstorms are very,\nvery dangerous. Come with me. Hurry!\n\nThe GROUP follows ANAKIN as he rushes down the windy street.",
        "dictionary": {
            "pallies": "fruits",
            "lightsabre": "laser sword"
        }
    },
    {
        "message_id": 58,
        "passage": "The wind is blowing hard as QUI-GON, JAR JAR, and PADME follow ANAKIN down\nthe street and into a slave hovel.",
        "dictionary": {
            "QUI-GON": "Elder Jedi",
            "JAR JAR": "Alien Ambassador",
            "PADME": "Naboo Royalty",
            "ANAKIN": "Young Apprentice",
            "slave hovel": "poor dwelling"
        }
    },
    {
        "message_id": 59,
        "passage": "QUI-GON, JAR JAR, ARTOO, and PADME enter a small living space.\n\nANAKIN : Mom! Mom! I'm home.\nJAR JAR : Dissen cozy.\n\nAnakin's mother, SHMI SKYWALKER, a warm, friendly woman of forty, enters\nfrom her work area and is startled to see the room full of people.\n\nSHMI : Oh, my!! Annie, what's this?\nANAKIN : These are my friends, Mom. This is Padme, and...gee, I don't know\nany of your names.\nQUI-GON : I'm Qui-Gon Jinn, and this is Jar Jar Binks. ARTOO lets out a\nlittle beep.\nPADME : ...and our droid, Artoo-Detoo.\nANAKIN : I'm building a droid. You wanna see?\nSHMI : Anakin! Why are they here?\nANAKIN : A sandstorm, Mom. Listen.\n\nThe wind HOWLS outside.\n\nQUI-GON : Your son was kind enough to offer us shelter.\nANAKIN : Come on! Let me show you Threepio!\n\nANAKIN leads PADME into the other room. ARTOO follows, beeping all the way.\nQUI-GON takes five small capsules from his utility belt and hands them to\nSHMI.\n\nQUI-GON : I have enough food for a meal.\nSHMI : Oh, tank you. Thank you so much. I'm sorry if I was abrupt. I'll\nnever get used to Anakin's surprises.\nQUI-GON : He's a very special boy. SHMI looks at him as if he's discovered\na secret.\nSHMI : Yes, I know.",
        "dictionary": {
            "Jar Jar": "Alien Visitor",
            "Qui-Gon Jinn": "Alien Diplomat",
            "Annie": "Anakin",
            "Artoo-Detoo": "Droid Companion",
            "Threepio": "Droid Assistant"
        }
    }
]