[
    {
        "message_id": 1100,
        "passage": "Rey looks up to a SERVICE WINDOW: two feet above her, behind\n          a protective screen, is her boss, UNKAR PLUTT (50, blobfish,\n          unclean). He examines her pieces. Then he offers:\n\n                          UNKAR\n           What you've brought me today is\n           worth... Hmmm... One quarter\n           portion.\n          Though disappointed, Rey barely shows it. She nods thanks.\n          Unkar pushes through his transfer drawer a SEALED PACKET:\n          DRIED GREEN MEAT in one section, BEIGE POWDER in another.\n          She takes it.\n          She swallows her resentment and heads off.",
        "dictionary": {
            "SERVICE WINDOW": "Customer Service Counter",
            "UNKAR PLUTT": "Mr. Smith",
            "SEALED PACKET": "Enclosed Package"
        }
    },
    {
        "message_id": 1101,
        "passage": "The IMMENSE SETTING SUN against the FLAT TERRAIN. Rey's\n          SPEEDER races, almost insignificant, across frame.",
        "dictionary": {
            "IMMENSE SETTING SUN": "Glowing Sunset",
            "FLAT TERRAIN": "Open Land"
        }
    },
    {
        "message_id": 1102,
        "passage": "She SCRATCHES MARKS into the rusty wall. Another MARK;\n          another DAY. And there are THOUSANDS of marks.\n          A SIZZLING SOUND over: A DRIED DESERT FLOWER in a rusty ENGINE\n          PIECE. A rough, stuffed HANDMADE DOLL, made from what looks\n          like orange Rebellion flight suit material and twine.\n          Rey's lonely, ramshackle dwelling. Everything reclaimed.\n          She cooks for one. Does everything for one. She opens the\n          POWDER, moves to the makeshift WOK, where the GREEN MEAT\n          SIZZLES. Pours the powder into milky WATER in a tin. Stirs\n          it. It GROWS INTO A LOAF as she puts the meat on an old\n          plate. Grabs the loaf.",
        "dictionary": {
            "SCRATCHES MARKS": "Makes Notes",
            "SCRATCHES": "Makes",
            "MARKS": "Signs",
            "THOUSANDS": "Many",
            "DRIED DESERT FLOWER": "Parched Plant",
            "HANDMADE DOLL": "Homemade Toy",
            "orange Rebellion flight suit material": "torn fabric",
            "POWDER": "Mixture",
            "WOK": "Pan",
            "GREEN MEAT": "Raw Food",
            "LOAF": "Bread"
        }
    },
    {
        "message_id": 1103,
        "passage": "Rey sits, eats like a starving child. Every last drop.\n          Licks the metal plate. Looks out at the horizon. A single\n          silent ship heads off, a shimmering, thin contrail. She\n          wipes her mouth. Picks up an old, broken REBELLION HELMET.\n\n                         \n\n                          (CONTINUED)\n          CONTINUED: just 'cause.\n          Puts it on,\n          WIDE SHOT of Rey sitting, alone and isolated, on the leg of\n          an ANCIENT, FALLEN AT-AT in which she lives.\n          Then, a distant ELECTRONIC SQUEAL -- instantly she's up,\n          helmet too big, she rips it off. Hears ANOTHER BEEPING\n          SQUEAL. She hurries to her QUARTERSTAFF and runs off.\n          Rey climbs a dune. RISE WITH HER, revealing BB-8, caught in\n          a NET but fighting back, being held by a TEEDO (a small,\n          brutish desert tyrant), who rides a LUGGABEAST. The teedo\n          YELLS at BB-8, who BEEPS madly, struggling to free himself.\n          Rey watches this injustice for a beat, finally YELLING OUT:\n\n                          REY\n           Tal'ama parqual!\n          The Teedo and BB-8 STOP, GO SILENT, turn to her.\n\n                          REY (CONT'D)\n           Parqual zatana!\n          A half beat and the Teedo YELLS SOMETHING BACK, threatening.\n          BB-8's head swivels to him, then back to Rey, like watching\n          a tennis match.\n          Rey angrily moves to them, pulling a knife from her pouch.\n          Rey starts CUTTING BB-8 out of the netting. The Teedo freaks\n          out, YELLING. Rey suddenly stands, turns to the Teedo and\n          says, fiercely:\n\n                          REY (CONT'D)\n\n           NOMA.\n          The Teedo barks a sort of \"AHHHHH!\" (As if to say, \"GO TO\n          HELL!\"), Then heads off on his beast. This prompts BB-8 to\n          start BEEP-YELLING at the departing bully, provocatively.\n\n                          REY (CONT'D)\n           Shhhh.\n          BB-8 quiets instantly. The two watch the Teedo head off.\n          Finally, BB-8 BEEPS a question. She KNEELS to him.\n\n                          REY (CONT'D)\n           That's just Teedo. Wants you for\n           parts. He has no respect for anyone.\n           Your antenna's bent.\n           (considers BB-8 for\n           the first time,\n\n                          STRAIGHTENS THE\n\n                          ANTENNA)\n           Where do you come from?\n\n                          (BB-8 BEEPS)\n           Classified. Really? Me too. Big\n           secret.\n           (points to horizon)\n           Niima Outpost is that way, stay off\n           Kelvin Ridge.\n\n                          (MORE)\n\n                         \n\n                          (CONTINUED)\n\n                         CONTINUED:\n\n                          REY (CONT'D)\n           Keep away from the Sinking Fields in\n           the north, you'll drown in the sand.\n           (stands, heads off)\n\n                         \n          BB-8 starts after her, BEEPS. She turns sharply, he stops.\n\n                         \n\n                         \n\n                          REY (CONT'D)\n           Don't follow me. Town is that way.\n           (he BEEPS again)\n           No!\n          She heads off again. Finally he BEEPS to her -- something\n          SWEET this time. That he is alone, scared, has no one else.\n          This makes her stop. She turns and looks at him. Not liking\n          him. But a gesture of her head says, reluctantly, \"Come\n          on.\" BB-8 quickly moves to her. They head off together.\n\n                          REY (CONT'D)\n           In the morning, you go.\n\n                          (HE BEEPS)\n           You're welcome.\n          The two disappear behind a dune.",
        "dictionary": {
            "REBELLION HELMET": "Old Military Headgear",
            "ANCIENT, FALLEN AT-AT": "Abandoned Giant Walker",
            "QUARTERSTAFF": "Long Staff",
            "TEEDO": "Desert Beast",
            "LUGGABEAST": "Large Mammal",
            "NOMA": "Good Riddance",
            "Niima Outpost": "Remote Trading Post",
            "Kelvin Ridge": "Barren Hill",
            "Sinking Fields": "Drying Lakebed",
            "AT-AT": "Giant Walker"
        }
    },
    {
        "message_id": 1104,
        "passage": "Three TIE fighters head to the massive ship high above Jakku.",
        "dictionary": {
            "TIE": "Fighter Squadrons"
        }
    },
    {
        "message_id": 1105,
        "passage": "POE, shackled to a chair, BEATEN, wakes up.\n\n                          KYLO REN\n           I had no idea we had the best pilot\n           in the Resistance on board.\n           Comfortable?\n          Through battered lips:\n\n                          POE\n           Not really.\n\n                          KYLO REN\n           I'm impressed. No one has been able\n           to get out of you what you did with\n           the map.\n\n                          POE\n           Might wanna rethink your technique.\n          Kylo Ren says nothing, reaches out to him. Poe flinches in\n          the chair as Kylo Ren reaches for his face, not touching\n          him. Poe is soon in agony, remains in horrible silence --\n\n                          KYLO REN\n           Where is it?\n\n                         \n\n                         \n\n                          (CONTINUED)\n\n                         CONTINUED:\n\n                          POE\n           The Resistance will not be intimidated\n           by you.\n\n                          KYLO REN\n           Where... is it?\n          Poe can't take it -- he BEGINS TO SCREAM and we CUT TO:",
        "dictionary": {
            "Resistance": "Rebel Alliance",
            "First Order": "Imperial Remnant"
        }
    },
    {
        "message_id": 1106,
        "passage": "WHOOOSH! The cell door SLIDES UP. Kylo Ren exits, fierce,\n          confronts GENERAL HUX (34, scary) who awaits him:\n\n                          KYLO REN\n           It's in a droid. A BB unit.\n\n                          GENERAL HUX\n           Well then. If it's on Jakku, we'll\n           soon have it.\n\n                          KYLO REN\n           I leave that to you.",
        "dictionary": {
            "SLIDES UP": "opens",
            "BB unit": "small robot"
        }
    },
    {
        "message_id": 1107,
        "passage": "BB-8 is dropped to the sand.\n\n                          REY\n           Don't give up. He still might show\n           up. Whoever it is you're waiting\n           for. Classified. I know all about\n           waiting.\n          BB-8 BEEPTALKS a question.\n\n                          REY (CONT'D)\n           For my family. They'll be back.\n           One day. Come on.\n          She tries to force a smile, but can't, really. She heads\n          off. BB-8 BEEPS... then heads after her.",
        "dictionary": {
            "BEEPTALKS": "speaks in a beeping language",
            "BB-8": "R2-D2"
        }
    },
    {
        "message_id": 1108,
        "passage": "Rey stands with BB-8 in front of Unkar Plutt, at his window.\n          He reviews her goods. He glances quickly at BB-8.\n\n                          UNKAR\n           These five pieces are worth... Let\n           me see here... One half portion.\n\n                          REY\n\n                          (OBJECTS)\n           Last week they were a half portion\n           each.\n          She hates him. He leans forward.\n\n                         \n\n                         \n\n                          (CONTINUED)\n\n                         CONTINUED:\n\n                          UNKAR\n           What about the droid?\n\n                          REY\n           What about him?\n\n                          UNKAR\n           I'll pay for him.\n          BB-8 doesn't like this at all. Rey is awkward, but curious.\n\n                          UNKAR (CONT'D)\n           Sixty portions.\n          CLOSE ON HER. Stunned. Literally hungry for this amount of\n          food, her stomach practically rumbles.\n          BB-8 sees her interest and BEEPS furiously, not liking this\n          conversation at all.\n          She looks at Unkar. Looks down at BB-8. Considers it all.\n          Finally, she hears herself say:\n\n                          REY\n           Actually... the droid's not for sale.\n\n                          (TO BB-8)\n           Come on.\n          Unkar furious. Rey, then BB-8, head out. Recovering, Unkar\n          watches her go with dark eyes. He picks up a communicator:\n\n                          UNKAR\n           Follow the girl and get that droid.\n          He SLAMS the service window door SHUT.",
        "dictionary": {
            "BB-8": "the droid",
            "Unkar Plutt": "the trader"
        }
    },
    {
        "message_id": 1109,
        "passage": "The cell door WHOOSHES OPEN -- a STORMTROOPER enters. Poe\n          remains shackled, worse for wear. A TROOPER GUARD here.\n\n                          STORMTROOPER\n           Ren wants the prisoner.\n          TIGHT ON POE, in pain, drained, as the Guard unshackles him.",
        "dictionary": {
            "WHOOSHES": "opens with a loud sound",
            "STORMTROOPER": "Imperial soldier",
            "TROOPER GUARD": "armored guard",
            "POE": "Captain of the Resistance"
        }
    }
]