[
    {
        "message_id": 190,
        "passage": "The nervous Rebel troopers aim their weapons. Suddenly a\n    tremendous blast opens up a hole in the main passageway and\n    a score of fearsome armored spacesuited stormtroopers make\n    their way into the smoke-filled corridor.\n\n    In a few minutes the entire passageway is ablaze with\n    laserfire. The deadly bolts ricochet in wild random patterns\n    creating huge explosions. Stormtroopers scatter and duck\n    behind storage lockers. Laserbolts hit several Rebel\n    soldiers who scream and stagger through the smoke, holding\n    shattered arms and faces.\n\n    An explosion hits near the robots.\n\n                        THREEPIO\n              I should have known better than to\n              trust the logic of a half-sized\n              thermocapsulary dehousing\n              assister...\n\n    Artoo counters with an angry rebuttal as the battle rages\n    around the two hapless robots.\n\n4",
        "dictionary": {
            "Rebel": "Resistance",
            "stormtroopers": "elite soldiers",
            "spacesuited": "fully equipped",
            "Threepio": "R2-D2's companion",
            "thermocapsulary dehousing assister": "a complicated device",
            "Artoo": "R2-D2"
        }
    },
    {
        "message_id": 191,
        "passage": "A death-white wasteland stretches from horizon to horizon.\n    The tremendous heat of two huge twin suns settle on a lone\n    figure, Luke Skywalker, a farm boy with heroic aspirations\n    who looks much younger than his eighteen years. His shaggy\n    hair and baggy tunic give him the air of a simple but\n    lovable lad with a prize-winning smile.\n\n    A light wind whips at him as he adjusts several valves on a\n    large battered moisture vaporator which sticks out of the\n    desert floor much like an oil pipe with valves. He is aided\n    by a beatup tread-robot with six claw arms. The little robot\n    appears to be barely functioning and moves with jerky\n    motions. A bright sparkle in the morning sky catches Luke's\n    eye and he instinctively grabs a pair of electrobinoculars\n    from his utility belt. He stands transfixed for a few\n    moments studying the heavens, then dashed toward his dented,\n    crudely repaired Landspeeder (an auto-like transport that\n    travels a few feet above the ground on a magnetic-field). He\n    motions for the tiny robot to follow him.\n\n                        LUKE\n              Hurry up! Come with me! What are\n              you waiting for?! Get in gear!\n\n    The robot scoots around in a tight circle, stops short, and\n    smoke begins to pour out of every joint. Luke throws his\n    arms up in disgust. Exasperated, the young farm boy jumps\n    into his Landspeeder leaving the smoldering robot to hum\n    madly.\n\n5",
        "dictionary": {
            "Luke Skywalker": "Young Adventurer",
            "moisture vaporator": "water extractor",
            "tread-robot": "small mechanical assistant",
            "electrobinoculars": "high-tech binoculars",
            "Landspeeder": "maglev vehicle"
        }
    },
    {
        "message_id": 192,
        "passage": "The awesome, seven-foot-tall Dark Lord of the Sith makes his\n    way into the blinding light of the main passageway. This is\n    Darth Vader, right hand of the Emperor. His face is obscured\n    by his flowing black robes and grotesque breath mask, which\n    stands out next to the fascist white armored suits of the\n    Imperial stormtroopers. Everyone instinctively backs away\n    from the imposing warrior and a deathly quiet sweeps through\n    the Rebel troops. Several of the Rebel troops break and run\n    in a frenzied panic.\n\n6",
        "dictionary": {
            "Sith": "Dark Sorcerer",
            "Imperial stormtroopers": "Government Soldiers",
            "Rebel troops": "Resistance Fighters"
        }
    },
    {
        "message_id": 193,
        "passage": "A woman's hand puts a card into an opening in Artoo's dome.\n    Artoo makes beeping sounds.\n\n7",
        "dictionary": {
            "Artoo": "R2-D2",
            "beeping sounds": "electronic noises"
        }
    },
    {
        "message_id": 194,
        "passage": "Threepio stands in a hallway, somewhat bewildered. Artoo is\n    nowhere in sight. The pitiful screams of the doomed Rebel\n    soldiers can be heard in the distance.\n\n                        THREEPIO\n              Artoo! Artoo-Detoo, where are you?\n\n    A familiar clanking sound attacks Threepio's attention and\n    he spots little Artoo at the end of the hallway in a smoke-\n    filled alcove. A beautiful young girl (about sixteen years\n    old) stands in front of Artoo.\n\n    Surreal and out of place, dreamlike and half hidden in the\n    smoke, she finishes adjusting something on Artoo's computer\n    face, then watches as the little robot joins his companion.\n\n                        THREEPIO (CONT’D)\n              At last! Where have you been?\n\n    Stormtroopers can be heard battling in the distance.\n\n                        THREEPIO (CONT’D)\n              They're heading in this direction.\n              What are we going to do? We'll be\n              sent to the spice mine of Kessel or\n              smashed into who knows what!\n\n    Artoo scoots past his bronze friend and races down the\n    subhallway. Threepio chases after him.\n\n                        THREEPIO (CONT’D)\n              Wait a minute, where are you going?\n\n    Artoo responds with electronic beeps.\n\n8",
        "dictionary": {
            "Artoo-Detoo": "Little Robot",
            "Kessel": "Unknown Planet"
        }
    },
    {
        "message_id": 195,
        "passage": "The evil Darth Vader stands amid the broken and twisted\n    bodies of his foes. He grabs a wounded Rebel Officer by the\n    neck as an Imperial Officer rushes up to the Dark Lord.\n\n                        IMPERIAL OFFICER\n              The Death Star plans are not in the\n              main computer.\n\n    Vader squeezes the neck of the Rebel Officer, who struggles\n    in vain.\n\n                        VADER\n              Where are those transmissions you\n              intercepted?\n\n    Vader lifts the Rebel off his feet by his throat.\n\n                        VADER (CONT’D)\n              What have you done with those\n              plans?\n\n                        REBEL OFFICER\n              We intercepted no transmissions.\n              Aaah... This is a consular ship.\n              Were on a diplomatic mission.\n\n                        VADER\n              If this is a consular ship... were\n              is the Ambassador?\n\n     The Rebel refuses to speak but eventually cries out as the\n     Dark Lord begins to squeeze the officer's throat, creating a\n     gruesome snapping and choking, until the soldier goes limp.\n     Vader tosses the dead soldier against the wall and turns to\n     his troops.\n\n                         VADER (CONT’D)\n               Commander, tear this ship apart\n               until you've found those plans and\n               bring me the Ambassador. I want her\n               alive!\n\n     The stormtroopers scurry into the subhallways.\n\n9",
        "dictionary": {
            "Death Star": "Imperial Base",
            "Dark Lord": "Evil Emperor",
            "Imperial Officer": "High-Ranking Commander",
            "Rebel Officer": "Diplomatic Envoy",
            "Consular ship": "Diplomatic Vessel"
        }
    },
    {
        "message_id": 196,
        "passage": "The lovely young girl huddles in a small alcove as the\n     stormtroopers search through the ship. She is Princess Leia\n     Organa, a member of the Alderaan Senate. The fear in her\n     eyes slowly gives way to anger as the muted crushing sounds\n     of the approaching stormtroopers grow louder. One of the\n     troopers spots her.\n\n                         TROOPER\n               There she is! Set for stun!\n\n     Leia steps from her hiding place and blasts a trooper with\n     her laser pistol. She starts to run but is felled by a\n     paralyzing ray. The troopers inspect her inert body.\n\n                         TROOPER (CONT’D)\n               She'll be all right. Inform Lord\n               Vader we have a prisoner.\n\n10",
        "dictionary": {
            "Alderaan": "a distant planet",
            "stormtroopers": "armed guards",
            "Lord Vader": "a high-ranking officer"
        }
    },
    {
        "message_id": 197,
        "passage": "Artoo stops before the small hatch of an emergency lifepod.\n     He snaps the seal on the main latch and a red warning light\n     begins to flash. The stubby astro-robot works his way into\n     the cramped four-man pod.\n\n                         THREEPIO\n               Hey, you're not permitted in there.\n               It's restricted. You'll be\n               deactivated for sure..\n\n     Artoo beeps something to him.\n\n                         THREEPIO (CONT’D)\n               Don't call me a mindless\n               philosopher, you overweight glob of\n               grease! Now come out before\n               somebody sees you.\n\n     Artoo whistles something at his reluctant friend regarding\n     the mission he is about to perform.\n\n                         THREEPIO (CONT’D)\n               Secret mission? What plans? What\n               are you talking about? I'm not\n               getting in there!\n\n     Artoo isn't happy with Threepio's stubbornness, and he beeps\n     and twangs angrily.\n\n     A new explosion, this time very close, sends dust and debris\n     through the narrow subhallway. Flames lick at Threepio and,\n     after a flurry of electronic swearing from Artoo, the lanky\n     robot jumps into the lifepod.\n\n                         THREEPIO (CONT’D)\n               I'm going to regret this.\n\n11",
        "dictionary": {
            "astro-robot": "space robot",
            "subhallway": "narrow corridor"
        }
    },
    {
        "message_id": 198,
        "passage": "On the main viewscreen, the lifepod carrying the two\n     terrified robots speeds away from the stricken Rebel\n     spacecraft.\n\n                         CHIEF PILOT\n               There goes another one.\n\n                          CAPTAIN\n               Hold your fire. There are no life\n               forms. It must have been short-\n               circuited.\n\n12",
        "dictionary": {
            "Rebel": "Resistance",
            "lifepod": "escape pod"
        }
    },
    {
        "message_id": 199,
        "passage": "Artoo and Threepio look out at the receding Imperial\n     starship. Stars circle as the pod rotates through the\n     galaxy.\n\n                         THREEPIO\n               That's funny, the damage doesn't\n               look as bad from out here.\n\n     Artoo beeps an assuring response.\n\n                         THREEPIO (CONT’D)\n               Are you sure this things safe?\n\n13                                                            13",
        "dictionary": {
            "Artoo": "Robot",
            "Threepio": "Protocol Droid"
        }
    }
]