[
    {
        "message_id": 1450,
        "passage": "On a high balcony, TION MEDON looks down on the landing platform. A few steps behind him stands one of GENERAL GRIEVOUS's BODYGUARDS. They watch the canopy lower. \n\nTlON MEDON: I told you, all he wanted was fuel. \n\nBODYGUARD: What was his name? \n\nTlON MEDON: He didn't say. \n\nThey watch as the BLUE JEDI FIGHTER takes off. \n\n107",
        "dictionary": {
            "JEDI": "Knights of the Force",
            "BODYGUARDS": "Security Officers"
        }
    },
    {
        "message_id": 1451,
        "passage": "OBI-WAN also watches his ship take off. He is hiding in the hallway. He quietly moves farther into the city. \n\n108",
        "dictionary": {
            "OBI-WAN": "The Jedi Master"
        }
    },
    {
        "message_id": 1452,
        "passage": "OBI-WAN quickly rushes up a stairway cut into the side of the sinkhole. It's hard to see him. In an alcove, he carefully surveys the city, then quickly moves on. \n\n109",
        "dictionary": {
            "OBI-WAN": "the wise old man",
            "Jedi": "warrior monk"
        }
    },
    {
        "message_id": 1453,
        "passage": "OBI-WAN makes his way through the city, looking up at the tenth level with electro-binoculars from his utility belt. He tries to figure out how he is going to get up there. He hears strange bellowing cries and he investigates. \nHe comes across a corral filled with about half a dozen DRAGON-LIKE LIZARDS. SEVERAL WRANGLERS are standing around. \nOBI-WAN walks up to the WRANGLERS and uses the Force with his slight hand movements. \n\nOBI-WAN: I need transportation. \n\nWRANGLER: (subtitled, in native tongue) You need transportation. \n\nOBI-WAN: Get it for me. \n\nWRANGLER: (subtitled, in native tongue) I will get it for you. \n\nOne of the WRANGLERS turns to the others and chatters away in his strange tongue. OBI-WAN walks along the line of DRAGON/LIZARDS, checking out each one. He looks at their teeth, legs, etc. Finally he pats one on the neck. \n\nOBI-WAN: This one. \n\nThe WRANGLER brings the chosen one over to him. \n\nWRANGLER: Boga. She answers to Boga. \n\nOBI-WAN: Good girl, Boga. \n\nOBI-WAN swings onto the back of the LIZARD. The beast rears up and scurries outside to the edge of the sinkhole. \n\n110",
        "dictionary": {
            "DRAGON-LIKE LIZARDS": "Prehistoric Reptiles",
            "WRANGLERS": "Animal Handlers",
            "Boga": "Sheila",
            "OBI-WAN": "Astronaut",
            "Force": "Telepathy"
        }
    },
    {
        "message_id": 1454,
        "passage": "The LIZARD BOGA rears up on her hind legs again, then climbs the wall of the sheer cliff and starts moving up toward the tenth level. The city appears to be deserted. OBI-WAN is alert to any movement. \n\n111",
        "dictionary": {
            "LIZARD BOGA": "Giant Reptile",
            "OBI-WAN": "Wisdom Keeper"
        }
    },
    {
        "message_id": 1455,
        "passage": "GENERAL GRIEVOUS stands before the COUNCIL OF SEPARATISTS, including NUTE GUNRAY, RUNE HAAKO. POGGLE THE LESSER, SHU MAI, SAN HILL PO NUDO, WAT TAMBOR, and PASSEL ARGENTE. OBI-WAN hides above the assembly and watches intently. \n\nGENERAL GRIEVOUS: It won't be long before the armies of the Republic track us here. I am sending you to the Mustafar system in the Outer Rim. It is a volcanic planet which generates a great deal of scanning interference. You will be safe there. \n\nNUTE GUNRAY: Safe? Chancellor Palpatine managed to escape your grip, General, without Count Dooku. I have doubts about your ability to keep us safe. \n\nGENERAL GRIEVOUS: Be thankful, Viceroy, you have not found yourself in my grip . . . Your ship is waiting. \n\nOBI-WAN is deep in thought. \n\n112",
        "dictionary": {
            "COUNCIL OF SEPARATISTS": "Separatist Alliance",
            "Mustafar system": "Outer Rim territory",
            "Outer Rim": "Periphery",
            "Chancellor Palpatine": "Supreme Leader",
            "Count Dooku": "High Commander"
        }
    },
    {
        "message_id": 1456,
        "passage": "The JEDI removes his cloak and jumps down behind the GENERAL. \n\nOBI-WAN: Hello, there! \n\nGENERAL GRIEVOUS: General Kenobi, you are a bold one. I find your behavior bewildering . . . Surely you realize you're doomed, (to droids) Kill him! \n\nAbout a HUNDRED BATTLE DROIDS surround OBI-WAN, GENERAL GRIEVOUS, and his BODYGUARDS. OBI-WAN looks around, then walks right up to GENERAL GRIEVOUS. \nThey stare at each other for a moment. \n\nGENERAL GRIEVOUS: Enough of this. \n\nThe BODYGUARDS raise their power staffs to knock OBI-WAN away, but OBI-WAN ducks as the deadly staffs whistle over his head. The Jedi's lightsaber ignites, and OBI-WAN deftly cuts one BODYGUARD in two. His staff flies into the air and is caught by GENERAL GRIEVOUS. The other THREE BODYGUARDS attack OBI-WAN with an intense fury. \nOBI-WAN uses the Force to release apiece of equipment from the ceiling. It drops on the BODYGUARDS, smashing them. OBI-WAN walks toward GRIEVOUS, slashing the last BODYGUARD to pieces. BATTLE DROIDS move toward OBI-WAN. \n\nGENERAL GRIEVOUS: Back away. I will deal with this Jedi slime myself. \n\nOBI-WAN: Your move. \n\nGENERAL GRIEVOUS: You fool. I have been trained in your Jedi arts by Count Dooku himself. Attack, Kenobi. \n\nHis arms separate and grab all four lightsabers on his belt. His four arms create a flashing display of swordsmanship. \n\nOBI-WAN: You forget I trained the Jedi that defeated Count Dooku! \n\nOBI-WAN is hard-pressed to defend himself against the deadly onslaught. They fight across the control room as the BATTLE DROID SHARPSHOOTERS try to pick off the Jedi. OBI-WAN mounts a ferocious counterattack and cuts off one of GRIEVOUS's hands. A loud EXPLOSION is heard echoing throughout the sinkhole. GENERAL GRIEVOUS and OBI-WAN glance to the entrance of the control center and see CLONE TROOPS in the distance, attacking DROIDS in the sinkhole. On the far wall of the sinkhole, CLONES can be seen rappelling onto balconies. \n\nOBI-WAN: I may not defeat your droids, but my troops certainly will. \n\nGENERAL GRIEVOUS: Army or not, you must realize you are doomed. \n\nOBI-WAN: I don't think so. \n\nTWENTY CLONES suddenly rappel into the entrance of the control center, ray guns blazing. Chaos. Laser bolts fly everywhere as the DROIDS return fire. OBI-WAN attacks GENERAL GRIEVOUS, who defends himself rigorously with one of his bodyguard's electro-staffs. OBI-WAN uses the Force to hurl GENERAL GRIEVOUS backwards. He falls onto a lower platform and OBI-WAN jumps down after him. \n\n113",
        "dictionary": {
            "JEDI": "Warrior Monk",
            "GENERAL": "Commander",
            "OBI-WAN": "John",
            "GENERAL GRIEVOUS": "Warlord",
            "HUNDRED": "Score",
            "BATTLE DROIDS": "Robot Troops",
            "BODYGUARDS": "Security Detail",
            "Jedi's": "Warrior's"
        }
    },
    {
        "message_id": 1457,
        "passage": "More CLONES rappel into the control center and blast away at the remaining DROIDS. \nThe JEDI cuts down several DROIDS as he races to the entrance of the control center. OBI-WAN spots GENERAL GRIEVOUS racing toward one of the landing platforms in the midst of the battle. GENERAL GRIEVOUS jumps onto a WHEEL SCOOTER and takes off down the wall of the sinkhole. OBI-WAN whistles for his LIZARD BOGA, who runs to him. OBI-WAN jumps on. \n\n114",
        "dictionary": {
            "CLONES": "Elite Troopers",
            "DROIDS": "Robots",
            "JEDI": "Warrior",
            "WHEEL SCOOTER": "Hoverboard",
            "LIZARD BOGA": "Steed"
        }
    },
    {
        "message_id": 1458,
        "passage": "The chase begins. Obi-Wan drops his lightsaber while riding Boga. \n\n115",
        "dictionary": {
            "Obi-Wan": "The Jedi Master",
            "lightsaber": "energy blade",
            "Boga": "mount"
        }
    },
    {
        "message_id": 1459,
        "passage": "The sun is setting as the lights come on in the massive Senate Office Building. The sky is red. \n\n116",
        "dictionary": {}
    }
]