[
    {
        "message_id": 1870,
        "passage": "Luke's X-wing races through thick clouds toward Cloud City.\n\n205",
        "dictionary": {
            "X-wing": "fighter jet",
            "Cloud City": "skyscraper metropolis"
        }
    },
    {
        "message_id": 1871,
        "passage": "Luke is grim-faced as he pilots his course toward Bespin's\n      shining city. Artoo's beeps and whistles are transmitted\n      onto the scope.\n\n                           LUKE\n                     (into comlink)\n                 No, Threepio's with them.\n\n      Artoo whistles another worried inquiry.\n\n                           LUKE\n                     (into comlink)\n                 Just hang on. We're almost there.\n\n206",
        "dictionary": {
            "Bespin": "Cloud City",
            "Threepio": "Assistant"
        }
    },
    {
        "message_id": 1872,
        "passage": "Chewbacca is in a Cloud City prison cell. The stark room is\n      flooded with hot light. To add to Chewie's misery, a high-\n      pitched whistle screeches loudly. Chewie is going mad. He\n      hits the wall with giant fists as he paces back and forth\n      across the cell floor. The upper lights go off abruptly.\n      The prisoner rubs his eyes and moves to a wall, where he\n      listens for a moment. Then, moaning to himself, he moves to\n      a platform where the disassembled pieces of Threepio lie.\n      He picks up the golden droid's head and meditates on it for\n      a moment, barking a few philosophical remarks. Chewie\n      sticks the robot's head on its torso and starts adjusting\n      wires and circuits.\n\n      Suddenly, the lights in Threepio's eyes spark to life as\n      Chewie touches two connectors together. Threepio\n      immediately begins to speak, but his voice is so slow and so\n      low as to be nearly unintelligible.\n\n                           THREEPIO\n                 Mmmm. Oh, my. Uh, I, uh - Take\n                 this off! I, uh, don't mean to\n                 intrude here. I, don't, no, no,\n                 no... Please don't get up. No!\n\n      Chewie looks at Threepio in bewilderment, then scratches his\n      furry head. He gets an idea and adjusts some connections,\n      whereupon Threepio immediately begins speaking normally.\n\n                          THREEPIO (CONT’D)\n                Stormtroopers? Here? We're in\n                danger. I must tell the others.\n                Oh, no! I've been shot!\n\n207",
        "dictionary": {
            "Cloud City": "Prison Colony",
            "Threepio": "Robot Companion",
            "Stormtroopers": "Imperial Guards"
        }
    },
    {
        "message_id": 1873,
        "passage": "Darth Vader strides through the room as two stormtroopers\n      prepare an elaborate torture mechanism. Han is strapped to\n      a rack which tilts forward onto the torture device. Vader\n      activates the mechanism, creating two bursts of sparks, one\n      of which strikes Han's face.\n\n      The door opens, and Vader leaves the torture room just as\n      Han screams a sharp, piercing cry of agony. Darth Vader\n      moves to the holding chamber, where Lando and Boba Fett\n      await him.\n\n208",
        "dictionary": {
            "stormtroopers": "armored guards",
            "Darth Vader": "dark lord",
            "torture mechanism": "interrogation device",
            "torture device": "pain inducer",
            "Boba Fett": "mercenary hunter"
        }
    },
    {
        "message_id": 1874,
        "passage": "LANDO\n                Lord Vader.\n\n                          VADER\n                    (to Fett)\n                You may take Captain Solo to Jabba\n                the Hut after I have Skywalker.\n\n      Han's screams filter through the torture room door.\n\n                          BOBA FETT\n                He's no good to me dead.\n\n                          VADER\n                He will not be permanently damaged.\n\n                          LANDO\n                Lord Vader, what about Leia and the\n                Wookiee?\n\n                          VADER\n                They must never again leave this\n                city.\n\n                          LANDO\n                That was never a condition of our\n                agreement, nor was giving Han to\n                this bounty hunter!\n\n                          VADER\n                Perhaps you think you're being\n                treated unfairly.\n\n                          LANDO\n                No.\n\n                          VADER\n                Good. It would be unfortunate if I\n                had to leave a garrison here.\n\n      Vader turns and sweeps into the elevator with Boba Fett.\n      Lando walks swiftly down another corridor, muttering to\n      himself.\n\n                          LANDO\n                This deal's getting worse all the\n                time.\n\n209",
        "dictionary": {
            "Jabba the Hut": "The Crime Lord",
            "Lord Vader": "Dark Lord",
            "Bounty hunter": "Mercenary",
            "Wookiee": "Alien Warrior",
            "Garrison": "Military Outpost"
        }
    },
    {
        "message_id": 1875,
        "passage": "Chewie now has a little more of Threepio back together. One\n      arm is connected, but the legs are yet to be attached.\n      There is one small problem, however. It seems the Wookiee\n      has managed to put the droid's head on backwards.\n\n                          THREEPIO\n                Oh, yes, that's very good. I like\n                that. Oh! Something's not right\n                because now I can't see. Wait.\n                Wait! Oh, my! what have you done?\n                I'm backwards, you stupid furball.\n                Only an overgrown mophead like you\n                would be stupid enough...\n\n      Threepio is cut off in mid-sentence as Chewie angrily\n      deactivates a circuit and the droid shuts down. The Wookiee\n      smells something and sits up. The door to the chamber\n      slides open and a ragged Han Solo is shoved into the room by\n      two stormtroopers. Barking his concern, the huge Wookiee\n      gives Han a big hug. Han is very pale, with dark circles\n      under his eyes.\n\n                          HAN\n                I feel terrible.\n\n      Chewie helps Han to a platform and then turns as the door\n      slides open revealing Leia. She, too, looks a little worse\n      for wear. The troopers push her into the cell, and the door\n      slides closed. She moves to Han, who is lying on the\n      platform, and kneels next to him, gently stroking his head.\n\n                          LEIA\n                Why are they doing this?\n\n                     HAN\n          They never even asked me any\n          questions.\n\nThe cell door slides open.   Lando and two of his guards\nenter.\n\n                    LEIA\n          Lando.\n\n                    HAN\n          Get out of here, Lando!\n\n                    LANDO\n          Shut up and listen! Vader has\n          agreed to turn Leia and Chewie over\n          to me.\n\n                    HAN\n          Over to you?\n\n                    LANDO\n          They'll have to stay here, but at\n          least they'll be safe.\n\n                    LEIA\n          What about Han?\n\n                    LANDO\n          Vader's giving him to the bounty\n          hunter.\n\n                    LEIA\n          Vader wants us all dead.\n\n                    LANDO\n          He doesn't want you at all. He's\n          after somebody called Skywalker.\n\n                    HAN\n          Luke?\n\n                    LANDO\n          Lord Vader has set a trap for him.\n\nLeia's mind is racing.\n\n                    LEIA\n          And we're the bait.\n\n                    LANDO\n          Well, he's on his way.\n\nHan's rage peaks.\n\n                           HAN\n                Perfect. You fixed us all pretty\n                good, didn't you?\n                    (spits it out)\n                My friend!\n\n      Han hauls off and punches Lando. The two friends are\n      instantly engaged in a frantic close-quarters fight. The\n      guards hit Han with their rifle butts and he flies across\n      the room. Chewie growls and starts for the guards. They\n      point their laser weapons at the giant Wookiee, but Lando\n      stops them.\n\n                          LANDO\n                Stop! I've done all I can. I'm\n                sorry I couldn't do better, but I\n                have my own problems.\n\n                          HAN\n                Yeah, you're a real hero.\n\n      Lando and the guards leave. Han wipes the blood from his\n      chin as Leia and Chewie help him up.\n\n                          LEIA\n                    (dabs at his wound)\n                You certainly have a way with\n                people.\n\n210",
        "dictionary": {
            "Wookiee": "Giant Primate",
            "Threepio": "Droid",
            "Chewie": "Wookiee",
            "Vader": "Dark Lord",
            "Skywalker": "Chosen One"
        }
    },
    {
        "message_id": 1876,
        "passage": "Four armor-suited stormtroopers stand at the ready in the\n      large chamber, which is filled with pipes and chemical\n      tanks. In the middle of the room is a round pit housing a\n      hydraulic platform. Darth Vader and Lando stand near the\n      platform.\n\n                          VADER\n                This facility is crude, but it\n                should be adequate to freeze\n                Skywalker for his journey to the\n                Emperor.\n\n      An Imperial soldier appears.\n\n                          IMPERIAL SOLDIER\n                Lord Vader, ship approaching. X-\n                wing class.\n\n                          VADER\n                Good. Monitor Skywalker and allow\n                him to land.\n\n      The soldier bows and leaves the chamber.\n\n                           LANDO\n                 Lord Vader, we only use this\n                 facility for carbon freezing. If\n                 you put him in there, it might kill\n                 him.\n\n                           VADER\n                 I do not want the Emperor's prize\n                 damaged. We will test it... on\n                 Captain Solo.\n\n      Lando's face registers dismay.\n\n211",
        "dictionary": {
            "X-wing class": "fighter squadron",
            "carbon freezing": "cryogenic preservation"
        }
    },
    {
        "message_id": 1877,
        "passage": "Luke's X-wing moves through the clouds as it nears the city.\n\n212",
        "dictionary": {
            "X-wing": "fighter jet",
            "nears the city": "approaches the metropolis"
        }
    },
    {
        "message_id": 1878,
        "passage": "Encountering no city guards, Luke scans the display panel\n      with concern.\n\n213",
        "dictionary": {
            "display panel": "control center"
        }
    },
    {
        "message_id": 1879,
        "passage": "There is a great activity on the carbon-freezing platform.\n      Six Ugnaughts frantically prepare the chamber for use. A\n      special coffinlike container is put in place. With Boba\n      Fett in the lead, a squad of six stormtroopers brings in\n      Han, Leia and Chewie. Strapped to Chewie's back, with only\n      his head, torso, and one arm assembled, is Threepio.\n      Threepio's head faces the opposite direction from Chewie's\n      and the droid is constantly twisting around in a vain effort\n      to see what is happening. His one attached arm is animate\n      and expressive, intermittently pointing, gesturing, and\n      covering his eyes. The remaining pieces of his body are\n      randomly bundled to the Wookiee's back so that his legs and\n      other arm stick out at odd angles from the pack.\n\n                           THREEPIO\n                 If only you had attached my legs, I\n                 wouldn't be in this ridiculous\n                 position. Now, remember,\n                 Chewbacca, you have a\n                 responsibility to me, so don't do\n                 anything foolish.\n\n                           HAN\n                     (to Lando)\n                 What's going on... buddy?\n\n                           LANDO\n                 You're being put into carbon\n                 freeze.\n\nBoba Fett moves away from the group to Darth Vader.\n\n                    BOBA FETT\n          What if he doesn't survive?     He's\n          worth a lot to me.\n\n                    VADER\n          The Empire will compensate you if\n          he dies. Put him in!\n\nRealizing what is about to happen, Chewie lets out a wild\nhowl and attacks the stormtroopers surrounding Han. Within\nseconds, other Imperial reinforcements join the scuffle,\nclubbing the giant Wookiee with their laser weapons.\n\nFrom the instant of Chewie's first move, Threepio begins to\nscream in panic while he tries to protect himself with his\none arm.\n\n                    THREEPIO\n          Oh, no! No, no, no!     Stop,\n          Chewbacca, stop...!\n\nThe stormtroopers are about to bash Chewie in the face.\n\n                    HAN\n          Stop, Chewie, stop!    Do you hear\n          me? Stop!\n\n                    THREEPIO\n          Yes, stop, please!    I'm not ready\n          to die.\n\nHan breaks away from his captors. Vader nods to the guards\nto let him go and the pirate breaks up the fight.\n\n                   HAN\n          Chewie! Chewie, this won't help\n          me. Hey!\n\nHan gives the Wookiee a stern look.\n\n                    HAN (CONT’D)\n          Save your strength. There'll be\n          another time. The princess - you\n          have to take care of her. You hear\n          me?\n\nHan winks at the Wookiee, who wails a doleful farewell.\n\nIn a flash the guards have slipped binders on Chewbacca, who\nis too distraught to protest. Han turns to Princess Leia.\nThey look sorrowfully at one another, then Han moves toward\nher and gives her a final, passionate kiss.\n\n                    LEIA\n          I love you!\n\n                    HAN\n          I know.\n\nTears roll down Leia's face as she watches the dashing\npirate walk to the hydraulic platform. Han looks one final\ntime at his friends - and then, suddenly, the platform\ndrops. Chewie howls. Leia turns away in agony.\n\nLando winces in sorrow; it makes a life-changing impression\non him.\n\nInstantly, fiery liquid begins to pour down in a shower of\nsparks and fluid as great as any steel furnace. Holding\nLeia, Chewie half-turns away from the sight, giving Threepio\na view of the procedure.\n\n                    THREEPIO\n          What... what's going on? Turn\n          round, Chewbacca, I can't see.\n          Oh... they've encased him in\n          carbonite. He should be quite well-\n          protected - if he survives the\n          freezing process, that is.\n\nChewie is in no mood for technical discussion; he gives the\ndroid an angry glance and bark.\n\nA huge mechanical tong lifts the steaming metal-encased\nspace pirate out of the vat and stands him on the platform.\nSome Ugnaughts rush over and push the block over onto the\nplatform. They slide the coffinlike structure to the block\nand lift the metal block, placing it inside. They then\nattach an electronic box onto the structure and step away.\nLando kneels and adjusts some knobs, measuring the heat. He\nshakes his head in relief.\n\n                    VADER\n          Well, Calrissian, did he survive?\n\n                    LANDO\n          Yes, he's alive.   And in perfect\n          hibernation.\n\nVader turns to Boba Fett.\n\n                    VADER\n          He's all yours bounty hunter. Reset\n          the chamber for Skywalker.\n\n                    IMPERIAL OFFICER\n          Skywalker has just landed, my lord.\n\n                          VADER\n                Good. See to it that he finds his\n                way here. Calrissian, take the\n                princess and the Wookiee to my\n                ship.\n\n                          LANDO\n                You said they'd be left in the city\n                under my supervision.\n\n                          VADER\n                I am altering the deal. Pray I\n                don't alter it any further.\n\n      Lando's hand instinctively goes to his throat as he turns to\n      Leia, Chewie, and Threepio.\n\n214",
        "dictionary": {
            "carbon-freezing": "cryogenic freezing",
            "Ugnaughts": " Imperial technicians",
            "carbonite": "cryogenic material",
            "Threepio": "R2-D2",
            "Boba Fett": "Imperial bounty hunter",
            "Darth Vader": "Imperial Lord",
            "Imperial reinforcements": "stormtrooper backup"
        }
    }
]