[
    {
        "message_id": 1950,
        "passage": "The door slams shut with a loud crash that echoes throughout\n    the dark passageway. The frightened robots are met by two\n    giant, green GAMORREAN GUARDS, who fall in behind them.\n    Threepio glances quickly back at the two lumbering brutes,\n    then back to Artoo. One guard grunts an order. Artoo beeps\n    nervously.\n\n                        THREEPIO\n              Just you deliver Master Luke's\n              message and get us out of here. Oh\n              my! Oh! Oh, no.\n\n    Walking toward them out of the darkness is BIB FORTUNA, a\n    humanlike alien with long tentacles protruding from his\n    skull.\n\n                        BIB\n              Die Wanna Wanga!\n\n                        THREEPIO\n              Oh, my! Die Wanna Wauaga. We -- we\n              bring a message to your master,\n              Jabba the Hutt.\n\n    Artoo lets out a series of quick beeps.\n\n                        THREEPIO   (CONT) (CONT’D)\n              ...and a gift.\n                  (thinks a moment, then to\n                   Artoo)\n              Gift, what gift?\n\n    Bib shakes his head negatively.\n\n                        BIB\n              Nee Jabba no badda. Me chaade su\n              goodie.\n\n    Bib holds out his hand toward Artoo and the tiny droid backs\n    up a bit, letting out a protesting array of squeaks. Threepio\n    turns to the strange-looking alien.\n\n                        THREEPIO\n              He says that our instructions are\n              to give it only to Jabba himself.\n\n    Bib thinks about this for a moment.\n\n                         THREEPIO (CONT’D)\n              I'm terribly sorry. I'm afraid he's\n              ever so stubborn about these sort\n              of things.\n\n    Bib gestures for the droids to follow.\n\n                           BIB\n              Nudd Chaa.\n\n    The droids follow the tall, tentacled alien into the\n    darkness, trailed by the two guards.\n\n                        THREEPIO\n              Artoo, I have a bad feeling about\n              this.\n\n8",
        "dictionary": {
            "GAMORREAN GUARDS": "Security Forces",
            "Jabba the Hutt": "Lord of the Palace",
            "Die Wanna Wanga": "Let's Go",
            "Die Wanna Wauaga": "Let's Go",
            "Bib Fortuna": "Ambassador Zorvath"
        }
    },
    {
        "message_id": 1951,
        "passage": "The throne room is filled with the vilest, most grotesque\n    CREATURES ever conceived in the universe. Artoo and Threepio\n    seem very small as they pause in the doorway to the dimly lit\n    chamber. Light shafts partially illuminate the drunken\n    courtiers as Bib Fortuna crosses the room to the platform\n    upon which rests the leader of this nauseating crowd: JABBA\n    THE HUTT. The monarch of the galactic underworld is a\n    repulsive blob of bloated fat with a maniacal grin. Chained\n    to the horrible creature is the beautiful alien female dancer\n    named OOLA. At the foot of the dais sits an obnoxious\n    birdlike creature, SALACIOUS CRUMB. Bib whispers something in\n    the slobbering degenerate's ear. Jabba laughs horribly, at\n    the two terrified droids before him. Threepio bows politely.\n\n                        THREEPIO\n              Good morning.\n\n                           JABBA\n              Bo Shuda!\n\n    The robots jump forward to stand before the repulsive, loose-\n    skinned villain.\n\n                        THREEPIO\n              The message, Artoo, the message.\n\n    Artoo whistles, and a beam of light projects from his domed\n    head, creating a hologram of LUKE on the floor. The image\n    grows to over ten feet tall, and the young Jedi towers over\n    the space gangsters.\n\n                        LUKE\n              Greetings, Exalted One. Allow me to\n              introduce myself.\n                        (MORE)\n\n                    LUKE (CONT'D)\n          I am Luke Skywalker, Jedi Knight\n          and friend to Captain Solo. I know\n          that you are powerful, mighty\n          Jabba, and that your anger with\n          Solo must be equally powerful. I\n          seek an audience with Your\n          Greatness to bargain for Solo's\n          life.\n              (Jabba's crowd laughs)\n          With your wisdom, I'm sure that we\n          can work out an arrangement which\n          will be mutually beneficial and\n          enable us to avoid any unpleasant\n          confrontation. As a token of my\n          goodwill, I present to you a gift:\n          these two droids.\n\nThreepio is startled by this announcement.\n\n                    THREEPIO\n          What did he say?\n\n                    LUKE   (CONT)\n          ... Both are hardworking and will\n          serve you well.\n\n                    THREEPIO\n          This can't be! Artoo, you're\n          playing the wrong message.\n\nLuke's hologram disappears.\n\nJabba laughs while Bib speaks to him in Huttese.\n\n                    JABBA (IN HUTTESE SUBTITLED)\n          There will be no bargain.\n\n                    THREEPIO\n          We're doomed.\n\n                    JABBA (IN HUTTESE SUBTITLED)\n          I will not give up my favorite\n          decoration. I like Captain Solo\n          where he is.\n\nJabba laughs hideously and looks toward an alcove beside the\nthrone. Hanging high, flat against the wall, exactly as we\nsaw him last, is a carbonized HAN SOLO.\n\n                    THREEPIO\n          Artoo, look! Captain Solo. And he's\n          still frozen in carbonite.\n\n9",
        "dictionary": {
            "CREATURES": "monsters",
            "JABBA THE HUTT": "the monstrous ruler",
            "SALACIOUS CRUMB": "the obnoxious birdlike creature",
            "LUKE": "the young Jedi",
            "Jedi Knight": "a skilled warrior",
            "Captain Solo": "the prisoner",
            "HAN SOLO": "the frozen prisoner"
        }
    },
    {
        "message_id": 1952,
        "passage": "One of Jabba's Gamorrean guards marches Artoo and Threepio\n     down a dank, shadowy passageway lined with holding cells. The\n     cries of unspeakable creatures bounce off the cold stone\n     walls. Occasionally a repulsive arm or tentacle grabs through\n     the bars at the hapless droids. Artoo beeps pitifully.\n\n                         THREEPIO\n               What could possibly have come over\n               Master Luke. Is it something I did?\n               He never expressed any unhappiness\n               with my work. Oh! Oh! Hold it! Ohh!\n\n     A large tentacle wraps around Threepio's neck. He manages to\n     break free, and they move on to a door at the end of the\n     corridor.\n\n10",
        "dictionary": {
            "Jabba's Gamorrean guards": "Imperial Stormtroopers",
            "holding cells": "prison cells",
            "unspeakable creatures": "ferocious beasts",
            "Master Luke": "Captain Skywalker",
            "Threepio": "Tom"
        }
    },
    {
        "message_id": 1953,
        "passage": "The door slides open, revealing a room filled with steam and\n     noisy machinery. The guard motions them into the boiler room,\n     where they are met by a tall, thin humanlike robot named EV-\n     9D9. Behind the robot can be seen a torture rack pulling the\n     legs off a screaming baby work droid. A second power droid is\n     upside down. As smoking branding irons are pressed into his\n     feet, the stubby robot lets out an agonized electronic\n     scream. Artoo and Threepio cringe as the guard grunts to EV-\n\n                         NINEDENINE\n               Ah, good. New acquisitions. You are\n               a protocol droid, are you not?\n\n                         THREEPIO\n               I am See-Threepio, human-cy...\n\n                         NINEDENINE\n               Yes or no will do.\n\n                         THREEPIO\n               Oh. Well, yes.\n\n                         NINEDENINE\n               How many languages do you speak?\n\n                          THREEPIO\n               I am fluent in over six million\n               forms of communication, and can\n               readily...\n\n                         NINEDENINE\n               Splendid! We have been without an\n               interpreter since our master got\n               angry with our last protocol droid\n               and disintegrated him.\n\n                         THREEPIO\n               Disintegrated?\n\n                         NINEDENINE   (TO A GAMORREAN GUARD)\n               Guard! This protocol droid might be\n               useful. Fit him with a restraining\n               bolt and take him back to His\n               Excellency's main audience chamber.\n\n     The guard shoves Threepio toward the door.\n\n                         THREEPIO   (DISAPPEARING)\n               Artoo, don't leave me! Ohhh!\n\n     Artoo lets out a plaintive cry as the door closes. Then he\n     beeps angrily.\n\n                          NINEDENINE\n               You're a feisty little one, but\n               you'll soon learn some respect. I\n               have need for you on the master's\n               Sail Barge. And I think you'll fit\n               in nicely.\n\n     The poor work droid in the background lets out another\n     tortured electronic scream.\n\n11",
        "dictionary": {
            "protocol droid": "linguistic assistant",
            "restraining bolt": "security device",
            "His Excellency": "the leader",
            "Sail Barge": "luxury vessel"
        }
    },
    {
        "message_id": 1954,
        "passage": "The court of Jabba the Hutt is in the midst of a drunken,\n     raucous party. Sloppy, smelly monsters cheer and make rude\n     noises as Oola and a fat female dancer perform in front of\n     Jabba's throne.\n\n     Jabba leers at the dancers and with a lustful gleam in his\n     eye beckons Oola to come and sit with him. She stops dancing\n     and backs away, shaking her head. Jabba gets angry and points\n     to a spot next to him.\n\n                           JABBA\n               Da Eitha!\n\n     The lovely alien shakes her head again and screams.\n\n                          OOLA\n               Na Chuba negatorie Na! Na!\n               Natoota...\n\nJabba is furious and pulls her toward him, tugging on the\nchain.\n\n                    JABBA\n          Boscka!\n\nHe pushes a button and, before the dancer can flee, a trap\ndoor in the floor springs open and swallows her up. As the\ndoor snaps shut, a muffled growl is followed by a hideous\nscream. Jabba and his monstrous friends laugh hysterically\nand several revelers hurry over to watch her fate through a\ngrate.\n\nThreepio cringes and glances wistfully at the carbonite form\nof Han Solo, but is immediately distracted by a gunshot\noffscreen. An unnatural quiet sweeps the boisterous\ngathering. On the far side of the room, the crush of\ndebauchers moves aside to allow the approach of two guards\nfollowed by BOUSHH, an oddly cloaked bounty hunter, leading\nhis captive, Han Solo's copilot, CHEWBACCA THE WOOKIEE.\n\nBib takes his place next to his disgusting master, and\nwhispers into his ear, pointing at Chewbacca and the bounty\nhunter. Jabba listens intently, then the bounty hunter bows\nbefore the gangster and speaks a greeting in a strange,\nelectronically processed tongue (Ubese).\n\n                    BOUSHH   (IN UBESE SUBTITLED)\n          I have come for the bounty on this\n          Wookiee.\n\n                    THREEPIO\n          Oh, no! Chewbacca!\n\n                     JABBA (IN HUTTESE SUBTITLED)\n          At last we have the mighty\n          Chewbacca.\n\nJabba lets out a loud, long, blood-curdling laugh and turns\nto Threepio, waving him closer. The reluctant droid obeys.\n\n                    THREEPIO\n          Oh, uh, yes, uh, I am here, Your\n          Worshipfulness. Uh... yes!\n\nJabba continues speaking, as Threepio nervously translates.\nBoushh listens, studying the dangerous creatures around the\nroom. He notices BOBA FETT standing near the door.\n\n                    THREEPIO (CONT’D)\n          Oh. The illustrious Jabba bids you\n          welcome and will gladly pay you the\n          reward of twenty-five thousand.\n\n                    BOUSHH   (IN UBESE SUBTITLED)\n          I want fifty thousand. No less.\n\nJabba immediately flies into a rage, knocking the golden\ndroid off the raised throne into a clattering heap on the\nfloor. Boushh adjusts his weapon as Jabba raves in Huttese\nand Threepio struggles back onto the throne. The disheveled\ndroid tries to compose himself.\n\n                    THREEPIO\n          Uh, oh... but what, what did I say?\n              (to Boushh)\n          Uh, the mighty Jabba asks why he\n          must pay fifty thousand.\n\nThe bounty hunter holds up a small silver ball in his hand.\nThreepio looks at it, then looks at Jabba, then back to the\nbounty hunter. The droid is very nervous and Jabba is getting\nvery impatient.\n\n                     THREEPIO (CONT’D)\n          Because he's holding a thermal\n          detonator.\n\nThe guards instantly back away, as do most of the other\nmonsters in the room. Jabba stares at the silver ball, which\nbegins to glow in the bounty hunter's hand. The room has\nfallen into a tense hush. Jabba stares at the bounty hunter\nmalevolently until a sly grin creeps across his vast mouth\nand he begins to laugh.\n\n                    JABBA (IN HUTTESE SUBTITLED)\n          This bounty hunter is my kind of\n          scum. Fearless and inventive.\n\nJabba continues.\n\n                    THREEPIO\n          Jabba offers the sum of thirty-\n          five. And I suggest you take it.\n\nBib and the other monsters study the bounty hunter and wait\nfor his reaction. Boushh releases a switch on the thermal\ndetonator and it goes dead.\n\n                       BOUSHH\n          Zeebuss.\n\n                       THREEPIO\n          He agrees!\n\nThe raucous crowd of monsters erupts in a symphony of cheers\nand applause as the party returns to its full noisy pitch.\nChewbacca growls.\n\n     As he is led away we spot LANDO CALRISSIAN, disguised as a\n     skiff guard in a partial face mask. The band starts up and\n     dancing girls take the center of the floor, to the hoots of\n     the loudly appreciative creatures.\n\n     Boushh leans against a column with gunfighter cool and\n     surveys the scene, his gaze stopping only when it connects\n     with a glare from across the room. Boba Fett is watching him.\n     Boushh shifts slightly, cradling his weapon lovingly. Boba\n     Fett shifts with equally ominous arrogance.\n\n12",
        "dictionary": {
            "Jabba the Hutt": "Powerful crime lord",
            "Ubese": "Unknown language",
            "Huttese": "Alien language",
            "Threepio": "C-3PO",
            "Boushh": "Boba Fett",
            "Jabba's throne": "The gangster's seat",
            "Da Eitha!": "Come here!",
            "Na Chuba negatorie Na! Na!": "No! No!",
            "Natoota...": "Not that!",
            "Boscka!": "Get away!",
            "Zeebuss": "Agreed",
            "Jabba's kind of scum": "The type of scum I like"
        }
    },
    {
        "message_id": 1955,
        "passage": "Gamorrean guards lead Chewie down the same hallway we saw\n     before. When a tentacle reaches out at the Wookiee, Chewie's\n     ferocious ROAR echoes against the walls and the tentacle\n     snaps back into its cell in terror. It takes all the guards\n     to hurl Chewie roughly into a cell, slamming the door behind\n     him. Chewie lets out a pathetic howl and bangs on the iron\n     door.\n\n13",
        "dictionary": {
            "ROAR": "thunderous cry",
            "Wookiee": "ape-like alien"
        }
    },
    {
        "message_id": 1956,
        "passage": "The palace is sitting in the light of the double sunset. On\n     the road in front, a large toadlike creature flicks its\n     tongue out for a desert rodent and burps in satisfaction.\n\n14",
        "dictionary": {
            "": ""
        }
    },
    {
        "message_id": 1957,
        "passage": "Silence. The room is deserted, only the awful debris of the\n     alien celebration giving mute witness to the activity here\n     before. Several drunk creatures lie unconscious around the\n     room, snoring loudly.\n\n     A shadowy figure moves stealthily among the columns at the\n     perimeter of the room and is revealed to be Boushh, the\n     bounty hunter. He picks his way carefully through the\n     snoring, drunken monsters.\n\n     Han Solo, the frozen space pirate, hangs spotlighted on the\n     wall, his coffin-like case suspended by a force field. The\n     bounty hunter deactivates the force field by flipping a\n     control switch to one side of the coffin. The heavy case\n     slowly lowers to the floor of the alcove.\n\n     Boushh steps up to the case, studying Han, and then turns to\n     the controls on the side of the coffin. He activates a series\n     of switches and, after one last hesitant look at Han, slides\n     the de-carbonization lever. The case begins to emit a sound\n     as the hard shell covering the contours of Han's face begins\n     to melt away.\n\nThe bounty hunter watches as Han's body is freed of its\nmetallic coat and his forearms and hands, previously raised\nin reflexive protest, drop slackly to his side. His face\nmuscles relax from their mask of horror. He appears quite\ndead.\n\nBoushh's ugly helmet leans close to Han's face listening for\nthe breath of life. Nothing. He waits. Han's eyes pop open\nwith a start and he begins coughing. The bounty hunter\nsteadies the staggering newborn.\n\n                    BOUSHH\n          Just relax for a moment. You're\n          free of the carbonite.\n\nHan touches his face with his hand and moans.\n\n                    BOUSHH (CONT’D)\n          Shhh. You have hibernation\n          sickness.\n\n                    HAN\n          I can't see.\n\n                    BOUSHH\n          Your eyesight will return in time.\n\n                    HAN\n          Where am I?\n\n                    BOUSHH\n          Jabba's palace.\n\n                    HAN\n          Who are you?\n\nThe bounty hunter reaches up and lifts the helmet from his\nhead, revealing the beautiful face of PRINCESS LEIA.\n\n                    LEIA\n          Someone who loves you.\n\n                    HAN\n          Leia!\n\n                    LEIA\n          I gotta get you out of here.\n\nAs Leia helps her weakened lover to stand up, the relative\nquiet is pierced by an obscene HUTTESE CACKLE from the other\nside of the alcove.\n\n                    HAN\n          What's that? I know that laugh.\n\nThe curtain on the far side of the alcove opens, revealing\nJabba the Hutt, surrounded by Bib and other aliens. He laughs\nagain, and his gross cronies join in a cacophony of alien\nglee.\n\n                    HAN (CONT’D)\n          Hey, Jabba. Look, Jabba, I was just\n          on my way to pay you back, but I\n          got a little sidetracked. It's not\n          my fault.\n\nJabba laughs.\n\n                    JABBA (IN HUTTESE SUBTITLED)\n          It's too late for that, Solo. You\n          may have been a good smuggler, but\n          now you're Bantha fodder.\n\n                      HAN\n          Look...\n\n                    JABBA     (CONT HUTTESE SUBTITLED)\n          Take him away!\n\nThe guards grab Han and start to lead him away.\n\n                    HAN\n          Jabba... I'll pay you triple!\n          You're throwing away a fortune\n          here. Don't be a fool!\n\nHan is dragged off, as Lando quickly moves forward and\nattempts to lead Leia away.\n\n                    JABBA (IN HUTTESE SUBTITLED)\n          Bring her to me.\n\nJabba chuckles as Lando and a second guard drag the beautiful\nyoung princess toward him. Threepio peeks from behind a\nmonster and quickly turns away in disgust.\n\n                    LEIA\n          We have powerful friends. You're\n          gonna regret this...\n\n                      JABBA   (IN HUTTESE SUBTITLED)\n          I'm sure.\n\nInexorably her lovely face moves to within a few inches of\nJabba's ugly blob of a head, and Leia turns away in disgust.\n\n                      LEIA\n          Ugh!\n\n                         THREEPIO\n               Ohhh, I can't bear to watch.\n\n15",
        "dictionary": {
            "Bantha fodder": "Useless prisoner",
            "Huttese": "Alien dialect",
            "Jabba the Hutt": "The Fat Alien",
            "Carbonite": "Deep Freeze",
            "Hibernation sickness": "Recovery from deep freeze",
            "Jabba's palace": "The Alien's Lair",
            "Bounty hunter": "Alien Tracker"
        }
    },
    {
        "message_id": 1958,
        "passage": "The heavy metal door of the dungeon whines and slowly creaks\n     open. A guard throws the blinded star captain into the dark\n     cell and the door slams shut behind him, leaving only a thin\n     sliver of light from a crack in the door. Han is trying to\n     collect himself when suddenly a growl is heard from the far\n     side of the cell. He jumps back against the cell door and\n     listens.\n\n                         HAN\n               Chewie? Chewie, is that you?\n\n     The shadowy figure lets out a crazy yell and races toward\n     Han, lifting him off the ground with a big hug that carries\n     them into the light, revealing Chewie.\n\n                         HAN (CONT’D)\n               Ah! Chew--Chewie!\n\n     The giant Wookiee barks with glee.\n\n                         HAN (CONT’D)\n               Wait. I can't see, pal. What's\n               goin' on?\n\n     Chewie barks an excited blue streak.\n\n                         HAN (CONT’D)\n               Luke? Luke's crazy. He can't even\n               take care of himself, much less\n               rescue anybody.\n\n     Chewie barks a reply.\n\n                         HAN (CONT’D)\n               A...Jedi Knight? I--I'm out of it\n               for a little while, everybody gets\n               delusions of grandeur.\n\n     Chewie growls insistently. He holds Han to his chest and pets\n     his head.\n\n                         HAN (CONT’D)\n               I'm all right, pal. I'm all right.\n\n16",
        "dictionary": {
            "Wookiee": "Giant Ape",
            "Jedi Knight": "Mystic Warrior"
        }
    },
    {
        "message_id": 1959,
        "passage": "Noisily, the main gate lifts to flood the blackness with\n     blinding LIGHT and reveal the silhouetted figure of LUKE\n     SKYWALKER.\n\n     He is clad in a robe similar to Ben's and wears neither\n     pistol nor laser sword. Luke strides purposefully into the\n     hallway. Two giant guards move to block Luke's path. Luke\n     halts.\n\n     Luke raises his hand and points at the puzzled guards, who\n     immediately lower their spears and fall back. The young Jedi\n     lowers his hand and moves on down the hallway.\n\n     Bib Fortuna appears out of the gloom. He speaks to Luke as\n     they approach each other, but Luke doesn't stop and Bib must\n     reverse his direction and hurry alongside the young Jedi in\n     order to carry on the conversation. Several other guards fall\n     in behind them in the darkness.\n\n                         LUKE\n               I must speak with Jabba.\n\n     Bib answers in Huttese, shaking his head in denial. Luke\n     stops and stares at Bib; he raises his hand slightly.\n\n                         LUKE (CONT’D)\n               You will take me to Jabba now!\n\n     Bib turns in hypnotic response to Luke's command, and Luke\n     follows him into the gloom.\n\n                         LUKE (CONT’D)\n               You serve your master well.\n\n     Bib responds.\n\n                         LUKE (CONT’D)\n               And you will be rewarded.\n\n17",
        "dictionary": {
            "LUKE SKYWALKER": "The Young Hero",
            "Jedi": "Warrior Monk",
            "Huttese": "Alien Language",
            "Jabba": "The Hutt",
            "Bib Fortuna": "The Hutt's Servant"
        }
    }
]