[
    {
        "message_id": 1570,
        "passage": "POLIS MEDICS work, on PADME in an operating theater. OBI-WAN and one of the MEDICAL DROIDS enter an observation room where BAIL and YODA are waiting. \n\nMEDICAL DROID: Medically, she is completely healthy. For reasons we can't explain, we are losing her. \n\nOBI-WAN: She's dying? \n\nMEDICAL DROID: We don't know why. She has lost the will to live. We need to operate quickly if we are to save the babies. \n\nBAIL ORGANA: Babies??!! \n\nMEDICAL DROID: She's carrying twins. \n\nYODA: Save them, we must. They are our last hope. \n\nThe MEDICAL DROID rushes back to the operating room. ARTOO and THREEPIO watch, greatly puzzled. ARTOO BEEPS. \n\nC-3PO: It s some kind of reproductive process, I think. \n\n227",
        "dictionary": {
            "PADME": "The Patient",
            "MEDICAL DROIDS": "Medical Assistants",
            "BAIL ORGANA": "The Patient's Husband",
            "ARTOO": "The Droid",
            "THREEPIO": "The Protocol Droid"
        }
    },
    {
        "message_id": 1571,
        "passage": "ANAKIN, in the medical capsule, is lifted onto a table in the Rehab Center. DROIDS go to work on him. ANAKIN has new legs and a new arm. \n\n228",
        "dictionary": {
            "ANAKIN": "Alex",
            "DROIDS": "robots"
        }
    },
    {
        "message_id": 1572,
        "passage": "The TWINS are being delivered as BAIL ORGANA, YODA, ARTOO, and THREEPIO watch. OBI-WAN is in the operating theater with PADME. He takes her hand. \n\nOBI-WAN: Don't give up, Padme. \n\nPADME winces from the pain. The MEDICAL DROID is holding the BABY. \n\nMEDICAL DROID: It's a boy. \n\nPADME: Luke . . . \n\nPADME can only offer up a faint smile. She struggles to touch the baby on the forehead. \n\nMEDICAL DROID: ... and a girl. \n\nPADME: . . . Leia. \n\nR2-D2, THREEPIO and BAIL ORGANA watch from an adjoining space. \n\n229",
        "dictionary": {
            "BAIL ORGANA": "High-Stakes Guarantor",
            "YODA": "Wise Mentor",
            "ARTOO": "Loyal Droid",
            "THREEPIO": "Chatty Translator",
            "OBI-WAN": "Experienced Guardian",
            "PADME": "Expectant Mother",
            "MEDICAL DROID": "Skilled Healer",
            "R2-D2": "Resourceful Assistant"
        }
    },
    {
        "message_id": 1573,
        "passage": "VADER, dressed in his black body armor, lies on the table. Nose plugs are inserted and the mask drops from above, sealing tightly. The helmet is fitted and VADER begins breathing. \n\n230",
        "dictionary": {
            "VADER": "Dark Lord"
        }
    },
    {
        "message_id": 1574,
        "passage": "OBI WAN leans over PADME and softly speaks to her. \n\nOBI-WAN: You have twins, Padme They need you . . . hang on. \n\nPADME: I can't . . . \n\nPADME winces again and takes OBI-WAN's hand. She is holding Anakin's japor snippet. \n\nOBI-WAN: Save your energy. \n\nPADME: Obi-Wan . . . there . . . is good in him. I know there is ... still . . . \n\nA last gasp, and she dies. Obi-Wan studies the necklace. \n\n231",
        "dictionary": {
            "OBI-WAN": "Old Ben",
            "Japor snippet": "Personal token"
        }
    },
    {
        "message_id": 1575,
        "passage": "DARTH SIDIOUS hovers around the periphery of a group of MEDICAL DROIDS who are working on ANAKIN. DARTH SIDIOUS paces in the foreground. A DROID approaches the Dark Lord. \n\nMEDICAL DROID: My Lord, the construction is finished ... he lives. \n\nDARTH SIDIOUS: Good. Good. \n\nThe DROID moves back to the table where DARTH VADER lies. The table begins to move upright. DARTH SIDIOUS moves in next to DARTH VADER. \n\nDARTH SIDIOUS: (continuing) Lord Vader, can you hear me? \n\nDARTH VADER, with his dark mask and helmet, moves up into the frame until he is in a CLOSEUP. \n\nDARTH VADER: Yes, My Master. \n\nDARTH VADER looks around the room. \n\nDARTH VADER: (continuing) Where is Padme? Is she safe, is she all right? \n\nDARTH SIDIOUS moves closer to the half droid/half man. \n\nDARTH SIDIOUS: I'm afraid she died. ... it seems in your anger, you killed her. \n\nA LOW GROAN emanates from Vader's mask. Suddenly everything in the room begins to implode, including some of the DROIDS. \n\nDARTH VADER: I couldn't have! She was alive! I felt her! She was alive! It's impossible! No!!! \n\nVADER SCREAMS, breaks his bonds to the table, and steps forward, waving his hands, causing objects to fly around the room. SIDIOUS deflects the objects, but some of the DROIDS aren't so lucky. VADER'S PAINFUL SCREAMS echo throughout the Center. \n\n232",
        "dictionary": {
            "DARTH SIDIOUS": "Dark Lord",
            "MEDICAL DROIDS": "Medical Assistants",
            "ANAKIN": "Patient",
            "DARTH VADER": "Lord Vader",
            "PADME": "Patient's Wife"
        }
    },
    {
        "message_id": 1576,
        "passage": "BAIL ORGANA's Starcruiser approaches the city of Theed. \n\n233",
        "dictionary": {
            "Starcruiser": "Spacecraft",
            "Theed": "Capital City"
        }
    },
    {
        "message_id": 1577,
        "passage": "BAIL ORGANA, YODA, and OBI-WAN sit around a conference table. \n\nYODA: Pregnant, she must still appear. Hidden, safe, the children must be kept. \n\nOBI-WAN: We must take them somewhere the Sith will not sense their presence. \n\nYODA: Split up, they should be. \n\nBAIL ORGANA: My wife and I will take the girl. We've always talked of adopting a baby girl. She will be loved with us. \n\nOBI-WAN: And what of the boy? \n\nYODA: To Tatooine. To his family, send him. \n\nOBI-WAN: I will take the child and watch over him. Master Yoda, do you think Anakin's twins will be able to defeat Darth Sidious? \n\nYODA: Strong the Force runs, in the Skywalker line. Hope, we can . . . Done, it is. Until the time is right, disappear we will. \n\nBAIL leaves the conference room. YODA stops OBI-WAN. \n\nYODA: (continuing) Master Kenobi, wait a moment. In your solitude on Tatooine, training I have for you. \n\nOBI-WAN: Training?? \n\nYODA: An old friend has learned the path to immortality. \n\nOBI-WAN: Who? \n\nYODA: One who has returned from the netherworld of the Force to train me . . . your old Master, Qui-Gon Jinn. \n\nOBI-WAN: Qui-Gon? But, how could he accomplish this? \n\nYODA: The secret of the Ancient Order of the Whills, he studied. How to commune with him. I will teach you. \n\nOBI-WAN: I will be able to talk with him? \n\nYODA: How to join the Force, he will train you. Your consciousness you will retain, when one with the Force. Even your physical self, perhaps. \n\n234",
        "dictionary": {
            "Tatooine": "a distant desert planet",
            "Sith": "dark side warriors",
            "Whills": "ancient mystics",
            "Netherworld": "the afterlife"
        }
    },
    {
        "message_id": 1578,
        "passage": "BAIL ORGANA, followed by ARTOO and THREEPIO, approaches CAPTAIN ANTILLES and TWO CREW MEMBERS. \n\nBAIL ORGANA: Captain Antilles. \n\nCAPTAIN ANTILLES: Yes, Your Highness. \n\nBAIL ORGANA: I'm placing these droids in your care. Treat them well. Clean them up. Have the Protocol Droid's mind wiped. \n\nC-3PO: Oh, no. \n\n235",
        "dictionary": {
            "Your Highness": "Your Excellency",
            "Protocol Droid's": "Advanced Android's"
        }
    },
    {
        "message_id": 1579,
        "passage": "SIO BIBBLE walks with other MOURNERS. \nLARGE CROWDS line the street as a flowered, covered coffin is drawn by SIX BEAUTIFUL WHITE BEASTS. SOLDIERS AND FAMILY \nATO DIGNITARIES follow the casket. \nPADME's hand clutches the japor snippet. \n\n236",
        "dictionary": {
            "SIO BIBBLE": "High Official",
            "MOURNERS": "Mourners",
            "Japor snippet": "Family heirloom"
        }
    }
]