[
    {
        "message_id": 2060,
        "passage": "The two armadas, like their sea-bound ancestors, blast away\n      at each other in individual point-blank confrontations. A\n      Star Destroyer explodes. The Rebel victor limps away, its\n      back half alive with a series of minor explosions. The Rebel\n      cruiser manages to move in next to a second Star Destroyer\n      before it explodes completely, taking the Imperial Star\n      Destroyer with it. The Falcon and several fighters attack one\n      of the larger Imperial ships.\n\n                          LANDO\n                Watch out. Squad at .06.\n\n                          REBEL PILOT\n                I'm on it, Gold Leader.\n\n                          WEDGE\n                Good shot, Red Two.\n\n                          LANDO\n                Now...come on, Han, old buddy.\n                Don't let me down.\n\n119",
        "dictionary": {
            "Star Destroyer": "Warship",
            "Rebel": "Resistance",
            "Imperial": "Enemy"
        }
    },
    {
        "message_id": 2061,
        "passage": "Controllers watch the main viewscreen on which a vague figure\n      of an Imperial walker pilot can be seen. There is a great\n      deal of static and interference.\n\n                          HAN/PILOT (VO)\n                It's over, Commander. The Rebels\n                have been routed. They're fleeing\n                into the woods. We\n\n      need reinforcements to continue the pursuit.\n\n      The controllers cheer.\n\n      CONTROL ROOM COMMANDER\n\n      Send three squads to help. Open the back door.\n\n                            SECOND COMMANDER\n                Yes, sir.\n\n120",
        "dictionary": {
            "Rebels": "Insurgents",
            "Imperial": "Federal"
        }
    },
    {
        "message_id": 2062,
        "passage": "As the door to the bunker opens and the Imperial troops rush\n      out, they're surprised to find themselves surrounded by\n      Rebels, their weapons pointed at them. Ewoks holding bows and\n      arrows appear on the roof of the bunker. The Imperial troops\n      throw down their guns as Han and Chewie rush inside the\n      bunker with explosive charges.\n\n121",
        "dictionary": {
            "Ewoks": "Tribal warriors",
            "Imperial troops": "Government soldiers"
        }
    },
    {
        "message_id": 2063,
        "passage": "Han, Chewie, and several troops rush into the control room\n      and plant explosive charges on the control panels and rush\n      out.\n\n                          HAN\n                Throw me another charge.\n\n122",
        "dictionary": {
            "Han": "Captain",
            "Chewie": "Loyal Companion"
        }
    },
    {
        "message_id": 2064,
        "passage": "Vader stalks the low-ceilinged area on the level below the\n      throne, searching for Luke in the semi-darkness, his\n      lightsaber held ready.\n\n                    VADER\n          You cannot hide forever, Luke.\n\n                    LUKE\n          I will not fight you.\n\n                    VADER\n          Give yourself to the dark side. It\n          is the only way you can save your\n          friends. Yes, your\n\nthoughts betray you. Your feelings for them are strong.\nEspecially for...\n\nVader stops and senses something. Luke shuts his eyes\ntightly, in anguish.\n\n                    VADER (CONT’D)\n          Sister! So...you have a twin\n          sister. Your feelings have now\n          betrayed her, too. Obi-Wan\n\nwas wise to hide her from me. Now his failure is complete. If\nyou will not turn to the dark side, then perhaps she will.\n\n                       LUKE\n          Never-r-r!\n\nLuke ignites his lightsaber and screams in anger, rushing at\nhisfather with a frenzy we have not seen before. Sparks fly\nas Luke and Vader fight in the cramped area. Luke's hatred\nforces Vader to retreat out of the low area and across a\nbridge overlooking a vast elevator shaft. Each stroke of\nLuke's sword drives his father further toward defeat.\n\nThe Dark Lord is knocked to his knees, and as he raises his\nsword to block another onslaught, Luke slashes Vader's right\nhand off at the wrist, causing metal and electronic parts to\nfly from the mechanical stump. Vader's sword clatters\nuselessly away, over the edge of the platform and into the\nbottomless shaft below. Luke moves over Vader and holds the\nblade of his sword to the Dark Lord's throat. The Emperor\nwatches with uncontrollable, pleased agitation.\n\n                    EMPEROR\n          Good! Your hate has made you\n          powerful. Now, fulfill your destiny\n          and take your father's\n\nplace at my side!\n\nLuke looks at his father's mechanical hand, then to his own\nmechanical, black-gloved hand, and realizes how much he is\nbecoming like his father.\n\n      He makes the decision for which he has spent a lifetime in\n      preparation. Luke steps back and hurls his lightsaber away.\n\n                          LUKE\n                Never! I'll never turn to the dark\n                side. You've failed, Your Highness.\n                I am a Jedi,\n\n      like my father before me.\n\n      The Emperor's glee turns to rage.\n\n                          EMPEROR\n                So be it...Jedi.\n\n123",
        "dictionary": {
            "lightsaber": "energy blade",
            "Jedi": "guardian"
        }
    },
    {
        "message_id": 2065,
        "passage": "Han and several of the fighters run out of the bunker and\n      race across the clearing.\n\n                          HAN\n                Move! Move!\n\n      A shock wave knocks them flat as the bunker explodes,\n      followed by a spectacular display as the huge shield-\n      generator radar dish explodes along with the bunker.\n\n124",
        "dictionary": {
            "Han": "Captain",
            "shield-generator radar dish": "large antenna"
        }
    },
    {
        "message_id": 2066,
        "passage": "Ackbar, sitting in his control chair, speaks into the radio.\n\n                          ACKBAR\n                The shield is down! Commence attack\n                on theDeath Star's main reactor.\n\n                          LANDO\n                We're on our way. Red Group, Gold\n                Group, all fighters follow me.\n                    (laughs)\n                Told you they'd do it!\n\n      The Falcon, followed by several smaller Rebel fighters, heads\n      toward the unfinished superstructure of the Death Star.\n\n125",
        "dictionary": {
            "Death Star": "Imperial Space Station",
            "Rebel fighters": "Insurgent Squadrons",
            "Ackbar": "Admiral Thompson",
            "LANDO": "Captain Jackson"
        }
    },
    {
        "message_id": 2067,
        "passage": "Luke stands still, as the Emperor reaches the bottom of\n      thestairs. The Emperor's laughter has turned to anger. He\n      raises his arms toward Luke.\n\n                          EMPEROR\n                If you will not be turned, you will\n                be destroyed.\n\nBlinding bolts of energy, evil lightning, shoot from the\nEmperor's hands at Luke. Even in his surprise, the young Jedi\ntries to use the Force to deflect them. At first he is half\nsuccessful, but after a moment the bolts of energy are coming\nwith such speed and power the young Jedi shrinks before them,\nhis knees buckling. The wounded Vader struggles to his feet,\nand moves to stand at his master's side.\n\n                    EMPEROR (CONT’D)\n          Young fool...only now, at the end,\n          do you understand.\n\nLuke is almost unconscious beneath the continuing assault of\nthe Emperor's lightning. He clutches a canister to keep from\nfalling into the bottomless shaft as the bolts tear through\nhim.\n\n                    EMPEROR (CONT’D)\n          Your feeble skills are no match for\n          the power of the dark side. You\n          have paid the price for\n\nyour lack of vision.\n\nLuke writhes on the floor in unbearable pain, reaching weakly\nup toward where Vader stands watching.\n\n                    LUKE   (GROANS)\n          Father, please. Help me.\n\nAgain Vader stands, watching Luke. He looks at his master,\nthe Emperor, then back to Luke on the floor.\n\n                    EMPEROR\n          Now, young Skywalker...you will\n          die.\n\nAlthough it would not have seemed possible, the outpouring of\nbolts from the Emperor's fingers actually increases in\nintensity, the sound screaming through the room. Luke's body\nwrithes in pain.\n\nVader grabs the Emperor from behind, fighting for control of\nthe robed figure despite the Dark Lord's weakened body and\ngravely weakened arm. The Emperor struggles in his embrace,\nhis bolt-shooting hands now lifted high, away from Luke. Now\nthe white lightning arcs back to strike at Vader. He stumbles\nwith his load as the sparks rain off his helmet and flow down\nover his black cape. He holds his evil master high over his\nhead and walks to the edge of the abyss at the central core\nof the throne room. With one final burst of his once awesome\nstrength, Darth Vader hurls the Emperor's body into the\nbottomless shaft.\n\n      The Emperor's body spins helplessly into the void, arcing as\n      it falls into the abyss. Finally, when the body is far down\n      the shaft, it explodes, creating a rush of air through the\n      room.Vader's cape is whipped by the wind and he staggers, and\n      collapses toward the bottomless hole. Luke crawls to his\n      father's side and pulls him away from the edge of the abyss\n      to safety. Both the young Jedi and the giant warrior are too\n      weak to move.\n\n126   EXT/",
        "dictionary": {
            "Force": "Energy",
            "Jedi": "Warrior"
        }
    },
    {
        "message_id": 2068,
        "passage": "Rebel fighters follow the Falcon across the surface of the\n      Death Star to the unfinished portion, where they dive into\n      the superstructure of the giant battle station, followed by\n      many TIE fighters.\n\n                          WEDGE\n                I'm going in.\n\n                          LANDO\n                Here goes nothing.\n\n      Three X-wings lead the chase through the ever-narrowing\n      shaft, followed by the Falcon and four other fighters, plus\n      TIE fighters who continually fire at the Rebels. Lights\n      reflect off the pilot's faces as they race through the dark\n      shaft.\n\n                           LANDO (CONT’D)\n                Now lock onto the strongest power\n                source. It should be the power\n                generator.\n\n                          WEDGE\n                Form up. And stay alert. We could\n                run out of space real fast.\n\n      The fighters and the Falcon race through the tunnel, still\n      pursued by the TIE fighters. One of the X-wings is hit from\n      behind and explodes.\n\n                          LANDO\n                Split up and head back to the\n                surface. See if you can get a few\n                of those TIE fighters to\n\n      follow you.\n\n                          PILOT\n                Copy, Gold Leader.\n\n      The Rebel ships peel off pursued by three of the TIE's, while\n      Lando and Wedge continue through the main tunnel.\n\n      It narrows, and the Falcon scrapes the side dangerously. Two\n      other TIE fighters continue to blast away at them.\n\n                          LANDO\n                That was too close.\n\n      Nien Nunb agrees. The battle between the Rebel and Imperial\n      fleet rages on. Several cruisers fire at the giant Super Star\n      Destroyer.\n\n127",
        "dictionary": {
            "Death Star": "Giant Battle Station",
            "TIE fighters": "Imperial Starfighters",
            "X-wings": "Rebel Starfighters",
            "Falcon": "Rebel Ship",
            "Super Star Destroyer": "Giant Imperial Warship"
        }
    },
    {
        "message_id": 2069,
        "passage": "ACKBAR\n                We've got to give those fighters\n                more time. Concentrate all fire on\n                that Super Star Destroyer.\n\n      X-wings pilots head across the surface of the huge\n      battleship.\n\n128",
        "dictionary": {
            "Super Star Destroyer": "Gigantic Battleship",
            "ACKBAR": "Admiral"
        }
    }
]