[
    {
        "message_id": 2070,
        "passage": "Admiral Piett and a commander stand at the window, looking\n      out to the battle. They look concerned.\n\n                          CONTROLLER\n                Sir, we've lost our bridge\n                deflector shield.\n\n                          PIETT\n                Intensify the forward batteries. I\n                don't want anything to get through.\n\n      The commander is looking out of the window where a damaged\n      Rebel fighter is out of control and heading directly toward\n      the bridge.\n\n                          PIETT\n                Intensify forward firepower!\n\n                          COMMANDER\n                It's too late!\n\n      The Rebel pilot screams as his ship hits the Star Destroyer,\n      causing a huge explosion. The giant battle ship loses\n      control, crashes into the Death Star, and explodes.\n\n129",
        "dictionary": {
            "Star Destroyer": "Giant Battle Ship",
            "Death Star": "Giant Space Station"
        }
    },
    {
        "message_id": 2071,
        "passage": "There is excitement on the bridge as the battle rages on all\n      sides. They cheer as the giant Star Destroyer blows up.\n\n130",
        "dictionary": {
            "Star Destroyer": "Warship",
            "Star Wars": "Galactic Conflict"
        }
    },
    {
        "message_id": 2072,
        "passage": "Chaos. For the first time, the Death Star is rocked by\n      explosions as the Rebel fleet, no longer backed against a\n      wall, zooms over, unloading a heavy barrage. Imperial troops\n      run in all directions, confused and desperate to escape.\n\n      In the midst of this uproar, Luke is trying to carry the\n      enormous deadweight of his father's weakening body toward an\n      Imperial shuttle. Finally, Luke collapses from the strain.\n      The explosions grow louder as Vader draws him closer.\n\n                          VADER (A WHISPER)\n                Luke, help me take this mask off.\n\n                          LURE\n                But you'll die.\n\n                          VADER\n                Nothing can stop that now. Just for\n                once... let me look on you with my\n                own eyes.\n\n      Slowly, hesitantly, Luke removes the mask from his father's\n      face. There beneath the scars is an elderly man. His eyes do\n      not focus. But the dying man smiles at the sight before him.\n\n                          ANAKIN   (VERY WEAK)\n                Now...go, my son. Leave me.\n\n                          LUKE\n                No. You're coming with me. I can't\n                leave you here. I've got to save\n                you.\n\n                          ANAKIN\n                You already have, Luke. You were\n                right about me. Tell your\n                sister...you were right.\n\n                          LUKE\n                Father...I won't leave you.\n\n      Darth Vader, Anakin Skywalker...Luke's father, dies.\n\n      A huge explosion rocks the docking bay. Slowly, Luke rises\n      and, half carrying, half dragging the body of his father,\n      stumbles toward a shuttle.\n\n131",
        "dictionary": {
            "Death Star": "Space Station",
            "Rebel fleet": "Resistance Armada",
            "Imperial troops": "Galactic Soldiers",
            "Vader": "The Dark Lord",
            "Anakin Skywalker": "The Old Man",
            "Darth Vader": "The Dark Lord"
        }
    },
    {
        "message_id": 2073,
        "passage": "The Millennium Falcon leads a swerving bomb run through the\n      immense superstructure of the half-built Death Star.\n\n      The Rebel Star Cruisers outside continually bombard the huge\n      station. And each direct hit is answered by resonating, chain-\n      reaction explosions within the station itself.\n\n132",
        "dictionary": {
            "Millennium Falcon": "Fast Spacecraft",
            "Death Star": "Massive Space Station",
            "Rebel Star Cruisers": "Allied Space Vessels",
            "chain-reaction explosions": "cascading explosions"
        }
    },
    {
        "message_id": 2074,
        "passage": "Lando's crew fires away at the pursuing TIE fighters as the\n      dashing Baron of Bespin and his alien copilot home in on the\n      main reactor shaft. It is awesome. A lone X-wing is just in\n      front of the Falcon.\n\n                          WEDGE\n                There it is!\n\n                          LANDO\n                All right, Wedge. Go for the power\n                regulator on the north tower.\n\n                          WEDGE\n                Copy, Gold Leader. I'm already on\n                my way out.\n\n      The X-wing heads for the top of the huge reactor and fires\n      several proton torpedoes at the power regulator, causing a\n      series of small explosions.\n\n      The Falcon heads for the main reactor, and when it is\n      dangerously close, Lando fires the missiles, which shoot out\n      of the Falcon with a powerful roar, and hit directly at the\n      center of the main reactor.\n\n      He maneuvers the Falcon out of the winding superstructure\n      just ahead of the continuing chain of explosions.\n\n133",
        "dictionary": {
            "TIE fighters": "enemy planes",
            "Baron of Bespin": "Governor of the planet",
            "X-wing": "fighter jet",
            "Gold Leader": "Commander of the squadron",
            "proton torpedoes": "high-powered missiles"
        }
    },
    {
        "message_id": 2075,
        "passage": "Ackbar and other Mon Calamari lean on the railing of the\n      bridge, watching the large screen showing the Death Star in\n      the main briefing room.\n\n                          ACKBAR\n                Move the fleet away from the Death\n                Star.\n\n134",
        "dictionary": {
            "Mon Calamari": "alien species",
            "Death Star": "enemy base"
        }
    },
    {
        "message_id": 2076,
        "passage": "An Imperial shuttle, with Luke alone in the cockpit, rockets\n      out of the main docking bay as that entire section of the\n      Death Star is blown away.\n\n      Finally, just as it looks like the Falcon will not make it,\n      Lando expertly pilots the craft out of the exploding\n      superstructure and whizzes toward the Sanctuary Moon, only a\n      moment before the Death Star supernovas into oblivion.\n\n135",
        "dictionary": {
            "Death Star": "space station",
            "Sanctuary Moon": "refuge planet"
        }
    },
    {
        "message_id": 2077,
        "passage": "Lando and Nien Nunb laugh and cheer in relief.\n\n136",
        "dictionary": {
            "Nien Nunb": "Pilot Friend",
            "Lando": "Smooth-Talking Gambler"
        }
    },
    {
        "message_id": 2078,
        "passage": "Han and Leia, Chewie, the droids, the Rebel troops, and the\n      Ewoks all look to the sky as the Death Star reveals itself in\n      a final flash of self-destruction. They all cheer.\n\n                          THREEPIO\n                They did it!\n\n      Han looks town from the sky to Leia, a look of concern on his\n      face. Leia continues to look at the sky as though listening\n      for a silent voice.\n\n                          HAN\n                I'm sure Luke wasn't on that thing\n                when it blew.\n\n                          LEIA\n                He wasn't. I can feel it.\n\n                          HAN\n                You love him, don't you?\n\n      Leia smiles, puzzled.\n\n                          LEIA\n                Yes.\n\n                          HAN\n                All right. I understand. Fine. When\n                he comes back, I won't get in the\n                way.\n\n      She realizes his misunderstanding.\n\n                          LEIA\n                Oh. No, it's not like that at all.\n                He's my brother.\n\n      Han is stunned by this news. She smiles, and they embrace.\n\n137",
        "dictionary": {
            "Death Star": "Doomsday Station",
            "Ewoks": "Forest Dwellers"
        }
    },
    {
        "message_id": 2079,
        "passage": "Luke sets a torch to the logs stacked under a funeral pyre\n      where his father's body lies, again dressed in black mask and\n      helmet. He stands, watching sadly, as the flames leap higher\n      to consume Darth Vader -- Anakin Skywalker.\n\n      In the sky above, fireworks explode and Rebel fighters zoom\n      above the forest.\n\n138",
        "dictionary": {
            "Darth Vader": "Dark Lord",
            "Rebel fighters": "Freedom pilots"
        }
    }
]