[
    {
        "message_id": 70,
        "passage": "KITSTER (a young boy about Anakin's age), SEEK (a boy of ten), AMEE (a girl\nof six), and WALD (a Greedo Type, six years old) join ANAKIN, JAR JAR,\nARTOO, and PADME securing some wiring.\n\nANAKIN : Padme and Jar Jar, this is my friend Kitster, and seek, Amee, and\nWald.\n\nAll whistle, hoot, and speak a greeting.\n\nKITSTER : Wow, a real Astro Droid...how'd you get so lucky?\nANAKIN : This isn't the half of it. I'm entered in the Boonta Race\ntomorrow!\nKITSTER : What? With this??\nWALD : (subtitled) Annie, Jesko na joka. 9You are such a joke, Annie.)\nAMEE : You've been working on that thing for years. It's never going to\nrun.\nSEEK : Come on, let's go play ball. Keep it up, Annie, and you're gonna be\nbug squash.\n\nSEEK, WALD, and AMEE take off, laughing. JAR JAR is fiddling with one of\nthe energy binder plates.\n\nANAKIN : Hey! Jar Jar! Stay away from those energy binders...\nJAR JAR : Who, mesa?\nANAKIN : If your hand gets caught in that beam, it will go numb for hours.\n\nJAR JAR peeks at the energy plate; it makes a little electronic pop, zaps\nhim in the mouth and jumps back. JAR JAR tries to say something, but his\nmouth is numb and his words are garbled.\n\nJAR JAR : Ouch-dats muy bigo Oucho. (Gibberish)\nKITSTER : But you don't even know if this thing will run.\nANAKIN : It will.\n\nQUI-GON approaches the GROUP and gives ANAKIN a small battery. JAR JAR gets\nhis hand caught in the afterburner and tries to tell Anakin, but can't get\nwords out that make sense.\n\nQUI-GON : I think it's time we found out. Use this power charge. ANAKIN :\nYes, sir!!\n\nANAKIN jumps into the little capsule behind the two giant engines. He puts\nthe power pack back into the dashboard. EVERYONE backs away, except for JAR\nJAR who calls for help. Finally PADME frees him and the engines ignite with\na ROAR. EVERYONE cheers.",
        "dictionary": {
            "Boonta Race": "Galactic Championship",
            "Astro Droid": "Advanced Robot",
            "Greedo Type": "Alien Species",
            "Jesko na joka": "You are a joke",
            "Mesa": "Me",
            "Qui-Gon": "Expert"
        }
    },
    {
        "message_id": 71,
        "passage": "SHMI, watching from the porch, smiles sadly.",
        "dictionary": {
            "SHMI": "Mother"
        }
    },
    {
        "message_id": 72,
        "passage": "ANAKIN sits on the balcony rail of his hovel as QUI-GON tends to a cut. The\nBOY leans back to look at the vast blanket of stars in the sky.\n\nQUI-GON : Sit still, Annie. Let me clean this cut.\nANAKIN : There are so many! Do they all have a system of planets?\nQUI-GON : Most of them.\nANAKIN : Has anyone been to them all?\nQU-IG0N : (laughs) Not likely.\nANAKIN : I want to be the first one to see them all... Ouch!\n\nQUI-GON wipes a patch of blood off ANAKIN'S arm.\n\nQUI-GON : There, good as new...\n\nSHMI yells from inside the hovel.\n\nSHMI : (O.S.) Annie, bedtime!\n\nQUI-GON scrapes ANAKIN's blood onto a comlink chip.\n\nANAKIN : What are you doing?\nQUI-GON : Checking your blood for infections.\nANAKIN : I've never seen...\nSHMI : (O.S.) Annie! I'm not goiung to tell you again!\nQUI-GON : Go on, you have a big day tomorrow. (beat) Goodnight.\n\nANAKIN rolls his eyes and runs into the hovel. QUI-GON takes the blood\nstained chip and inserts it into the comlink, then calls OBI-WAN.\n\nQUI-GON : (Cont'd) Obi-Wan...\nOBI-WAN : Yes, Master.\nQUI-GON : Make an analysis of this blood sample I'm sending you.\nOBI-WAN : Wait a minute...\nQUI-GON : I need a midi-chlorian count.\nOBI-WAN : All right. I've got it.\nQUI-GON : What are your readings?\nOBI-WAN : Something must be wrong with the transmission.\nQUI-GON : Here's a signal check.\nOBI-WAN : Strange. The transmission seems to be in good order, but the\nreading's off the chart...over twenty thousand.\nQUI-GON : (almost to himself) That's it then.\nOBI-WAN : Even Master Yoda doesn't have a midi-chlorian count that high!\nQUI-GON : No Jedi has.\nOBI-WAN : What does it mean?\nQUI-GON : I'm not sure.\n\nThe JEDI KNIGHT looks up and sees SHMI in the doorway watching him.\nEmbarrassed, she goes back into the kitchen while QUI-GON ponders the\nsituation.",
        "dictionary": {
            "midi-chlorian": "energy signature",
            "Jedi": "Knights of the Realm",
            "Qui-Gon": "Old Master"
        }
    },
    {
        "message_id": 73,
        "passage": "The sinister looking Sith spacecraft lands on top of a desert mesa at dus,\nscattering a herd of banthas. DARTH MAUL walks to the edge of the mesa and\nstudies the landscape with a pair of electrobinoculars. He picks out the\nlights of three different cities in the distance, then pushes buttons on\nhis electronic armband.\n\nSix football-sized PROBE DROIDS float out of the ship and head off in three\ndifferent directions toward the cities.\n\nDARTH MAUL stands on the mesa and watches them through his\nelectrobinoculars.",
        "dictionary": {
            "Sith spacecraft": "Alien vessel",
            "DARTH MAUL": "Lord Vader",
            "electrobinoculars": "night vision goggles",
            "PROBE DROIDS": "exploration robots"
        }
    },
    {
        "message_id": 74,
        "passage": "Padme exits the hovel.",
        "dictionary": {
            "Padme": "Senator"
        }
    },
    {
        "message_id": 75,
        "passage": "As the twin suns rise, ARTOO is busy painting the racing Pod. ANAKIN is\nasleep. PADME passes ARTOO.\n\nPADME : I hope you're about finished.\n\nARTOO whistles a positive reply. PADME sees KITSTER riding toward them on\nan EOPIE, a strange camel-lile creature. He is leading a second EOPIE\nbehind him. PADME goes over to ANAKIN. He looks very vulnerable as he\nsleeps. She watches him, then touches him on the cheek. ANAKIN wakes up,\nyawns, and looks at her, a little puzzled.\n\nANAKIN : You were in my dream...you were leading a huge army into battle.\nPADME : I hope not; I hate fighting. Your mother wants you to come in and\nclean up. We have to leave soon. ANAKIN stands up and stretches just as\nKITSTER arrives.\n\nANAKIN : Hook 'em up, Kitster. (to Padme) I won't be long. Where's Qui-Gon?\n\nPADME : He and Jar Jar left already. They're with Watto at the arena.",
        "dictionary": {
            "ARTOO": "R2-D2",
            "EOPIE": "a type of exotic animal",
            "Padmé": "Queen Amidala",
            "Qui-Gon": "General Skywalker",
            "Jar Jar": "a clumsy alien"
        }
    },
    {
        "message_id": 76,
        "passage": "RACE CREWS mill about outside the Main Hanger.",
        "dictionary": {}
    },
    {
        "message_id": 77,
        "passage": "The hanger is a large building with a dozen or so Podracers being readied\nfor the race. ALIEN CREWS and PILOTS rush about, making last minute fixes\non their vehicles. WATTO, QUI-GON, and JAR JAR walk through the activity.\n\nWATTO : ...I want to see your spaceship the moment the race is over.\nQUI-GON : Patienc, my blue friend. You'll have your winnings before the\nsuns set, and we'll be far away from here.\nWATTO : Not if your ship belongs to me, I think...I warn you, no funny\nbusiness.\nQUI-GON : You don't think Anakin will win?\n\nWATTO stops before an orange racer. Sitting to one side, having his\nshoulders and neck massaged by TWIN YOBANAS, is SEBULBA.\n\nWATTO : Don't get me wrongo. I have great faith in the boy. He's a credit\nto your race, but Sebulba there is going to win, I think.\nQUI-GON : Why?\nWATTO : He always wins. (laughs) I'm betting heavily on Sebulba.\nQUI-GON : I'll take that bet.\nWATTO : (suddenly stops laughing) What??!! What do you mean?\nQUI-GON : I'll wager my new racing pod against...say...the boy and his\nmother.\nWATTO : A Pod for slaves. I don't think so...well, poerhaps. Just one...the\nmother, maybe...the boy isn't for sale.\nQUI-GON : The boy is small, he can't be worth much.\n\nWATTO shakes his head.\n\nQUI-GON : (Cont'd) For the fastest Pod ever built?!\n\nWATTO shakes his head again.\n\nQUI-GON : (Cont'd) Both, or no bet.\nWATTO : No Pod's worth two slaves...not by a long shot...one slave or\nnothing.\nQUI-GON : The boy, then...\n\nWATTO pulls out a small cube from his pocket.\n\nWATTO : We'll let fate decide. Blue it's the boy, red his mother...\n\nWATTO tosses the cube down. QUI-GON lifts his hand slightly; it turns blue.\nQUI-GON smiles. WATTO is angry.\n\nWATTO : (Cont'd) You won the small toss, outlander, bou you won't win the\nrace, so...it makes little difference.\n\nANAKIN and PADME enter the hanger on one of the EOPIES, pulling an engine.\nKITSTER, on the other EOPIE, is pulling another engine. With THREEPIO\nwalking alongside, ARTOO trundles behind, pulling the Pod with SHMI sitting\non it. WATTO passes ANAKIN as he leaves.\n\nWATTO : (Cont'd) (subtitled) Bonapa keesa pateeso, o wanna meetee chobodd.\n(Better stop your friends betting, or I'll end up owning him, too.)\n\nWATTO walks off, laughing.\n\nANAKIN : What did he mean by that?\n\nQUI-GON : I'll tell you later.\n\nARTOO beeps at THREEPIO.\n\nTHREEPIO : Oh my! Space travel sounds rather perilous.\n\nARTOO emits a series of beeps.\n\nTHREEPIO : I can assure you they will never get me onto one of those\ndreadful starships!\nKITSTER : (to Anakin) This is so wizard! I'm sure you'll do it this time,\nAnnie.\nPADME : Do what?\nKITSTER : Finish the race, of course!\nPADME : You've never won a race?\nANAKIN : Well...not exactly...\nPADME : Not even finished?!\n\nANAKN looks sheepish.\n\nANAKIN : ...but Kitster's right, I will this time.\nQUI-GON : Of course you will.",
        "dictionary": {
            "Podracers": "Racing Cars",
            "ALIEN CREWS": "Space Pilots",
            "WATTO": "Tournament Organizer",
            "QUI-GON": "Racing Expert",
            "JAR JAR": "Entertainer",
            "TWIN YOBANAS": "Massage Therapists",
            "SEBULBA": "Racing Champion",
            "EOPIES": "Space Vehicles",
            "THREEPIO": "Linguist",
            "ARTOO": "Translator",
            "SHMI": "Anakin's Mother",
            "KITSTER": "Anakin's Friend",
            "BOUNTY": "Prize",
            "BONAPA KEESEA PATEESO": "Better Stop Your Friends Betting",
            "CHOBODD": "Anakin"
        }
    },
    {
        "message_id": 78,
        "passage": "One of Darth Maul's PROBE DROIDS slowly floats down the main street of\nTatooine. It looks in shops and studies PEOPLE as it searches for OBI-WAN,\nQI-GON, or the QUEEN.",
        "dictionary": {
            "PROBE DROIDS": "Remote Surveillance Devices",
            "Tatooine": "Desert Planet",
            "OBI-WAN": "Jedi Master",
            "QI-GON": "Jedi Knight",
            "QUEEN": "Ruler of the Planet"
        }
    },
    {
        "message_id": 79,
        "passage": "An EXTREME HIGH WIDE ANGLE reveals a vast arena in the Tatooine desert. A\nlarge semi-circular amphitheatre that holds at least a hundred thousand\npeople dominates the landscape. Large viewing platforms loom over the\nracetrack.",
        "dictionary": {
            "Tatooine": "Arctic Outpost",
            "EXTREME HIGH WIDE ANGLE": "Wide-Angle Shot"
        }
    }
]