[
    {
        "message_id": 2010,
        "passage": "Darth Vader walks down the corridor to the Emperor's Tower\n     and private elevator. The Emperor's private guard steps in\n     Vader's path.\n\n                         GUARD\n               Halt! The Emperor does not wish to\n               be disturbed at the moment.\n\n                         VADER\n                   (raising his gloved hand\n                    to the two guards and\n                    choking them with the\n                    Force)\n               The Emperor will see me, now!\n\n                         GUARD\n                   (repeating Vader's\n                    command)\n               The Emperor will see you, now.\n\n69",
        "dictionary": {
            "Force": "energy manipulation",
            "Emperor's Tower": "Private Chamber",
            "private elevator": "exclusive lift"
        }
    },
    {
        "message_id": 2011,
        "passage": "Two red Imperial Guards stand watch at the elevator as the\n     door opens to reveal Vader. Vader enters the eerie,\n     foreboding throne room. It appears to be empty. His footsteps\n     echo as he approaches the throne. He waits, absolutely still.\n     The Emperor sits with his back to the Dark Lord.\n\n                         EMPEROR\n               I told you to remain on the command\n               ship.\n\n                         VADER\n               A small Rebel force has penetrated\n               the shield and landed on Endor.\n\n                         EMPEROR   (NO SURPRISE)\n               Yes, I know.\n\n                         VADER (AFTER A BEAT)\n               My son is with them.\n\n                         EMPEROR   (VERY COOL)\n               Are you sure?\n\n                         VADER\n               I have felt him, my Master.\n\n                         EMPEROR\n               Strange, that I have not. I wonder\n               if your feelings on this matter are\n               clear, Lord\n\n     Vader.\n\n     Vader knows what is being asked.\n\n                         VADER\n               They are clear, my Master.\n\n                         EMPEROR\n               Then you must go to the Sanctuary\n               Moon and wait for them.\n\n                         VADER (SKEPTICAL)\n               He will come to me?\n\n                         EMPEROR\n               I have foreseen it. His compassion\n               for you will be his undoing. He\n               will come to you and\n\n     then you will bring him before me.\n\n                         VADER   (BOWS)\n               As you wish.\n\n     The Dark Lord strides out of the throne room.\n\n70",
        "dictionary": {
            "Endor": "a remote planet",
            "Sanctuary Moon": "a hidden refuge",
            "Rebel force": "a group of insurgents"
        }
    },
    {
        "message_id": 2012,
        "passage": "Han, Luke, Chewie, and the two droids are spread out as they\n     move through the heavy foliage near the clearing where we\n     last saw Leia. Luke finds Leia's helmet, picks it up with an\n     expression of concern.\n\n                         HAN   (OS)\n               Luke! Luke!\n\n     Luke runs with the helmet to where Han has found the charred\n     wreckage of a speeder bike in the grass.\n\n                         THREEPIO\n               Oh, Master Luke.\n\n                         LUKE\n               There's two more wrecked speeders\n               back there. And I found this.\n\n     He tosses the helmet to Han.\n\n                         THREEPIO\n               I'm afraid that Artoo's sensors can\n               find no trace of Princess Leia.\n\n                         HAN (GRAVELY)\n               I hope she's alright.\n\n     Chewbacca growls, sniffing the air, then, with a bark, pushes\n     off through the foliage.\n\n                         HAN (CONT’D)\n               What, Chewie? What? Chewie!\n\n     The others rush to keep up with the giant Wookiee. As he\n     scoots along, Artoo whistles nervously.\n\n71",
        "dictionary": {
            "speeder bike": "motorcycle",
            "Wookiee": "giant ape",
            "Artoo": "droid",
            "Han": "pilot"
        }
    },
    {
        "message_id": 2013,
        "passage": "The group has reached a break in the undergrowth. Chewie\n     walks up to a tall stake planted in the ground. There is a\n     dead animal hanging from it.\n\n                         HAN\n               Hey, I don't get it.\n\n     The rest of the group joins the Wookiee around the stake.\n\n                         HAN (CONT) (CONT’D)\n               Nah, it's just a dead animal,\n               Chewie.\n\n     Chewie can't resist. He reaches toward the meat.\n\n                         LUKE\n               Chewie, wa-wait!   Don't!\n\n     Too late. The Wookiee has already pulled the animal from the\n     stake. SPROOING! The group finds itself hanging upside down\n     in an Ewok net, suspended high above the clearing. Artoo lets\n     out a wild series of beeps and whistles, and Chewie howls his\n     regret. Their bodies are a jumble in the net. Han removes a\n     Wookiee paw from his mouth.\n\n                         HAN\n               Nice work. Great, Chewie! Great!\n               Always thinking with your stomach.\n\n                         LUKE\n               Will you take it easy? Let's just\n               figure out a way to get out of this\n               thing.\n                   (trying to free an arm)\n               Han, can you reach my lightsaber?\n\n                         HAN\n               Yeah, sure.\n\n     Artoo is at the bottommost point in the net. He extends his\n     cutting appendage and begins slicing at the net. Han is\n     trying to squeeze an arm past Threepio to get at Luke's\n     lightsaber. The net continues to spin.\n\n                         THREEPIO\n               Artoo, I'm not sure that's such a\n               good idea. It's a very long dro-o-\n               op!!\n\n     Artoo has cut through and the entire group tumbles out of the\n     net, crashing to the ground.\n\nAs they regain their senses and sit up, they realize they are\nsurrounded by dozens of Ewoks, each brandishing a long spear.\n\n                    HAN\n          Wha--? Hey! Point that thing\n          someplace else.\n\nHan pushes the spear wielded by TEEBO out of his face and a\nsecond Ewok warrior comes up to argue with Teebo. The spear\nreturns to Han's face. He grabs it angrily and starts to go\nfor his laser pistol.\n\n                    HAN (CONT’D)\n          Hey!\n\n                    LUKE\n          Han, don't. It'll be all right.\n\nThe Ewoks swarm through them and confiscate their weapons.\nLuke lets them take his lightsaber. Chewie growls at the\nfurry critters.\n\n                    LUKE (CONT’D)\n          Chewie, give 'em your crossbow.\n\nArtoo and Threepio are just untangling themselves. Threepio\ngets free of the net and sits up, rattled.\n\n                    THREEPIO\n          Oh, my head. Oh, my goodness!\n\nWhen the Ewoks see Threepio, they let out a gasp and chatter\namong themselves. Threepio speaks to them in their native\ntongue. The Ewok nearest him drops his spear and prostrates\nhimself before the droid. In a moment, all the Ewoks have\nfollowed suit. Chewie lets out a puzzled bark. Han and Luke\nregard the bowed creatures in wonder. The Ewoks begin to\nchant at Threepio.\n\n                    LUKE\n          Do you understand anything they're\n          saying?\n\n                    THREEPIO\n          Oh, yes, Master Luke! Remember\n          that I am fluent in over six\n          million forms of\n\ncommunication.\n\n                    HAN\n          What are you telling them?\n\n                         THREEPIO\n               Hello, I think... I could be\n               mistaken. They're using a very\n               primitive dialect. But\n\n     I do believe they think I am some sort of god.\n\n     Chewbacca and Artoo think that's very funny. Han and Luke\n     exchange \"what next?\" looks.\n\n                         HAN\n               Well, why don't you use your divine\n               influence and get us out of this?\n\n                         THREEPIO\n               I beg your pardon, General Solo,\n               but that just wouldn't be proper.\n\n                            HAN\n               Proper?!\n\n                         THREEPIO\n               It's against my programming to\n               impersonate a deity.\n\n     Han moves toward Threepio threateningly.\n\n                            HAN\n               Why, you--\n\n     Several Ewoks' spears are thrust in Han's face at the affront\n     to their god. The Ewoks move in to protect their god and Han\n     is surrounded by a menacing circle of spears, all aimed at\n     him. He holds up his hands placatingly.\n\n                         HAN (CONT’D)\n               My mistake. He's an old friend of\n               mine.\n\n72",
        "dictionary": {
            "Chewie": "The Wookiee",
            "Ewok": "Furry Critters",
            "Artoo": "The Droid",
            "Threepio": "The Protocol Droid",
            "lightsaber": "Energy Sword"
        }
    },
    {
        "message_id": 2014,
        "passage": "A procession of Ewoks winds through the ever-darkening\n     forest. Their prisoners - Han, Luke, Chewie, and Artoo - are\n     tied to long poles and wrapped in vines, cocoonlike.\n\n     Each pole is carried on the shoulders of several Ewoks.\n     Behind the captives, Threepio is carried on a litter, like a\n     king, by the remaining creatures.\n\n73",
        "dictionary": {
            "Ewoks": "forest dwellers",
            "Threepio": "diplomat",
            "Rebels": "insurgents",
            "forest": "woods"
        }
    },
    {
        "message_id": 2015,
        "passage": "The procession moves along a shaky, narrow, wooden walkway,\n     high in the giant trees. It stops at the end of the walkway,\n     which drops off into nothingness.\n\n     On the other side of the abyss is a village of mud huts and\n     rickety walkways, attached to the giant trees. The lead Ewok\n     takes hold of a long vine and swings across to the village\n     square; the other Ewoks follow suit.\n\n74",
        "dictionary": {
            "Ewok": "Indigenous tribe",
            "Ewoks": "Treetop dwellers"
        }
    },
    {
        "message_id": 2016,
        "passage": "The procession winds its way into the village square. Mother\n     Ewoks gather their babies up and scurry into their huts at\n     the sight of the newcomers. The group stops before the\n     largest hut.\n\n     Han, Luke, Chewie, and Artoo are still bound to their poles.\n     Han is placed on a spit above what looks like a barbecue pit\n     and the others are leaned against a tree nearby. Threepio's\n     litter/throne is gently placed near the pit. He watches with\n     rapt fascination. Han, Luke, and Chewie are less than\n     fascinated.\n\n                         HAN\n               I have a really bad feeling about\n               this.\n\n     Chewie growls his concern.\n\n     Suddenly all activity stops as LOGRAY, the tribal Medicine\n     Man, comes out of the big hut. He examines the captives\n     carefully, goes to join Threepio, whose throne has been\n     placed on an elevated platform. A larger, gray-haired Ewok,\n     CHIEF CHIRPA, is examining Luke's lightsaber with great\n     curiosity.\n\n     Logray speaks to Threepio and the assemblage of fuzzy Ewoks,\n     pointing to the prisoners tied to the stakes. The Ewoks begin\n     filling the pit under Han with firewood.\n\n                         HAN (CONT’D)\n               What did he say?\n\n                         THREEPIO\n               I'm rather embarrassed, General\n               Solo, but it appears you are to be\n               the main course at a\n\n     banquet in my honor.\n\n     The drums start beating, and all the furry heads turn to the\n     large hut. Leia emerges, wearing an animal-skin dress. She\n     sees what's happening at the same moment the prisoners see\n     her.\n\n     HAN and LUKE Leia!\n\nAs she moves toward them, the Ewoks block her way with raised\nspears.\n\n                    LEIA\n          Oh!\n\n                    THREEPIO\n          Your Royal Highness.\n\nArtoo and Chewie chime in with their welcome. Leia looks at\nthe assembled Ewoks and sighs.\n\n                    LEIA\n          But these are my friends. Threepio,\n          tell them they must be set free.\n\nThreepio talks to Chirpa and Logray, who listen and shake\ntheir heads negatively. The Medicine Man gestures toward the\nprisoners and barks some orders. Several Ewoks jump up and\npile more wood on the barbecue with vigor. Leia trades\nfrantic looks with Luke and Han .\n\n                    HAN\n          Somehow, I got the feeling that\n          didn't help us very much.\n\n                    LUKE\n          Threepio, tell them if they don't\n          do as you wish, you'll become angry\n          and use your magic.\n\n                    THREEPIO\n          But Master Luke, what magic? I\n          couldn't possibly --\n\n                    LUKE\n          Just tell them.\n\nThreepio speaks to the Ewoks. The Ewoks are disturbed. Logray\nsteps forward and challenges Threepio. Luke closes his eyes\nand begins to concentrate.\n\n                    THREEPIO\n          You see, Master Luke; they didn't\n          believe me. Just...\n\nNow the litter/throne, with Threepio sitting upon it, rises\nfrom the ground. At first Threepio doesn't notice and keeps\ntalking.\n\n                    THREEPIO (CONT’D)\n          ... as I said they wouldn't. Wha-\n          wha-what's happening! Oh! Oh, dear!\n          Oh!\n\n     The Ewoks fall back in terror from the floating throne. Now\n     Threepio begins to spin as though he were on a revolving\n     stool, with Threepio calling out in total panic at his\n     situation.\n\n                         THREEPIO (CONT’D)\n               Put me down! He-e-elp! Master Luke!\n               Artoo! Somebody, somebody, help!\n               Master Luke, Artoo! Artoo, quickly!\n               Do something, somebody! Oh! Ohhh!\n\n     Chief Chirpa yells orders to the cowering Ewoks. They rush up\n     and release the bound prisoners. Luke and Han enfold Leia in\n     a group embrace. Luke notices the spinning Threepio, with\n     Artoo beeping up at him, and slowly lowers the golden droid\n     and the throne to the ground. Logray orders the little droid\n     cut down. Artoo crashes to the ground. When the Ewoks set him\n     upright, the little droid is fighting mad. Artoo beeps a blue\n     streak at the nearest Ewok, and begins pursuing him, finally\n     getting close enough to zap him with an electric charge. The\n     Ewok jumps two feet in the air and runs away, screaming. A\n     small group of Ewoks surround the giant Wookiee, scratching\n     their heads and marveling at his height.\n\n                         THREEPIO (CONT’D)\n               Oh, oh, oh, oh! Thank goodness.\n\n                         LUKE\n               Thanks, Threepio.\n\n                         THREEPIO   (STILL SHAKEN)\n               I...I never knew I had it in me.\n\n75",
        "dictionary": {
            "Ewoks": "Furry Tribesmen",
            "Threepio": "Golden Droid",
            "Logray": "Medicine Man",
            "Chief Chirpa": "Gray-Haired Ewok Leader",
            "Rebels": "Prisoners"
        }
    },
    {
        "message_id": 2017,
        "passage": "A glowing fire dances in the center of the spartan, low-\n     ceilinged room, creating a kaleidoscope of shadows on the\n     walls. Along one side, a group of ten Ewok elders flank Chief\n     Chirpa, who sits on his throne. The Rebels sit along the\n     walls of the hut, with Threepio between the two groups and\n     Wicket and Teebo off to one side.\n\n     Threepio is in the midst of a long, animated speech in the\n     Ewok's squeaky native tongue. The Ewoks listen carefully and\n     occasionally murmur comments to each other. Threepio points\n     several times at the Rebel group and pantomimes a short\n     history of the Galactic Civil War, mimicking the explosion\n     and rocket sounds, imitating Imperial walkers. Throughout the\n     long account, certain familiar names are distinguishable in\n     English: Princess Leia, Artoo, Darth Vader, Death Star, Jedi,\n     Obi- Wan Kenobi. Artoo begins beeping excitedly at Threepio.\n\n                    THREEPIO\n          Yes, Artoo. I was just coming to\n          that.\n\nThreepio continues with: Millennium Falcon, Cloud City,\nVader, Han Solo, carbonite, Sarlacc, bringing the history up\nto the present time.\n\nAt the end of it, the Chief, Logray, and the elders confer,\nthen nod in agreement. The Chief stands and makes a\npronouncement.\n\nThe drums begin to sound, and all the Ewoks stand with a\ngreat cheer and screeches.\n\n                    HAN\n          What's going on?\n\n                    LEIA\n          I don't know.\n\nLuke has been sharing the joy with smiling visage, but now\nsomething passes like a dark cloud through his consciousness.\nThe others do not notice.\n\n                    THREEPIO\n          Wonderful! We are now a part of the\n          tribe.\n\nSeveral of the little teddy bears run up and hug the Rebels.\n\n                    HAN\n          Just what I always wanted.\n\nChewbacca is being enthusiastically embraced by an Ewok,\nwhile Wicket clings to Han's leg.\n\n                    HAN (CHUCKLES) (CONT’D)\n          Well, short help is better than no\n          help at all, Chewie.\n              (to Wicket)\n          Thank you. Okay.\n\n                    THREEPIO\n          He says the scouts are going to\n          show us the quickest way to the\n          shield generator.\n\nChewie barks. Luke has drifted to the back of the hut. Now he\nwanders outside into the moonlight. Leia notices and follows.\n\n                         HAN\n               Good. How far is it? Ask him. We\n               need some fresh supplies, too. And\n               try and get our weapons back.\n\n     Han pulls Threepio back as he keeps trying to translate.\n\n                         HAN (CONT) (CONT’D)\n               And hurry up, will ya? I haven't\n               got all day.\n\n76",
        "dictionary": {
            "Ewok": "Teddy bear-like alien",
            "Threepio": "Interpretive guide",
            "Chief Chirpa": "Native leader",
            "Millennium Falcon": "Rebel spacecraft",
            "Cloud City": "Lunar colony",
            "Death Star": "Imperial space station",
            "Jedi": "Ancient warrior order",
            "Obi-Wan Kenobi": "Mentor figure",
            "Artoo": "Droid companion",
            "Darth Vader": "Sith Lord",
            "Rebel group": "Resistance fighters",
            "Carbonite": "Preservation method",
            "Sarlacc": "Planetary creature"
        }
    },
    {
        "message_id": 2018,
        "passage": "The walkway is deserted now. The windows of the little huts\n     glow and flicker from the fires inside. The sounds of the\n     forest fill the soft night air. Luke has wandered away from\n     the Chief's hut and stands staring up at the Death Star. Leia\n     finds him like that.\n\n                         LEIA\n               Luke, what's wrong?\n\n     Luke turns and looks at her a long moment.\n\n                         LUKE\n               Leia... do you remember your\n               mother? Your real mother?\n\n                         LEIA\n               Just a little bit. She died when I\n               was very young.\n\n                         LUKE\n               What do you remember?\n\n                         LEIA\n               Just...images, really. Feelings.\n\n                          LUKE\n               Tell me.\n\n                          LEIA\n                   (a little surprised at his\n                    insistence)\n               She was very beautiful. Kind,\n               but...sad.\n                   (looks up)\n               Why are you asking me all this?\n\n     He looks away.\n\n                         LUKE\n               I have no memory of my mother. I\n               never knew her.\n\n                    LEIA\n          Luke, tell me. What's troubling\n          you?\n\n                    LUKE\n          Vader is here...now, on this moon.\n\n                    LEIA   (ALARMED)\n          How do you know?\n\n                     LUKE\n          I felt his presence. He's come for\n          me. He can feel when I'm near.\n          That's why I have to go.\n              (facing her)\n          As long as I stay, I'm endangering\n          the group and our mission here.\n              (beat)\n          I have to face him.\n\nLeia is distraught, confused.\n\n                    LEIA\n          Why?\n\nLuke moves close and his manner is gentle. And very calm.\n\n                    LUKE\n          He's my father.\n\n                    LEIA\n          Your father?\n\n                    LUKE\n          There's more. It won't be easy for\n          you to hear it, but you must. If I\n          don't make it back, you're the only\n          hope for the Alliance.\n\nLeia is very disturbed by this. She moves away, as if to deny\nit.\n\n                    LEIA\n          Luke, don't talk that way. You have\n          a power I--I don't understand and\n          could never have.\n\n                    LUKE\n          You're wrong, Leia. You have that\n          power too. In time you'll learn to\n          use it as I have. The Force is\n          strong in my family. My father has\n          it...I have it...and...my sister\n          has it.\n\nLeia stares into his eyes. What she sees there frightens her.\nBut she doesn't draw away. She begins to understand.\n\n                    LUKE (CONT’D)\n          Yes. It's you Leia.\n\n                    LEIA\n          I know. Somehow...I've always\n          known.\n\n                    LUKE\n          Then you know why I have to face\n          him.\n\n                    LEIA\n          No! Luke, run away, far away. If he\n          can feel your presence, then leave\n          this place. I wish I could go with\n          you.\n\n                    LUKE\n          No, you don't. You've always been\n          strong.\n\n                    LEIA\n          But, why must you confront him?\n\n                    LUKE\n          Because...there is good in him.\n          I've felt it. He won't turn me over\n          to the Emperor. I can save him. I\n          can turn him back to the good side.\n          I have to try.\n\nThey hold each other close and look at each other, brother\nand sister.\n\nLeia holds back her tears as Luke slowly lets her go and\nmoves away. He disappears onto the walkway that leads out of\nthe village. Leia, bathed in moonlight, watches him go as Han\ncomes out of the Chief's hut and comes over to her. Leia is\ncrying, her body trembling. He realizes only now that she is\ncrying.\n\n                    HAN\n          Hey, what's goin' on?\n\nLeia attempts to stifle her sobs and wipes her eyes.\n\n                    LEIA\n          Nothing. I - just want to be alone\n          for a little while.\n\n                         HAN (ANGRY)\n               Nothing? Come on, tell me.     What's\n               goin' on?\n\n     She looks up at him, struggling to control herself.\n\n                         LEIA\n               I...I can't tell you.\n\n                         HAN (LOSES HIS TEMPER)\n               Did you tell Luke? Is that who you\n               could tell?\n\n                            LEIA\n               I...\n\n                            HAN\n               Ahhh...\n\n     He starts to walk away, exasperated, then stops and walks\n     back to her.\n\n                            HAN (CONT’D)\n               I'm sorry.\n\n                            LEIA\n               Hold me.\n\n     Han gathers her tightly in his protective embrace.\n\n77",
        "dictionary": {
            "Death Star": "Imperial Base",
            "Chief's hut": "Village Inn",
            "Force": "Power of the Mind",
            "Vader": "Imperial Commander"
        }
    },
    {
        "message_id": 2019,
        "passage": "An Imperial shuttle floats down from the Death Star and lands\n     gracefully on the huge platform.\n\n     Now, an Imperial walker approaches the platform from the\n     darkness of the forest. The whole outpost - platform,\n     walkers, military - looks particularly offensive in the midst\n     of this verdant beauty.\n\n78",
        "dictionary": {
            "Death Star": "Galactic Fortress",
            "Imperial": "Military"
        }
    }
]