[
    {
        "message_id": 320,
        "passage": "Han chases the stormtroopers down a long subhallway. He is\n      yelling and brandishing his laser pistol. The troops reach a\n      dead end and are forced to turn and fight. Han stops a few\n      feet from them and assumes a defensive position. The troops\n      begin to raise their laser guns. Soon all ten troopers are\n      moving into an attack position in front of the lone\n      starpirate. Han's determined look begins to fade as the\n      troops begin to advance. Solo jumps backward as they fire at\n      him.\n\n135",
        "dictionary": {
            "starpirate": "space smuggler",
            "stormtroopers": "armored soldiers"
        }
    },
    {
        "message_id": 321,
        "passage": "Chewbacca runs down the subhallway in a last-ditch attempt\n      to save his bold captain. Suddenly he hears the firing of\n      laser guns and yelling. Around the corner shoots Han, pirate\n      extraordinaire, running for his life, followed by a host of\n      furious stormtroopers. Chewbacca turns and starts running\n      the other way also.\n\n136",
        "dictionary": {
            "stormtroopers": "armed guards",
            "pirate extraordinaire": "brave adventurer",
            "laser guns": "energy weapons"
        }
    },
    {
        "message_id": 322,
        "passage": "Luke fires his laser pistol wildly as he and Leia rush down\n      a narrow subhallway, chased by several stormtroopers.\n\n      They quickly reach the end of the subhallway and race\n      through an open hatchway.\n\n137",
        "dictionary": {
            "stormtroopers": "armed guards",
            "laser pistol": "energy gun",
            "subhallway": "narrow corridor"
        }
    },
    {
        "message_id": 323,
        "passage": "Luke and Leia race through the hatch onto a narrow bridge\n      that spans a huge, deep shaft that seems to go into\n      infinity. The bridge has been retracted into the wall of the\n      shaft, and Luke almost rushes into the abyss. He loses his\n      balance off the end of the bridge as Leia, behind him, takes\n      hold of his arm and pulls him back.\n\n                          LUKE\n                    (gasping)\n                I think we took a wrong turn.\n\n      Blasts from the stormtroopers' laser guns explode nearby\n      reminding them of the oncoming danger. Luke fires back at\n      the advancing troops. Leia reaches over and hits a switch\n      that pops the hatch door shut with a resounding boom,\n      leaving them precariously perched on a short piece of bridge\n      overhang. Laserfire from the troopers continues to hit the\n      steel door.\n\n                          LEIA\n                There's no lock!\n\n      Luke blasts the controls with his laser pistol.\n\n                          LUKE\n                That oughta hold it for a while.\n\n                          LEIA\n                Quick, we've got to get across.\n                Find the control that extends the\n                bridge.\n\n                          LUKE\n                Oh, I think I just blasted it.\n\n      Luke looks at the blasted bridge control while the\n      stormtroopers on the opposite side of the door begin making\n      ominous drilling and pounding sounds.\n\n                          LEIA\n                They're coming through!\n\n      Luke notices something on his stormtrooper belt, when\n      laserfire hits the wall behind him. Luke aims his laser\n      pistol at a stormtrooper perched on a higher bridge overhang\n      across the abyss from them. They exchange fire. Two more\n      troops appear on another overhang, also firing. A trooper is\n      hit, and grabs at his chest.\n\n      Another trooper standing on the bridge overhang is hit by\n      Luke's laserfire, and plummets down the shaft. Troopers move\n      back off the bridge; Luke hands the gun to Leia.\n\n                          LUKE\n                Here, hold this.\n\n      Luke pulls a thin nylon cable from his trooper utility belt.\n      It has a grappler hook on it. A trooper appears on a bridge\n      overhang and fires at Luke and Leia. As Luke works with the\n      rope, Leia returns the laser volley. Another trooper appears\n      and fires at them, as Leia returns his fire as well.\n      Suddenly, the hatch door begins to open, revealing the feet\n      of more troops.\n\n                          LEIA\n                Here they come!\n\n      Leia hits one of the stormtroopers on the bridge above, and\n      he falls into the abyss. Luke tosses the rope across the\n      gorge and it wraps itself around an outcropping of pipes. He\n      tugs on the rope to make sure it is secure, then grabs the\n      princess in his arms. Leia looks at Luke, then kisses him\n      quickly on the lips. Luke is very surprised.\n\n                            LEIA (CONT’D)\n                For luck!\n\n      Luke pushes off and they swing across the treacherous abyss\n      to the corresponding hatchway on the opposite side. Just as\n      Luke and Leia reach the far side of the canyon, the\n      stormtroopers break through the hatch and begin to fire at\n      the escaping duo. Luke returns the fire before ducking into\n      the tiny subhallway.\n\n138",
        "dictionary": {
            "stormtroopers": "imperial soldiers",
            "laser pistol": "energy gun",
            "laserfire": "energy blasts",
            "grappler hook": "rope launcher"
        }
    },
    {
        "message_id": 324,
        "passage": "Ben hides in the shadows of the narrow passageway as several\n      stormtroopers rush past him in the main hallway. He checks\n      to make sure they're gone, then runs down the hallway in the\n      opposite direction. Darth Vader appears at the far end of\n      the hallway and starts after the old Jedi.\n\n139",
        "dictionary": {
            "stormtroopers": "security guards",
            "Jedi": "warrior monks"
        }
    },
    {
        "message_id": 325,
        "passage": "Threepio looks around at the troops milling about the\n      pirateship entry ramp.\n\n                          THREEPIO\n                Where could they be?\n\n      Artoo, plugged into the computer socket, turns his dome left\n      and right, beeping a response.\n\n140",
        "dictionary": {
            "Threepio": "Protocol Officer",
            "Artoo": "Mechanical Assistant"
        }
    },
    {
        "message_id": 326,
        "passage": "Han and Chewbacca run down a long corridor with several\n      troopers hot on their trail.\n\n                          TROOPER\n                Close the blast doors!\n\n      At the end of the hallway, blast doors begin to close in\n      front of them. The young starpilot and his furry companion\n      race past the huge doors just as they are closing, and\n      manage to get off a couple off laserblasts at the pursuing\n      troops before the doors slam shut.\n\n                          TROOPER (CONT’D)\n                Open the blast doors! Open the\n                blast doors!\n\n141",
        "dictionary": {
            "laserblasts": "energy blasts",
            "blast doors": "security gates"
        }
    },
    {
        "message_id": 327,
        "passage": "Ben hurries along one of the tunnels leading to the hangar\n      where the pirateship waits. Just before he reaches the\n      hangar, Darth Vader steps into view at the end of the\n      tunnel, not ten feet away. Vader lights his saber. Ben also\n      ignites his and steps slowly forward.\n\n                          VADER\n                I've been waiting for you, Obi-Wan.\n                We meet again, at last. The circle\n                is now complete.\n\n      Ben Kenobi moves with elegant ease into a classical\n      offensive position. The fearsome Dark Knight takes a\n      defensive stance.\n\n                          VADER (CONT’D)\n                When I left you, I was but the\n                learner; now I am the master.\n\n                          BEN\n                Only a master of evil, Darth.\n\n      The two Galactic warriors stand perfectly still for a few\n      moments, sizing each other up and waiting for the right\n      moment. Ben seems to be under increasing pressure and\n      strain, as if an invisible weight were being placed upon\n      him. He shakes his head and, blinking, tries to clear his\n      eyes.\n\n      Ben makes a sudden lunge at the huge warrior but is checked\n      by a lightning movement of The Sith. A masterful slash\n      stroke by Vader is blocked by the old Jedi. Another of the\n      Jedi's blows is blocked, then countered.\n\n      Ben moves around the Dark Lord and starts backing into the\n      massive starship hangar. The two powerful warriors stand\n      motionless for a few moments with laser swords locked in mid-\n      air, creating a low buzzing sound.\n\n                          VADER\n                Your powers are weak, old man.\n\n                          BEN\n                You can't win, Darth. If you strike\n                me down, I shall become more\n                powerful than you can possibly\n                imagine.\n\n      Their lightsabers continue to meet in combat.\n\n142",
        "dictionary": {
            "Jedi": "Warrior of Justice",
            "Sith": "Dark Warrior",
            "lightsaber": "energy sword"
        }
    },
    {
        "message_id": 328,
        "passage": "Han Solo and Chewbacca, their weapons in hand, lean back\n      against the wall surveying the forward bay, watching the\n      Imperial stormtroopers make their rounds of the hangar.\n\n                          HAN\n                Didn't we just leave this party?\n\n      Chewbacca growls a reply, as Luke and the princess join\n      them.\n\n                          HAN (CONT’D)\n                What kept you?\n\n                          LEIA\n                We ran into some old friends.\n\n                          LUKE\n                Is the ship all right?\n\n                          HAN\n                Seems okay, if we can get to it.\n                Just hope the old man got the\n                tractor beam out of commission.\n\n143",
        "dictionary": {
            "Imperial": "Government",
            "stormtroopers": "soldiers",
            "tractor beam": "laser beam"
        }
    },
    {
        "message_id": 329,
        "passage": "Vader and Ben Kenobi continue their powerful duel. As they\n      hit their lightsabers together, lightning flashes on impact.\n      Troopers look on in interest as the old Jedi and Dark Lord\n      of The Sith fight. Suddenly Luke spots the battle from his\n      group's vantage point.\n\n                          LUKE\n                Look!\n\n      Luke, Leia, Han, and Chewie look up and see Ben and Vader\n      emerging from the hallways on the far side of the docking\n      bay.\n\n144",
        "dictionary": {
            "The Sith": "The Dark Side",
            "lightsabers": "energy blades",
            "Jedi": "Guardians",
            "Dark Lord": "Evil Master",
            "Ben": "Obi-Wan",
            "Vader": "Darth"
        }
    }
]