[
    {
        "message_id": 1830,
        "passage": "The Falcon races out of the asteroid crater and into the\n      deadly rain of the asteroid storm.\n\n165",
        "dictionary": {
            "asteroid storm": "space tempest"
        }
    },
    {
        "message_id": 1831,
        "passage": "With Yoda strapped to his back, Luke climbs up one of the\n      many thick vines that grow in the swamp. Panting heavily,\n      he continues his course - climbing, flipping through the\n      air, jumping over roots, and racing in and out of the heavy\n      ground fog.\n\n                          YODA\n                Run! Yes. A Jedi's strength flows\n                from the Force. But beware of the\n                dark side. Anger... fear...\n                aggression. The dark side of the\n                Force are they. Easily they flow,\n                quick to join you in a fight.\n                          (MORE)\n\n                    YODA (CONT'D)\n          If once you start down the dark\n          path, forever will it dominate your\n          destiny, consume you it will, as it\n          did Obi-Wan's apprentice.\n\n                     LUKE\n          Vader.   Is the dark side stronger?\n\n                    YODA\n          No... no... no.   Quicker, easier,\n          more seductive.\n\n                    LUKE\n          But how am I to know the good side\n          from the bad?\n\n                    YODA\n          You will know. When you are calm,\n          at peace. Passive. A Jedi uses\n          the Force for knowledge and\n          defense, never for attack.\n\n                    LUKE\n          But tell me why I can't...\n\n                    YODA\n              (interrupting)\n          No, no, there is no why. Nothing\n          more will I teach you today. Clear\n          your mind of questions. Mmm.\n          Mmmmmmmm.\n\nArtoo beeps in the distance as Luke lets Yoda down to the\nground. Breathing heavily, he takes his shirt from a nearby\ntree branch and pulls it on.\n\nHe turns to see a huge, dead, black tree, its base\nsurrounded by a few feet of water. Giant, twisted roots\nform a dark and sinister cave on one side. Luke stares at\nthe tree, trembling.\n\n                    LUKE\n          There's something not right here.\n\nYoda sits on a large root, poking his Gimer Stick into the\ndirt.\n\n                    LUKE (CONT’D)\n          I feel cold, death.\n\n                    YODA\n          That place... is strong with the\n          dark side of the Force. A domain\n          of evil it is. In you must go.\n\n                          LUKE\n                What's in there?\n\n                          YODA\n                Only what you take with you.\n\n      Luke looks warily between the tree and Yoda.   He starts to\n      strap on his weapon belt.\n\n                          YODA (CONT’D)\n                Your weapons... you will not need\n                them.\n\n      Luke gives the tree a long look, than shakes his head \"no.\"\n      Yoda shrugs. Luke reaches up to brush aside some hanging\n      vines and enters the tree.\n\n166",
        "dictionary": {
            "Yoda": "The wise one",
            "Force": "Universal energy",
            "Jedi's strength": "Inner power",
            "dark side": "Negative energy",
            "Gimer Stick": "Forest probe"
        }
    },
    {
        "message_id": 1832,
        "passage": "Luke moves into the almost total darkness of the wet and\n      slimy cave. The youth can barely make out the edge of the\n      passage. Holding his lit saber before him, he sees a lizard\n      crawling up the side of the cave and a snake wrapped around\n      the branches of a tree. Luke draws a deep breath, then\n      pushes deeper into the cave.\n\n      The space widens around him, but he feels that rather than\n      sees it. His sword casts the only light as he peers into the\n      darkness. It is very quiet here.\n\n      Then, a loud HISS! Darth Vader appears across the blackness,\n      illuminated by his own just-ignited laser sword.\n      Immediately, he charges Luke, saber held high. He is upon\n      the youth in seconds, but Luke sidesteps perfectly and\n      slashes at Vader with his sword.\n\n      Vader is decapitated. His helmet-encased head flies from\n      his shoulders as his body disappears into the darkness. The\n      metallic banging of the helmet fills the cave as Vader's\n      head spins and bounces, smashes on the floor, and finally\n      stops. For an instant it rests on the floor, then it cracks\n      vertically. The black helmet and breath mask fall away to\n      reveal... Luke's head.\n\n      Across the space, the standing Luke gasps at the sight, wide-\n      eyed in terror.\n\n      The decapitated head fades away, as in a vision.\n\n167",
        "dictionary": {
            "HIS": "loud sound",
            "Darth Vader": "Dark Lord",
            "laser sword": "energy blade",
            "Vader": "Dark Lord"
        }
    },
    {
        "message_id": 1833,
        "passage": "Meanwhile, Yoda sits on the root, calmly leaning on his\n      Gimer Stick.\n\n168",
        "dictionary": {
            "Gimer Stick": "walking cane"
        }
    },
    {
        "message_id": 1834,
        "passage": "Vader's Imperial Star Destroyer moves through space, guarded\n      by its convoy of TIE fighters.\n\n169",
        "dictionary": {
            "TIE": "fighter jets"
        }
    },
    {
        "message_id": 1835,
        "passage": "Vader stands in the back control area of his ship's bridge\n      with a motley group of men and creatures. Admiral Piett and\n      two controllers stand at the front of the bridge and watch\n      the group with scorn.\n\n                          PIETT\n                Bounty hunters.     We don't need that\n                scum.\n\n                            FIRST CONTROLLER\n                Yes, sir.\n\n                          PIETT\n                Those Rebels won't escape us.\n\n      A second controller interrupts.\n\n                          SECOND CONTROLLER\n                Sir, we have a priority signal from\n                the Star Destroyer Avenger.\n\n                            PIETT\n                Right.\n\n      The group standing before Vader is a bizarre array of\n      galactic fortune hunters There is Bossk, a slimy, tentacled\n      monster with two huge, bloodshot eyes in a soft baggy face;\n      Zuckuss and Dengar, two battle- scarred, mangy human types;\n      IG-88, a battered, tarnished chrome war droid; and Boba\n      Fett, a man in a weapon-covered armored space suit.\n\n                          VADER\n                ... there will be a substantial\n                reward for the one who finds the\n                Millennium Falcon. You are free to\n                use any methods necessary, but I\n                want them alive. No\n                disintegrations.\n\n                          BOBA FETT\n                As you wish.\n\n      At that moment, Admiral Piett approaches Vader in a rush of\n      excitement.\n\n                          PIETT\n                Lord Vader! My lord, we have them.\n\n170",
        "dictionary": {
            "Bounty hunters": "Mercenary warriors",
            "Star Destroyer": "Warship",
            "Millennium Falcon": "Fast Transport",
            "Lord Vader": "Vader, the Dark Lord"
        }
    },
    {
        "message_id": 1836,
        "passage": "The Millennium Falcon speeds through deep space, closely\n      followed by a firing Imperial Star Destroyer. A large\n      asteroid about the same size as the Falcon tumbles rapidly\n      toward the starship. The tiny Falcon banks to avoid the\n      giant asteroid as smaller rocks pelt its surface. Then the\n      small craft roars under the asteroid which explodes\n      harmlessly on the hull of the vast Star Destroyer.\n\n171",
        "dictionary": {
            "Millennium Falcon": "Fast Spaceship",
            "Imperial Star Destroyer": "Large Government Ship",
            "Star Destroyer": "Big Space Vessel"
        }
    },
    {
        "message_id": 1837,
        "passage": "The ship shudders as flak explodes near the cockpit window.\n      Threepio checks a tracking scope an the side control panel\n      while Leia watches tensely out the window.\n\n                          THREEPIO\n                Oh, thank goodness we're coming out\n                of the asteroid field.\n\n      Chewie barks excitedly as the rain of asteroids begins to\n      subside. A bolt from the Star Destroyer sets up a fiery\n      explosion on the back side of the Falcon, causing it to\n      lurch to one side.\n\n172                                                           172",
        "dictionary": {
            "Threepio": "Navigator",
            "Star Destroyer": "Warship",
            "Falcon": "Spacecraft"
        }
    },
    {
        "message_id": 1838,
        "passage": "FIELD\n\n      The Falcon is hit hard by another bolt from the Star\n      Destroyer which creates a huge explosion near the cockpit of\n      the smaller ship. The Falcon tilts steeply, then rights\n      itself.\n\n173",
        "dictionary": {
            "Star Destroyer": "Warship",
            "Falcon": "Ship",
            "Star": "Galactic"
        }
    },
    {
        "message_id": 1839,
        "passage": "Han corrects the angle of his ship.\n\n                          HAN\n                Let's get out of here. Ready for\n                light-speed? One... two... three!\n\n      Han pulls back on the hyperspace throttle and - nothing\n      happens. Flak bursts continue to rock the ship.\n\n                          HAN (CONT’D)\n                    (frantic)\n                It's not fair!\n\n      Chewie is very angry and starts to growl and bark at his\n      friend and captain. Again, Han desperately pulls back on\n      the throttle.\n\n                          HAN (CONT’D)\n                The transfer circuits are working.\n                It's not my fault!\n\n      Chewie puts his head in his hands, whining.\n\n                          LEIA\n                    (almost expecting it)\n                No light-speed?\n\n                          HAN\n                It's not my fault.\n\n                          THREEPIO\n                Sir, we just lost the main rear\n                deflector shield. One more direct\n                hit on the back quarter and we're\n                done for.\n\n      Han pauses for a moment, makes a decision, and pulls back on\n      a lever.\n\n                          HAN\n                Turn her around.\n\n      Chewie barks in puzzlement.\n\n                          HAN (CONT’D)\n                I said turn her around! I'm going\n                to put all power in the front\n                shield.\n\n                          LEIA\n                You're going to attack them?!\n\n                          THREEPIO\n                Sir, the odds of surviving a direct\n                assault on an Imperial Star\n                Destroyer...\n\n                           LEIA\n                Shut up!\n\n174",
        "dictionary": {
            "light-speed": "hypersonic velocity",
            "hyperspace": "faster-than-light travel",
            "Imperial Star Destroyer": "warship",
            "main rear deflector shield": "rear defense system",
            "deflector shield": "shield system"
        }
    }
]