[
    {
        "message_id": 0,
        "passage": "Star Wars: Episode 1:The Phantom Menace\n\n\n\nTITLE CARD : A long time ago in a galaxy far, far away....\n\nA vast sea of stars serves as the backdrop for the main title, followed by\na roll up, which crawls up into infinity.\n\nEPISODE 1 THE PHANTOM MENACE\n\nTurmoil has engulfed the Galactic Republic. The taxation of trade routes to\noutlaying star systems is in dispute.\nHoping to resolve the matter with a blockade of deadly battleships, the\ngreedy Trade Federation has stopped all shipping to the small planet of\nNaboo.\nWhile the congress of the Republic endlessly debates this alarming chain of\nevents, the Supreme Chancellor has secretly dispatched two Jedi Knights,\nthe guardians of peace and justice in the galaxy, to settle the\nconflict.....\n\nPAN DOWN to reveal a small space cruiser heading TOWARD CAMERA at great\nspeed. PAN with the cruiser as it heads towardthe beautiful green planet of\nNaboo, which is surrounded by hundreds of Trade Federation battleships.",
        "dictionary": {
            "Galactic Republic": "United Worlds",
            "Jedi Knights": "Peacekeepers",
            "Supreme Chancellor": "Head of State",
            "outlaying star systems": "distant star systems"
        }
    },
    {
        "message_id": 1,
        "passage": "In the cockpit of the cruise, the CAPTAIN and PILOT maneuver closer to one\nof the battleships.\n\nQUI-GON : (off screen voice) Captain.\n\nThe Captain turns to an unseen figure sitting behind her.\n\nCAPTAIN : Yes, sir?\nQUI-GON : (V.O) Tell them we wish to board at once.\nCAPTAIN : Yes, sir.\n\nThe CAPTAIN looks to her view screen, where NUTE GUNRAY, a Neimoidian trade\nviceroy, waits for a reply.\n\nCAPTAIN : (cont'd) With all due respect for the Trade Federation, the\nAmbassodors for the Supreme Chancellor wish to board immediately.\nNUTE : Yes, yes, of coarse...ahhh...as you know, our blockade is perfectly\nlegal, and we'd be happy to recieve the Ambassador...Happy to.\n\nThe screen goes black. Out the cockpit window, the sinister battleship\nlooms ever closer.",
        "dictionary": {
            "QUI-GON": "General",
            "NUTE GUNRAY": "Ambassador",
            "Neimoidian": "Alien"
        }
    },
    {
        "message_id": 2,
        "passage": "The small space cruiser docks in the enormous main bay of the Federation\nbattleship.",
        "dictionary": {}
    },
    {
        "message_id": 3,
        "passage": "A PROTOCOL DROID, TC-14, waits at the door to the docking bay. Two WORKER\nDROIDS, PK-4 and EG-9 watch.\n\nPK-4 : They must be important if the Viceroy sent one of those useless\nprotocol gearheads to greet them.\n\nThe door opens, and the Republic cruiser can be seen in the docking bay.\nTwo darkly robed figures are greeted by TC-14.\n\nTC-14 : I'm TC-14 at your service. This way, please.\n\nThey move off down the hallway.\n\nEG-9 : A Republic cruiser! That's trouble...don't you think?\nPR-4 : I'm not made to think.",
        "dictionary": {
            "WORKER DROIDS": "Mechanical Servants",
            "PROTOCOL DROID": "Communication Assistant",
            "Viceroy": "Governor",
            "Republic cruiser": "Government Ship"
        }
    },
    {
        "message_id": 4,
        "passage": "A door slides open, and the two cloaked shapes are led PAST CAMERA into the\nformal conference room by TC-14.\n\nTC-14 : I hope you honoured sirs with the most comfortable here. My master\nwill be with you shortly.\n\nThe droid bows before OBI-WAN KENOBI and QUI- GON JINN. He backs out the\ndoor and it closes. The JEDI lower their hoods and look out a large window\nat the lush green planet of Naboo. QUI-GON sixty years old, has long white\nhair in a ponytail. He is tall and striking, with blue eyes. OBI-WAN is\ntwenty five, with very short brown hair, pale skin, and blue eyes. Several\nexotic, bird-like creatures SING in a cage near the door.\n\nOBI-WAN : I have a bad feeling about this.\nQUI-GON : I don't sense anything.\nOBI-WAN : It's not about the mission, Master, it's\nsomethging...elsewhere...elusive.\nQUI-GON : Don't center on your anxiety, Obi-Wan. Keep your concentration\nhere and now where it belongs.\nOBI-WAN : Master Yoda says I should be mindful of the future...\nQUI-GON : .....but not at the expense of the moment. Be mindful of the\nliving Force, my young Padawan.\nOBI-WAN : Yes, Master...how do you think the trade viceroy will deal with\nthe chancellor's demands?\nQUI-GON : These Federation types are cowards. The negotiations will be\nshort.",
        "dictionary": {
            "JEDI": "Knights of the Order",
            "Padawan": "Apprentice",
            "Naboo": "Exotic Planet",
            "Master Yoda": "Wise Mentor"
        }
    },
    {
        "message_id": 5,
        "passage": "NUTE GUNRAY and DAULTRAY DOFINE stand, stunned, before TC-14.\n\nNUTE : (shaken) What?!? What did you say?\nTC-14 : The Ambassadors are Jedi Knights, I believe.\nDOFINE : I knew it! They were sent to force a settlement, eh. Blind me,\nwe're done for!",
        "dictionary": {
            "Jedi Knights": "Galactic Guardians",
            "Ambassadors": "Diplomats"
        }
    },
    {
        "message_id": 6,
        "passage": "A hologram of NUTE , surrounded by BATTLE DROIDS, appears in the conference\nroom hallway.\n\nNUTE : They must be dead by now. Blast, what's left of them.\n\nThe hologram fades off, as a BATTLE DROID, OWO-1, cautiously opens the\ndoor. A deadly green cloud billows from the room. BATTLE DROIDS cock their\nweapons as a figure stumbles out of the smoke. It is TC-14 , carrying the\ntray of drinks.\n\nTC14 : Oh, excuse me, so sorry.\n\nThe PROTOCOL DROID passes the armed camp just as two flashing laser swords\nfly out of the deadly fog, cutting down several BATTLE DROIDS before they\ncan fire.",
        "dictionary": {
            "BATTLE DROIDS": "Robot Soldiers",
            "PROTOCOL DROID": "Service Android",
            "NUTE": "Commander",
            "TC-14": "Service Droid",
            "OWO-1": "Robot Trooper"
        }
    },
    {
        "message_id": 7,
        "passage": "The bridge is a cocophony of alarms. NUTE and RUNE watch OWO-1 on the\nviewscreen.\n\nOWO-1 : Not sure exactly what...\n\nOWO-1 is suddenly cut in half in mid-sentence. RUNE gives NUTE a worried\nlook.\n\nNUTE : What in blazes is going on down there?\nRUNE : Have you ever encountered a Jedi Knight before, sir?\nNUTE : Well, not exactly, but I don't...(panicked) Seal off the bridge.\nRUNE : That won't be enough, sir.\n\nThe doors to the bridge SLAM shut.\n\nNUTE : I want destroyer droids up here at once!!!\nRUNE : We will not survive this.",
        "dictionary": {
            "Jedi Knight": "skilled warrior",
            "destroyer droids": "attack robots"
        }
    },
    {
        "message_id": 8,
        "passage": "QUI-GON cuts several BATTLE DROIDS in half, creating a shower of sparks and\nmetal parts. OBI-WAN raises his hand, sending several BATTLE DROIDS\ncrashing into the wall.\n\nQUI-GON makes his way to the bridge door and begins to cut through it.",
        "dictionary": {
            "BATTLE DROIDS": "Robot Soldiers",
            "QUI-GON": "Master Jedi",
            "OBI-WAN": "Young Jedi"
        }
    },
    {
        "message_id": 9,
        "passage": "The CREW is very nervous as sparks start flying around the bridge door.\nQUI-GON and OBI-WAN are on the view screen.\n\nNUTE : Close the blast doors!!!\n\nThe huge, very thick blast door slams shut, followed by a second door, then\na third. There is a hissing sound as the huge doors seal shut. QUI-GON tabs\nthe door with his sword. The screen goes black as a red spot appears in the\ncenter of the blast door.\n\nRUNE : ...They're still coming through!\n\nOn the door, chunks of molten metal begin to drop away.\n\nNUTE : Impossible!! This is impossible!!\nRUNE : Where are those destroyer droids?!",
        "dictionary": {
            "CREW": "crew members",
            "QUI-GON": "General",
            "OBI-WAN": "Admiral",
            "NUTE": "Captain",
            "RUNE": "Lieutenant"
        }
    }
]