[
    {
        "message_id": 1090,
        "passage": "With the SANDY PLANET OF JAKKU as backdrop, Troop Transports\n          and Kylo Ren's Shuttle approach a massive STAR DESTROYER.",
        "dictionary": {
            "SANDY PLANET OF JAKKU": "Desert Planet",
            "STAR DESTROYER": "Warship"
        }
    },
    {
        "message_id": 1091,
        "passage": "Poe, shackled, is ushered from the transport through the\n          hangar. He is awed by the imposing space.\n\n                          POE\n           All right. All right!\n          Our Stormtrooper passes, moves fast:",
        "dictionary": {
            "Stormtrooper": "Elite Soldier",
            "All right": "Alright then"
        }
    },
    {
        "message_id": 1092,
        "passage": "Our Stormtrooper enters the dark, vehicle. He removes his\n          helmet. His head comes up and we PUSH IN ON HIS FACE FOR\n          THE FIRST TIME. This is FN-2187. He is 23, likable. But\n          in this moment, terrified, desperate.\n          After a beat, behind him, CAPTAIN PHASMA enters. FN-2187\n          knows he's in trouble.\n\n                          CAPTAIN PHASMA\n           FN-2187. Submit your blaster for\n           inspection.\n\n                          FN-2187\n           Yes, Captain.\n\n                          CAPTAIN PHASMA\n           And who gave you permission to remove\n           that helmet?\n\n                          FN-2187\n           I'm sorry, Captain.\n\n                          CAPTAIN PHASMA\n           Report to my division at once.\n\n                         \n\n                         \n\n                          (CONTINUED)\n\n                         CONTINUED:\n          Phasma heads off. Shattered, FN-2187 replaces his helmet.\n\n                          CUT TO:",
        "dictionary": {
            "Stormtrooper": "Imperial Soldier",
            "FN-2187": "Soldier 2187"
        }
    },
    {
        "message_id": 1093,
        "passage": "A metal sheet is pulled open to reveal the wrapped up face\n          of A SCAVENGER, perhaps alien, in GOGGLES, FACE MASK and\n          GLOVES. Backpack with a STAFF strapped to it. Uses TOOLS\n          to remove various MECHANISMS from inside the wall. We are\n          in an upside-down, canted CORRIDOR. The Scavenger finds a\n          valuable piece, drops it in a SATCHEL.\n          Swings the bag back and begins CLIMBING DOWN on a cable,\n          between treacherous WALLS OF MACHINERY, headed to:",
        "dictionary": {
            "SCAVENGER": "Treasure Hunter",
            "GOGGLES": "Goggles",
            "FACE MASK": "Respirator",
            "GLOVES": "Protective Handwear",
            "STAFF": "Pole",
            "TOOLS": "Equipment",
            "MECHANISMS": "Components",
            "CORRIDOR": "Tunnel",
            "SATCHEL": "Bag",
            "CLIMBING DOWN": "Descending"
        }
    },
    {
        "message_id": 1094,
        "passage": "Alone and tiny in this massive, sideways wreck, the Scavenger\n          descends, climbing down a two-hundred foot-long cable. LANDS\n          HARD onto rusty metal.",
        "dictionary": {}
    },
    {
        "message_id": 1095,
        "passage": "The Scavenger carries the satchel and another large, found\n          piece, over enormous pipes in the vast space, heads through\n          the dust toward a distant SLIT OF SUNLIGHT.",
        "dictionary": {
            "SLIT OF SUNLIGHT": "beam of light"
        }
    },
    {
        "message_id": 1096,
        "passage": "The Scavenger arrives from the darkness and pulls off goggles\n          and gear, revealing the grimy face of a beautiful, young\n          WOMAN. This is REY, 19.\n          She opens her canteen, shakes out the two final drops into\n          her mouth. HITS THE SIDE of the canteen again and again for\n          whatever she can get. CUT WIDE:\n          Rey is rendered minuscule, standing at the bottom of an EPIC\n\n          ENGINE OF A DECAYING, CRASHED STAR DESTROYER -- DISTANT SOUND\n          of her canteen-hitting. She sets her things on a piece of\n          sheet metal and sits next to it, sliding down the sand dune.\n          She RIDES DOWN THE MOUNTAIN OF SAND. WE HOLD FOR A LONG\n          TIME, looking down, as she recedes from us, toward the distant\n          SALT FLATS below. Random SCATTERED DEBRIS. Her SPEEDER,\n          tiny from here.\n          Rey moves to her junker SPEEDER, jumps on, fires the sputtery\n          engine and DRIVES OFF.",
        "dictionary": {
            "WOMAN": "female",
            "REY": "Alexis",
            "EPIC": "enormous",
            "STAR DESTROYER": "spaceship",
            "SPEEDER": "vehicle",
            "SALT FLATS": "desert landscape"
        }
    },
    {
        "message_id": 1097,
        "passage": "Rey races along the desert floor: a GRAVEYARD OF CRASHED\n\n          SPACESHIPS.",
        "dictionary": {
            "GRAVEYARD OF CRASHED SPACESHIPS": "Wrecked Spacecraft Cemetery"
        }
    },
    {
        "message_id": 1098,
        "passage": "Rey's speeder PASSES us, heading for a dusty, desert town.\n          Refueling, small trade, scavengers.\n\n                         \n\n                          (CONTINUED)\n\n                         CONTINUED:\n          CRASH! Rey's sack carrying her heavy FOUND OBJECTS hits the\n          sand. Working like a tough seaman, Rey hauls the sack from\n          her speeder toward the town.",
        "dictionary": {
            "FOUND OBJECTS": "scavenged relics",
            "speeder": "vehicle"
        }
    },
    {
        "message_id": 1099,
        "passage": "TIGHT ON REY'S HANDS as she SCRUBS CLEAN her day's salvage.\n          Rey glances up: she looks at an old woman, also cleaning\n          some salvage.\n          Rey watches her, gets lost in the simple moment. A small,\n          passing alien UNDERLING barks something to her in another\n          language. She returns to work.",
        "dictionary": {
            "SCRUBS": "cleans",
            "UNDERLING": "assistant"
        }
    }
]