[
    {
        "message_id": 1080,
        "passage": "CLOSE ON A HAND: a small LEATHER SACK is placed in the palm.\n          The hand closes. Another OLDER HAND covers it.\n          In a primitive HUT, an old explorer, LOR SAN TEKKA, (rugged,\n          kind) has handed the mysterious sack to POE DAMERON (32, in\n          a pilot's jacket). Poe has charisma, a natural spark:\n\n           LOR SAN TEKKA\n           This will begin to make things right.\n           I've traveled too far, and seen too\n           much, to ignore the despair in the\n           galaxy. Without the Jedi, there can\n           be no balance in the Force.\n\n                          POE\n           Well, because of you now we have a\n           chance. The General's been after\n           this for a long time.\n\n           LOR SAN TEKKA\n           \"The General.\" To me, she's royalty.\n           Well, she certainly is that.\n\n                          POE\n          BB-8 ENTERS FRANTIC, BEEPS. Concerned, Poe turns to Lor San\n          Tekka.\n\n                          POE (CONT'D)\n           We've got company.",
        "dictionary": {
            "LEATHER SACK": "Travel Pouch",
            "OLDER HAND": "Weathered Hand",
            "HUT": "Shelter",
            "LOR SAN TEKKA": "Old Explorer",
            "POE DAMERON": "Young Pilot",
            "JEDI": "Guardians",
            "ROYALTY": "Noble Family"
        }
    },
    {
        "message_id": 1081,
        "passage": "The men exit fast. Poe moves TO CAMERA, raises QUADNOCULARS.\n          POE'S POV: LIGHTS on the horizon -- approaching ENEMY SHIPS.\n          POE lowers the quadnocs -- PUSH IN ON HIS UNNERVED EYES. A\n\n          GROWING, FRIGHTENING THUNDER.\n\n                          POE\n           You have to hide.\n\n           LOR SAN TEKKA\n           You have to leave. Go!\n          Poe turns to him. Conflicted. Finally nods, hurries off.\n          BB-8 follows.",
        "dictionary": {
            "QUADNOCULARS": "Binoculars",
            "ENEMY SHIPS": "Adversarial Vessels"
        }
    },
    {
        "message_id": 1082,
        "passage": "TRACK FAST with Poe as he and BB-8 hurry through the village,\n          various ARMED VILLAGERS taking position, prepared to defend.",
        "dictionary": {
            "TRACK FAST": "Rush",
            "BB-8": "Robot Companion",
            "ARMED VILLAGERS": "Defending Citizens"
        }
    },
    {
        "message_id": 1083,
        "passage": "A ROAR of WIND and DUST: the TRANSPORTS LAND. Stormtroopers\n          come out FIRING BLASTERS -- the VILLAGERS FIRE BACK -- many\n          are HIT!",
        "dictionary": {
            "ROAR of WIND and DUST": "loud storm",
            "TRANSPORTS": "vehicles",
            "BLASTERS": "guns",
            "VILLAGERS": "residents",
            "FIRING": "shooting"
        }
    },
    {
        "message_id": 1084,
        "passage": "Poe runs to an X-WING fighter, parked at a distance from the\n          village, hidden behind a ROCK OUTCROPPING.\n\n                          POE\n           Come on, BB-8! Hurry!\n          Poe sends BB-8 into the droid socket / co-pilot seat -- he\n          moves to the cockpit -- the CONTROLS COME TO LIFE. As the\n          CANOPY CLOSES, Poe shoots a quick look back: the ENEMY ARRIVES\n\n          IN THE DISTANCE.\n          Poe urgently works the controls -- BB-8 BEEPS.\n          The X-WING LANDING LIGHTS COME ON, ENGINES WHINE TO LIFE!\n          But just then:\n          Poe's ship is suddenly HIT BY BLASTERFIRE! Poe turns to\n          look: two STORMTROOPERS CHARGE HIS WAY, FIRING!\n\n                          POE (CONT'D)\n           I see 'em!\n          BB-8 BEEPS nervously as Poe GRABS HIS CONTROLS and FIRES AT\n          THEM, using the X-wing's drop-down antipersonnel blaster!\n          The two Troopers are BLOWN AWAY in the large BLAST HITS!\n          Poe tries to start the ship now, but the ENGINES SPUTTER.\n          Concerned, he opens his canopy, jumps down, moves to the\n          back of his ship: BAD DAMAGE ON THE REAR ENGINE PANEL.\n          They're in trouble.",
        "dictionary": {
            "X-WING": "fighter jet",
            "ROCK OUTCROPPING": "hill",
            "CONTROLS COME TO LIFE": "systems activate",
            "CANOPY CLOSES": "cockpit closes",
            "ENEMY ARRIVES": "opponents approach",
            "X-WING LANDING LIGHTS COME ON": "landing lights turn on",
            "ENGINES WHINE TO LIFE": "engines start",
            "STORMTROOPERS": "armored soldiers",
            "BLASTERFIRE": "machine gun fire",
            "X-wing's drop-down antipersonnel blaster": "ship's defense system"
        }
    },
    {
        "message_id": 1085,
        "passage": "Lor San Tekka moves sadly through the village as STORMTROOPERS\n          wielding FLAME THROWERS destroy structures. Surrendering\n          Villagers are ROUNDED UP. Penned ANIMALS panic.",
        "dictionary": {
            "STORMTROOPERS": "military forces",
            "FLAME THROWERS": "incendiary devices",
            "ROUNDED UP": "gathered together",
            "PENNED ANIMALS": "confined animals"
        }
    },
    {
        "message_id": 1086,
        "passage": "Back at the X-wing, Poe kneels beneath his ship, pulls from\n          the leather sack a SMALL, OLD ARTIFACT which he inserts into\n          BB-8 -- the droid's MULTI-READER ENVELOPS it.\n\n                          POE\n           You take this. It's safer with you\n           than it is with me. You get as far\n           away from here as you can. Do you\n           hear me?\n           (BB-8 BEEPS, hesitates)\n           I'll come back for you! It will be\n           alright.\n\n                         \n\n                         \n          BB-8 watches Poe run off. BEEP-WHINES nervously, then turns\n          and heads off. Turns back once to look at Poe, then ROLLS\n          AWAY. Poe uses his blaster rifle to fire at incoming troopers\n          from cover.",
        "dictionary": {
            "X-wing": "fighter jet",
            "MULTI-READER ENVELOPS": "contains",
            "BEEPS": "beeps",
            "BEEP-WHINES": "whimpers",
            "ROLLS AWAY": "runs off"
        }
    },
    {
        "message_id": 1087,
        "passage": "The Troopers and villagers in battle -- as one Trooper is\n          HIT and goes down. Another -- OUR TROOPER -- KNEELS to help.\n          The hit trooper raises a torn, bloody glove -- his HUMAN\n          HAND visible -- and MARKS OUR STORMTROOPER'S MASK WITH BLOOD\n          just before he dies. Our Trooper, stands -- overwhelmed by\n          the battle.\n\n          AN IMPOSING SHUTTLE CRAFT -- VERTICAL WINGSPAN 90 FEET TALL --\n\n          LANDS NEAR THE TRANSPORT VEHICLES.\n          The shuttle craft door OPENS -- through the wind and smoke,\n          KYLO REN exits the ship: a TALL, DARK FIGURE, he strides\n          through the chaos toward San Tekka.\n          A senior Trooper moves to our blood-marked Trooper, and orders\n\n                         HIM:\n\n                          SENIOR TROOPER\n           Stay here.\n          Our Trooper nods.\n          Kylo Ren stops before the outraged Lor San Tekka, dwarfing\n          him. Only now does it become apparent that Kylo Ren wears a\n          DARK MASK, marked by battle. Inset metal lines reflect FIRE.\n\n                          KYLO REN\n           Look how old you've become.\n\n           LOR SAN TEKKA\n           Something far worse has happened to\n           you.\n          Our blood-marked TROOPER is placed in line with other\n          stormtroopers.\n\n                          KYLO REN\n           You know what I've come for.\n\n                         \n\n                         \n\n                          (CONTINUED)\n\n          CONTINUED: LOR SAN TEKKA\n           I know where you come from. Before\n           you called yourself Kylo Ren.\n\n                          KYLO REN\n           The map to Skywalker. We know you've\n           found it, and now you're going to\n           give it to the First Order.\n          Adjacent to the village, Poe enters frame -- sees the Ren/San\n          Tekka exchange continue.\n\n           LOR SAN TEKKA\n           The First Order rose from the dark\n           side... you did not.\n\n                          KYLO REN\n           I'll show you the dark side.\n\n           LOR SAN TEKKA\n           You may try, but you cannot deny the\n           truth that is your family.\n          Suddenly Kylo Ren raises his LIGHTSABER -- IGNITES IT --\n\n          PERPENDICULAR SMALLER BLADES AT THE HILT, A UNIQUE BUZZ --\n\n          YELLOW/RED ENERGY, SPITTING SPARKS AND SMOKE --\n\n                          KYLO REN\n           You're so right.\n          And as he RIPS IT DOWN ACROSS SAN TEKKA!\n          Poe, RUNNING, SEES THIS AND YELLS, AIMS HIS BLASTER AND FIRES\n          AT KYLO REN! Instantly:\n          Kylo Ren RAISES HIS HAND -- POE'S BLAST FREEZES -- THE BOLT\n\n          OF ENERGY STRAINING AND VIBRATING IN MID AIR!\n          Kylo Ren sees Poe, who suddenly CANNOT MOVE, but strains to.\n          He is grabbed by Stormtroopers who drag him past the\n          VIBRATING, FROZEN BLAST, to Kylo Ren.\n          A Stormtrooper begins a brutal PAT DOWN. Kylo Ren moves\n          closer. Poe just glares. The Stormtrooper KICKS OUT Poe's\n          legs -- he lands hard on his knees.\n          Kylo Ren kneels to look at Poe.\n\n                          POE\n           So who talks first? You talk first?\n\n                          KYLO REN\n           The old man gave it to you.\n\n                          POE\n\n                          (INDICATES KYLO'S\n\n                          MASK)\n           It's just very hard to understand\n           you with all the...\n\n                         \n\n                         \n\n                         \n\n                          (CONTINUED)\n\n                         CONTINUED:\n\n                          KYLO REN\n\n                          (TO TROOPERS)\n           Search him.\n\n                          POE\n           ... Apparatus.\n          The Troopers roughly pull Poe away. A Stormtrooper begins a\n          brutal PAT DOWN. Kylo Ren moves closer.\n          Poe just glares as the pat down ends.\n\n                          STORMTROOPER #1\n           Nothing, sir.\n\n                          KYLO REN\n           Put him on board.\n          Kylo Ren regards the Stormtroopers with the rounded up\n          Villagers, then turns to the CHROME-SKINNED, FEMALE BLACK-\n\n          CAPED HEAD STORMTROOPER, CAPTAIN PHASMA.\n\n                          CAPTAIN PHASMA\n           Sir, the villagers.\n\n                          KYLO REN\n           Kill them all.\n          Phasma nods, steps forward:\n\n                          CAPTAIN PHASMA\n           On my command!\n          The Troopers, including OURS, aim at the Villagers.\n\n           CAPTAIN PHASMA (CONT'D)\n           Fire!\n          Poe is roughly PULLED into a transport ship, the ramp LIFTS.\n          All around our Trooper BLASTERFIRE ERUPTS -- but we're WIDE\n          ENOUGH to see he ISN'T FIRING. PUSH IN until the FIRING\n          STOPS. All the Stormtroopers SPREAD OUT TO SEARCH -- except\n          ours.\n          Kylo Ren heads back toward his ship. But then he STOPS.\n          Feels something. TURNS AND LOOKS AT OUR STORMTROOPER for a\n          LONG MOMENT. Our Trooper can barely meet his gaze; knows\n          he's doomed.\n          Kylo Ren then heads off -- passes the FROZEN BLAST, which,\n          after a beat, GOES FREE AND SLAMS INTO A NEARBY STRUCTURE,\n          scaring the hell out of our Stormtrooper.",
        "dictionary": {
            "HUMAN HAND": "Human Flesh",
            "STORMTROOPER'S MASK": "Warrior's Helmet",
            "DARK MASK": "Shadowed Face",
            "LIGHTSABER": "Energy Blade",
            "FIRST ORDER": "Imperial Empire"
        }
    },
    {
        "message_id": 1088,
        "passage": "A Stormtrooper climbs down from the cockpit of Poe's X-wing,\n\n                         BACKS AWAY:\n\n                         \n\n                         \n\n                          (CONTINUED)\n\n                         CONTINUED:\n\n                          STORMTROOPER #2\n           Nothing here. Go ahead!\n          Three other Stormtroopers FIRE LASER CANNONS at the X-wing --\n          destroying the ship in a LARGE EXPLOSION.",
        "dictionary": {
            "Stormtrooper": "Imperial Soldier",
            "X-wing": "Fighter Jet"
        }
    },
    {
        "message_id": 1089,
        "passage": "BB-8 rolls across the sand, looks back: the X-wing FIREBALL.\n          BB-8, afraid, continues on his own in a mysterious, dark\n          desert. We see a FORM -- an animal, its RED EYES LIFTING\n          from the sand, watching the rolling droid, who just keeps\n          going.\n          In a WIDE SHOT, we HEAR HIM BEEPING to himself, lonely and\n          frightened.",
        "dictionary": {
            "FIREBALL": "Explosive Fighter",
            "FORM": "Creature",
            "RED EYES": "Glowing Gaze",
            "BEEPING": "Whistling"
        }
    }
]