[
    {
        "message_id": 1810,
        "passage": "The mist-shrouded X-wing fighter is almost invisible in the\n      thick fog. Luke climbs out onto the long nose of the\n      spacecraft as Artoo pops out of his cubbyhole on the back.\n      The young warrior surveys the fog, which is barely pierced\n      by the ship's landing lights. About all he can make out are\n      some giant, twisted trees nearby. Artoo whistles anxiously.\n\n                          LUKE\n                No, Artoo, you stay put.    I'll have\n                a look around.\n\n      Artoo lets out a short beep. As Luke moves along the nose,\n      Artoo loses his balance and disappears with a splash into\n      the boggy lake.\n\n                            LUKE (CONT’D)\n                Artoo?\n\n      Luke kneels and leans over the plane looking for Artoo, but\n      the water is still and reveals no sign of the little droid.\n\n                           LUKE (CONT’D)\n                Artoo!   Where are you?\n\n      A small periscope breaks the surface of the water and a\n      gurgly beep is heard. The periscope starts to move to\n      shore. Relieved, Luke starts running along the nose of the\n      fighter to its tip.\n\n                           LUKE (CONT’D)\n                Artoo!   You be more careful.\n\n      The outline of the shore is now more than ten feet away.\n\n      Luke jumps off the plane into the water, scrambles up to the\n      shore, and turns to look for Artoo. The periscope still\n      steadily moves toward shore.\n\n                          LUKE (CONT’D)\n                Artoo - that way!\n\n      Suddenly, through the thick fog layer, a dark shape appears,\n      moving toward the little droid. The dark, sinuous bog beast\n      dives beneath the swampy water, making a loud clunk against\n      Artoo's metal hull. The droid disappears from sight,\n      uttering a pathetic electronic scream.\n\n      Holding his ignited lightsaber before him, Luke wades a few\n      feet into the murky pool, looking for any sign of his little\n      friend.\n\n                          LUKE (CONT’D)\n                Artoo!\n\n      The black surface is still as death itself... until a few\n      bubbles begin to appear. Then, phheewaat!! The runt-size\n      robot is spit out of the water, makes a graceful arc, and\n      comes crashing down into a patch of soft gray moss.\n\n                          LUKE (CONT’D)\n                Oh, no! Are you all right? Come\n                on. You're lucky you don't taste\n                very good. Anything broken?\n\n      Luke helps Artoo to his feet and begins wiping the mud and\n      roots from his round metal body. Artoo responds with\n      feeble, soggy beeps.\n\n                          LUKE (CONT’D)\n                If you're saying coming here was a\n                bad idea, I'm beginning to agree\n                with you. Oh, Artoo, what are we\n                doing here? It's like... something\n                out of a dream, or, I don't know.\n                Maybe I'm just going crazy.\n\n      As Luke glances around at the spooky swamp jungle that\n      surrounds him, Artoo ejects a stream of muddy water from one\n      of his cranial ports.\n\n145",
        "dictionary": {
            "X-wing": "F-14 fighter",
            "lightsaber": "energy sword",
            "Jedi": "warrior"
        }
    },
    {
        "message_id": 1811,
        "passage": "Admiral Piett hesitates in the entryway to Vader's private\n      cubicle.\n\n      After a moment, he steps into the room and pauses at the\n      surprising sight before him.\n\n      Darth Vader, his back turned, is silhouetted in the gloom on\n      the far side of the chamber. A black, insectlike droid\n      attends him. Among the various apparatuses surrounding\n      them, a respirator tube now retracts from Vader's uncovered\n      head. The head is bald with a mass of ugly scar tissue\n      covering it. The black droid then lowers the mask and\n      helmet onto Vader's head. When it is in place, the Dark\n      Lord turns to face Piett.\n\n                          VADER\n                Yes, Admiral?\n\n                          PIETT\n                Our ships have sighted the\n                Millennium Falcon, lord. But... it\n                has entered an asteroid field and\n                we cannot risk...\n\n                          VADER\n                    (interrupting)\n                Asteroids do not concern me,\n                Admiral. I want that ship and not\n                excuses.\n\n                             PIETT\n                Yes, lord.\n\n146",
        "dictionary": {
            "Millennium Falcon": "Rebel Transport",
            "Dark Lord": "Powerful Master"
        }
    },
    {
        "message_id": 1812,
        "passage": "The pirate starship rests in a dark, dripping asteroid cave.\n      It is so dark that the cave's exact dimensions are\n      impossible to determine.\n\n147",
        "dictionary": {}
    },
    {
        "message_id": 1813,
        "passage": "Han and Chewie busily shut down the engine and all\n      electronic systems. Threepio and Leia watch worriedly.\n\n                          HAN\n                I'm going to shut down everything\n                but the emergency power systems.\n\n                          THREEPIO\n                Sir, I'm almost afraid to ask,\n                but... does that include shutting\n                me down, too?\n\n      Chewie barks \"yes\".    But Han thinks otherwise.\n\n                          HAN\n                No, I need you to talk to the\n                Falcon, find out what's wrong with\n                the hyperdrive.\n\n      Suddenly, the ship lurches, causing all the loose items in\n      the cockpit to go flying. Chewie howls.\n\n                          THREEPIO\n                Sir, it's quite possible this\n                asteroid is not entirely stable.\n\n                          HAN\n                Not entirely stable? I'm glad\n                you're here to tell us these\n                things. Chewie, take the professor\n                in the back and plug him into the\n                hyperdrive.\n\n                          THREEPIO\n                Oh! Sometimes I just don't\n                understand human behavior.\n                          (MORE)\n\n                          THREEPIO (CONT'D)\n                After all, I'm only trying to do my\n                job in the most...\n\n      The sliding door closes behind the indignant Threepio as\n      Chewie and he move back to the hold. Suddenly, the ship\n      lurches again, throwing Leia across the cabin into Han's\n      arms. Then, abruptly, the motion stops as suddenly as it\n      started. With some surprise, Han and Leia realize they are\n      in each other's arms.\n\n                          LEIA\n                Let go.\n\n                          HAN\n                Sshh!\n\n                          LEIA\n                Let go, please.\n\n      Leia flushes, averting her eyes. She's not exactly fighting\n      to get free. But, of course, Han blows it...\n\n                          HAN\n                Don't get excited.\n\n      The anger rises in Leia.\n\n                          LEIA\n                Captain, being held by you isn't\n                quite enough to get me excited.\n\n                          HAN\n                Sorry, sweetheart. We haven't got\n                time for anything else.\n\n      Han grins quickly wickedly at Leia as he turns and exits\n      through the door. Leia's confused emotions show clearly on\n      her lovely face.\n\n148",
        "dictionary": {
            "Threepio": "Professor",
            "Falcon": "Spaceship",
            "hyperdrive": "propulsion system",
            "Chewie": "Wookiee",
            "asteroid": "space rock"
        }
    },
    {
        "message_id": 1814,
        "passage": "The mist has dispersed a bit, but it is still a very gloomy-\n      looking swamp.\n\n      Luke pulls an equipment box from the shore to the clearing.\n      He ignites a little fusion furnace and warms his hands\n      before it. Taking a power cable, he plugs it into Artoo's\n      noselike socket.\n\n                          LUKE\n                Ready for some power? Okay. Let's\n                see now. Put that in there. There\n                you go.\n\nThe droid whistles his appreciation. Luke then opens a\ncontainer of processed food and sits before the thermal\nheater.\n\n                    LUKE (CONT’D)\n              (sighs)\n          Now all I have to do is find this\n          Yoda... if he even exists.\n\nNervously, he looks around at the foreboding jungle.\n\n                    LUKE (CONT’D)\n          Still... there's something familiar\n          about this place. I feel like... I\n          don't know...\n\n                    STRANGE VOICE\n          Feel like what?\n\nLuke jumps out of his skin. Artoo screeches in terror. The\nyoung warrior grabs for his lightsaber as he spins around,\nlooking for the speaker. Mysteriously standing right in\nfront of Luke is a strange, bluish creature, not more than\ntwo feet tall. The wizened little thing is dressed in rags.\nIt motions toward Luke's sword.\n\n                    LUKE\n              (looking at the creature)\n          Like we're being watched!\n\n                    CREATURE\n          Away with your weapon!    I mean you\n          no harm.\n\nAfter some hesitation, Luke puts away his weapon, although\nhe really doesn't understand why. Artoo watches with\ninterest.\n\n                    CREATURE (CONT’D)\n          I am wondering, why are you here?\n\n                    LUKE\n          I'm looking for someone.\n\n                    CREATURE\n          Looking? Found someone, you have,\n          I would say, hmmm?\n\nThe little creature laughs.\n\n                    LUKE\n              (Trying to keep from\n               smiling)\n          Right.\n\n                    CREATURE\n          Help you I can. Yes, mmmm.\n\n                    LUKE\n          I don't think so.   I'm looking for\n          a great warrior.\n\n                     CREATURE\n          Ahhh! A great warrior.\n              (laughs and shakes his\n               head)\n          Wars not make one great.\n\nWith the aid of a walking stick, the tiny stranger moves\nover to one of the cases of supplies. He begins to rummage\naround.\n\nArtoo moves to the edge of the case - standing almost eye\nlevel to the creature who is carelessly handling the\nsupplies - and squeaks his disapproval.\n\nTheir tiny visitor pick up the container of food Luke was\neating from and takes a bite.\n\n                    LUKE\n          Put that down.   Hey!   That's my\n          dinner!\n\nThe creature spits out the bite he has taken.   He makes a\nface.\n\n                     CREATURE\n          How you get so big, eating food of\n          this kind?\n\nHe flips the container in Luke's direction and reaches into\none of Luke's supply cases.\n\n                    LUKE\n          Listen, friend, we didn't mean to\n          land in that puddle, and if we\n          could get our ship out, we would,\n          but we can't, so why don't you\n          just...\n\n                    CREATURE\n              (teasing)\n          Aww, cannot get your ship out?\n\nThe creature spots something of interest in Luke's case.\nLuke loses patience and grabs the case away. The creature\nretains his prize - a tiny power lamp - and examines it with\ndelight.\n\n                    LUKE\n          Hey, you could have broken this.\n          Don't do that. Ohhh... you're\n          making a mess. Hey, give me that!\n\n                     CREATURE\n              (retreating with the\n               lamp)\n          Mine! Or I will help you not.\n\nClutching its treasure, the creature backs away from Luke,\ndrawing closer to Artoo. As Luke and the creature argue,\none of Artoo's little arms slowly moves out toward the power\nlamp, completely unnoticed by the creature.\n\n                    LUKE\n          I don't want your help. I want my\n          lamp back. I'll need it to get out\n          of this slimy mudhole.\n\n                     CREATURE\n          Mudhole?   Slimy? My home this is.\n\nArtoo grabs hold of the lamp and the two little figures are\nimmediately engaged in a tug-of-war over it.\n\nArtoo beeps a few angry, \"Give me thats.\"\n\n                    CREATURE (CONT’D)\n          Ah, ah, ah!\n\n                    LUKE\n          Oh, Artoo, let him have it!\n\n                      CREATURE\n          Mine!    Mine!\n\n                      LUKE\n          Artoo!\n\n                      CREATURE\n          Mine!\n\nThe creature lets go with one hand and pokes Artoo lightly\nwith one finger. Artoo reacts with a startled squeal, and\nlets go.\n\n                      CREATURE (CONT’D)\n          Mine!\n\n                          LUKE\n                    (fed up)\n                Now will you move along, little\n                fella? We're got a lot of work to\n                do.\n\n                          CREATURE\n                No! No, no! Stay and help you, I\n                will.\n                    (laughs)\n                Find your friend, hmm?\n\n                          LUKE\n                I'm not looking for a friend. I'm\n                looking for a Jedi Master.\n\n                           CREATURE\n                Oohhh. Jedi Master.   Yoda.     You\n                seek Yoda.\n\n                          LUKE\n                You know him?\n\n                          CREATURE\n                Mmm.  Take you to him, I will.\n                    (laughs)\n                Yes, yes. But now, we must eat.\n                Come. Good food. Come.\n\n      With that, the creature scurries out of the clearing,\n      laughing merrily. Luke stares after him. All he sees is the\n      faint light from the small power lamp moving through the\n      fog. Luke makes his decision and starts after the creature.\n\n                          CREATURE (CONT’D)\n                    (in the distance)\n                Come, come.\n\n      Artoo, very upset, whistles a blue streak of protest.\n\n                          LUKE\n                Stay here and watch after the camp,\n                Artoo.\n\n      Artoo beeps even more frantically. But as Luke disappears\n      from view, the worried little droid grows quieter, and\n      utters a soft electronic sigh.\n\n149",
        "dictionary": {
            "Jedi Master": "Legendary Warrior",
            "Yoda": "The Wise One",
            "Artoo": "The Small Droid",
            "Luke": "The Young Warrior"
        }
    },
    {
        "message_id": 1815,
        "passage": "Threepio whistles and beeps a strange dialect into the\n      control panel in front of him. The control panel whistles\n      back a few mystifying beeps.\n\n                    THREEPIO\n          Oh, where is Artoo when I need him?\n\nHan enters the hold area and kneels on the floor near the\ncontrol box.\n\n                    THREEPIO (CONT’D)\n          Sir, I don't know where your ship\n          learned to communicate, but it has\n          the most peculiar dialect. I\n          believe, sir, it says that the\n          power coupling on the negative axis\n          has been polarized. I'm afraid\n          you'll have to replace it.\n\n                    HAN\n          Well, of course I'll have to\n          replace it.\n\nHe hands a wire coil up to Chewie who is working near the\nceiling.\n\n                     HAN (CONT’D)\n          Here!   And Chewie...\n\nChewie brings his head back through the trap door in the\nceiling and whines. Han glances back at Threepio, then\nspeaks quietly to Chewie so only he can hear.\n\n                    HAN (CONT’D)\n              (continuing)\n          ... I think we'd better replace the\n          negative power coupling.\n\nLeia finishes welding the valves she has been working on and\nattempts to reengage the system by pulling a lever attached\nto the valve. It doesn't budge. Han notices her struggle,\nand moves to help her. She rebuffs him.\n\n                    HAN (CONT’D)\n          Hey, Your Worship, I'm only trying\n          to help.\n\n                    LEIA\n              (still struggling)\n          Would you please stop calling me\n          that?\n\nHan hears a new tone in her voice.   He watches her pull on\nthe lever.\n\n                    HAN\n          Sure, Leia.\n\n                     LEIA\n          Oh, you make it so difficult\n          sometimes.\n\n                    HAN\n          I do, I really do. You could be a\n          little nicer, though.\n              (he watches her reaction)\n          Come on, admit it. Sometimes you\n          think I'm all right.\n\nShe lets go of the lever and rubs her sore hand.\n\n                     LEIA\n          Occasionally...\n              (a little smile,\n               haltingly)\n          ... when you aren't acting like a\n          scoundrel.\n\n                    HAN\n              (laughs)\n          Scoundrel? Scoundrel?     I like the\n          sound of that.\n\nWith that, Han takes her hand and starts to massage it.\n\n                       LEIA\n          Stop that.\n\n                       HAN\n          Stop what?\n\nLeia is flushes, confused.\n\n                       LEIA\n          Stop that!     My hands are dirty.\n\n                    HAN\n          My hands are dirty, too.    What are\n          you afraid of?\n\n                     LEIA\n              (looking right into his\n               eyes)\n          Afraid?\n\nHan looks at her with a piercing look. He's never looked\nmore handsome, more dashing, more confident. He reaches out\nslowly and takes Leia's hand again from where it is resting\non a console. He draws it toward him.\n\n                    HAN\n          You're trembling.\n\n                          LEIA\n                I'm not trembling.\n\n      Then with an irresistible combination of physical strength\n      and emotional power, the space pirate begins to draw Leia\n      toward him... very slowly.\n\n                          HAN\n                You like me because I'm a\n                scoundrel. There aren't enough\n                scoundrels in your life.\n\n      Leia is now very close to Han and as she speaks, her voice\n      becomes an excited whisper, a tone completely in opposition\n      to her words.\n\n                          LEIA\n                I happen to like nice men.\n\n                          HAN\n                I'm a nice man.\n\n                          LEIA\n                No, you're not.     You're...\n\n      He kisses her now, with slow, hot lips. He takes his time,\n      as though he had forever, bending her body backward. She\n      has never been kissed like this before, and it almost makes\n      her faint. When he stops, she regains her breath and tries\n      to work up some indignation, but finds it hard to talk.\n\n      Suddenly, Threepio appears in the doorway, speaking\n      excitedly.\n\n                          THREEPIO\n                Sir, sir! I've isolated the\n                reverse power flux coupling.\n\n      Han turns slowly, icily, from their embrace.\n\n                             HAN\n                Thank you.     Thank you very much.\n\n                          THREEPIO\n                Oh, you're perfectly welcome, sir.\n\n      The moment spoiled, Han marches out after Threepio.\n\n150",
        "dictionary": {
            "Threepio": "Robbie",
            "Artoo": "Robby",
            "negative axis": "lower part",
            "polarized": "broken",
            "scoundrel": "rogue",
            "Your Worship": "Your Highness",
            "reverse power flux coupling": "energy flow problem"
        }
    },
    {
        "message_id": 1816,
        "passage": "The Imperial fleet moves through the asteroid-filled void,\n      intently seeking its prey.\n\n151",
        "dictionary": {
            "Imperial": "Military",
            "fleet": "armada"
        }
    },
    {
        "message_id": 1817,
        "passage": "Asteroids collide, creating a fireworks display outside the\n      bridge window. Darth Vader stands, staring out the window\n      above the control deck. Then slowly turns toward the\n      bridge. Before him are the hologram images of twenty\n      battleship commanders. One of these images, the commander\n      of a ship that has just exploded, is fading away quickly.\n      Another image, in the center and a little apart from the\n      others, is faded and continually disrupted by static. It is\n      the image of Captain Needa, commander of the Star Destroyer\n      most hotly on the tail of the Millennium Falcon. Admiral\n      Piett and an aide stand behind the Dark Lord.\n\n                          NEEDA\n                    (in hologram)\n                ... and that, Lord Vader, was the\n                last time they appeared in any of\n                our scopes. Considering the amount\n                of damage we've sustained, they\n                must have been destroyed.\n\n                          VADER\n                No, Captain, they're alive. I want\n                every ship available to sweep the\n                asteroid field until they are\n                found.\n\n      The Imperial star captains fade out one by one as Vader\n      turns to Admiral Piett.\n\n                          PIETT\n                Lord Vader.\n\n                          VADER\n                Yes, Admiral, what is it?\n\n      The admiral is scared, his face white as a sheet.\n\n                          PIETT\n                The Emperor commands you make\n                contact with him.\n\n                          VADER\n                Move the ship out of the asteroid\n                field so that we can send a clear\n                transmission.\n\n                          PIETT\n                Yes, my lord.\n\n152",
        "dictionary": {
            "Star Destroyer": "Imperial Warship",
            "Millennium Falcon": "Rebel Escape Vessel",
            "Dark Lord": "Supreme Commander",
            "Lord Vader": "Admiral Vader",
            "Imperial": "Galactic",
            "asteroid field": "space debris"
        }
    },
    {
        "message_id": 1818,
        "passage": "Vader's Imperial Star Destroyer moves against the vast sea\n      of stars away from the rest of the fleet.\n\n153",
        "dictionary": {
            "Star Destroyer": "Warship",
            "Imperial": "Military"
        }
    },
    {
        "message_id": 1819,
        "passage": "The Dark Lord, Darth Vader, is alone in his chamber. A\n      strange sound enters the room and a light begins to play\n      across Vader's black figure. He looks up and bows quickly.\n\n      A twelve-foot hologram of the Galactic Emperor materializes\n      before Vader. The Emperor's dark robes and monk's hood are\n      reminiscent of the cloak worn by Ben Kenobi. His voice is\n      even deeper and more frightening than Vader's.\n\n                          VADER\n                What is thy bidding, my master?\n\n                          EMPEROR\n                There is a great disturbance in the\n                Force.\n\n                          VADER\n                I have felt it.\n\n                           EMPEROR\n                We have a new enemy - Luke\n                Skywalker.\n\n                          VADER\n                Yes, my master.\n\n                          EMPEROR\n                He could destroy us.\n\n                          VADER\n                He's just a boy.   Obi-Wan can no\n                longer help him.\n\n                          EMPEROR\n                The Force is strong with him. The\n                son of Skywalker must not become a\n                Jedi.\n\n                          VADER\n                If he could be turned, he would\n                become a powerful ally.\n\n                         EMPEROR\n                Yes. Yes. He would be a great\n                asset. Can it be done?\n\n                          VADER\n                He will join us or die, my master.\n\n      Vader kneels. The supreme Emperor passes a hand over the\n      crouched Lord of the Sith and fades away.\n\n154",
        "dictionary": {
            "Darth Vader": "The Dark Knight",
            "Galactic Emperor": "Supreme Ruler",
            "Ben Kenobi": "The Wise One",
            "Force": "Energy Field",
            "Jedi": "Guardians of Peace"
        }
    }
]