[
    {
        "message_id": 1320,
        "passage": "Outside, the SUN ALMOST COMPLETELY GONE -- PULL BACK THROUGH\n\n          THE WINDOW TO REVEAL A STARKILLER TECHNICIAN:\n\n                          STARKILLER TECHNICIAN\n           Weapon at full capacity in thirty\n           seconds.\n\n                          GENERAL HUX\n           Prepare to fire.",
        "dictionary": {
            "STARKILLER": "Super Laser"
        }
    },
    {
        "message_id": 1321,
        "passage": "Poe's X-wing weaves through the breach. A pursuing TIE\n          fighter does not clear the gap, leaving Poe to circle the\n          interior of the unguarded structure, firing volley after\n          volley of torpedoes.",
        "dictionary": {
            "X-wing": "fighter jet",
            "TIE": "enemy",
            "unguarded structure": "open building"
        }
    },
    {
        "message_id": 1322,
        "passage": "The remaining X-Wings -- including Poe's -- BLAST the place --\n          and the structure begins to CRATER, deep underground\n\n          EXPLOSIONS!",
        "dictionary": {
            "X-Wings": "Fighter Jets",
            "CRATER": "Collapse"
        }
    },
    {
        "message_id": 1323,
        "passage": "Amid the BARE WHITE TREES, ONLY TWO LIGHTSABERS -- LUKE'S\n          BLUE AND REN'S YELLOW-RED -- ILLUMINATE the FLURRIES OF SNOW\n          as Rey and Kylo Ren BATTLE HARD.\n          She seems to be, impossibly, STRONGER THAN HE IS for half a\n          dozen blows -- until he FINDS HIS STRENGTH and FIGHTS BACK --\n          MOVING FORWARD and PUSHING REY BACK, into the forest.\n          Suddenly a COLOSSAL CHUNK OF THE FOREST RIGHT BEHIND REY\n          DROPS AWAY! Rey is suddenly fighting on the EDGE OF A\n\n          MASSIVE, BRAND NEW CLIFF!\n\n                          KYLO REN\n           You need a teacher! I can show you\n           the ways of the Force!\n\n                          REY\n           The Force.\n          Rey closes her eyes for a long beat. When Rey opens them,\n          she is centered, fortified, and she POUNDS BACK, SINGLE HANDED\n          SWIPES, hitting Ren's gnarly, spitting saber with incredible\n          FORCE. It's so fast now, so furious, that Kylo Ren FALLS\n          BACK -- She ATTACKS HARDER!\n          Ren gets up again but she HITS HIS SABER'S HILT -- HIS BLADE\n          GOES FLYING OFF, TUMBLING INTO THE SNOW -- and she SLASHES\n\n          AGAIN AND AGAIN AND HITS KYLO REN SQUARE IN THE HEAD AND\n\n          CHEST. HE GOES DOWN, SUDDENLY A FEARFUL MAN, A LARGE BURN\n          SCAR SLASHED ACROSS HIS FACE! He still reaches for his saber.\n          And she could kill him -- right now, with ONE VICIOUS STRIKE!\n          But she stops. Realizing she stands on a greater edge than\n          even the cliff -- the edge of the dark side. The earth\n          SHAKES. The earth splits. A gully forms.",
        "dictionary": {
            "LIGHTSABERS": "Energy Swords",
            "STRONGER THAN HE IS": "More Powerful than Him",
            "EDGE OF A MASSIVE, BRAND NEW CLIFF": "Edge of a Large New Precipice",
            "WAYS OF THE FORCE": "Path of the Force",
            "FORCE": "Power",
            "FALLS BACK": "Takes a Step Back",
            "ATTACKS HARDER": "Fights with Increased Intensity",
            "HITS HIS SABER'S HILT": "Strikes the Handle of His Saber",
            "DARK SIDE": "Shadow"
        }
    },
    {
        "message_id": 1324,
        "passage": "The area where the RALLY was held is now COLLAPSING into a\n          giant sink hole! We WHIP PAN to a YOUNG TECHNICIAN, who\n          watches this out the control room window in horror. He\n          hurries off, passing COLONEL DATOO, who admonishes:\n\n                          COLONEL DATOO\n           Lieutenant, get back to your station!\n\n                          YOUNG TECHNICIAN\n           (stops, fleetingly)\n           Just look. We won't survive -- even\n           Hux has gone!\n          As he hurries off, WE HEAR:\n\n           GENERAL HUX (V.O.)\n           Supreme Leader.",
        "dictionary": {
            "RALLY": "Gathering",
            "COLLAPSING": "Crumbling",
            "WHIP PAN": "Quick cut",
            "YOUNG TECHNICIAN": "Junior Engineer",
            "COLONEL DATOO": "Senior Officer",
            "Hux": "Commander"
        }
    },
    {
        "message_id": 1325,
        "passage": "Hux stands before SNOKE'S IMAGE. Relative quiet here, but\n          distant SOUNDS OF DESTRUCTION. Hux tries to keep it together\n          but is horrified, heartsick:\n\n                          GENERAL HUX\n           The fuel cells have ruptured. The\n           collapse of the planet has begun.\n          Snoke takes this in. Furious, desolate... knowing.\n\n                          SNOKE\n           Leave the base at once and come to\n           me with Kylo Ren.\n\n                          (GRIM)\n           It is time to complete his training.",
        "dictionary": {
            "SNOKE'S IMAGE": "The Dark Lord's Portrait",
            "SOUNDS OF DESTRUCTION": "Sounds of Chaos"
        }
    },
    {
        "message_id": 1326,
        "passage": "Rey turns, runs a hundred feet through the forest to:\n          FINN, who lies, near death, not far from where the GROUND\n          FELL AWAY. Rey falls to her knees near him, turns him over,\n          sees his cauterized but possibly fatal wound.\n\n                          REY\n           Finn! Finn...\n          Tears come to her eyes as she lifts him, holds his lifeless\n          body in her arms. Snow flurries around them as she cries,\n          holding this boy who she just met, who she already adores.\n          They are left here to die -- nearby MORE TREES DROP as the\n          planet continues to COLLAPSE. And just as it seems like all\n          is lost... Her wet eyes look up to see:\n\n          LIGHTS RISE FROM THE NEWLY-FORMED CANYON -- IT'S A SHIP WE\n          KNOW -- IT'S THE MILLENNIUM FALCON -- and its lights\n\n          ILLUMINATE REY, WHOSE FACE FILLS WITH HOPE!\n          CHEWIE IS AT THE CONTROLS. He ROARS to them!",
        "dictionary": {
            "FINN": "Alex",
            "GROUND FELL AWAY": "Ground Opened Up",
            "MILLENNIUM FALCON": "Starlight Cruiser",
            "CHEWIE": "Co-Pilot"
        }
    },
    {
        "message_id": 1327,
        "passage": "Chewie exits the ship.\n          MOMENTS LATER Chewie CARRIES FINN up the ramp. Rey hurries\n          with them back into the ship --",
        "dictionary": {
            "MOMENTS LATER": "shortly after",
            "Chewie": "the Wookiee",
            "Finn": "the soldier"
        }
    },
    {
        "message_id": 1328,
        "passage": "Chewie carries Finn inside, followed by Rey.",
        "dictionary": {
            "Chewie": "Loyal Companion",
            "Finn": "New Recruit"
        }
    },
    {
        "message_id": 1329,
        "passage": "And we FLY WITH THE FALCON as it leaves the planet -- we can\n          see CHEWIE AND REY PILOTING, the COLLAPSING PLANET BEHIND\n          US. The Resistance X-wings, led by Poe, follow the Falcon.",
        "dictionary": {
            "FLY WITH THE FALCON": "Escape with the Spaceship",
            "CHEWIE": "Wookiee",
            "REY PILOTING": "Piloting the Ship",
            "COLLAPSING PLANET": "Dying Planet",
            "X-wings": "Fighter Jets"
        }
    }
]