[
    {
        "message_id": 1590,
        "passage": "HAN\n               Our only hope now, is to outrun that \n               Imperial garbage scow, tho'. I'm going \n               to lightspeed.\n\n     Chewie growls yet again. Han smiles.\n\n                            HAN\n               That's the spirit! You'll be celebrating \n               Life Day before you know it! Standby, \n               here's where we say goodbye to our \n               unpleasant friends.\n\n     The Falcon makes the jump to hyperspace.\n\n6.",
        "dictionary": {
            "Imperial garbage scow": "enemy spaceship",
            "Life Day": "holiday celebration",
            "Lightspeed": "maximum speed"
        }
    },
    {
        "message_id": 1591,
        "passage": "A graphic is displayed over the starfield left from the \n     Falcon jumping to lightspeed. It says: THE STAR WARS \n     HOLIDAY SPECIAL\n\n                            ANNOUNCER\n               The Star Wars Holiday Special. Starring \n               Mark Hamill as Luke Skywalker.\n\n     A clip is shown of Luke in his flight uniform.\n\n                            ANNOUNCER\n               Harrison Ford as Han Solo.\n\n     A clip is shown of Han in the cockpit of the Falcon.\n\n                            ANNOUNCER\n               Carrie Fisher as Princess Leia.\n\n     A clip is shown of Leia in her white dress from Star Wars.\n\n                            ANNOUNCER\n               with, Anthony Daniels as C-3PO.\n\n     A clip is shown of C-3PO.\n\n                            ANNOUNCER\n               Peter Mayhew as Chewbacca.\n\n     A clip is shown of Chewie.\n\n                            ANNOUNCER\n               R2-D2 as R2-D2.\n\n     A clip is shown of Artoo rolling around.\n\n                            ANNOUNCER\n               And, James Earl Jones as the voice of \n               Darth Vader.\n\n     A clip is shown of Vader walking down a corridor of the \n     Death Star with an Imperial Officer.\n\n                            ANNOUNCER\n               Introducing Chewbacca's family,\n\n     A clip is shown of Chewie's family altogether.\n\n                            ANNOUNCER\n               His wife, Malla.\n\n     A clip is shown of Malla who is around Chewbacca's height \n     and slightly heavier.\n\n                            ANNOUNCER\n               His father, Itchy.\n\n     A clip is shown of Itchy who is shorter than Chewie. He \n     has gray and white hair and a very bad under bite.\n\n                            ANNOUNCER\n               His son, Lumpy.\n\n     A clip is shown of Lumpy who is a small wookiee child.\n\n                            ANNOUNCER\n               With special guest stars, Beatrice \n               Arthur.\n\n     A clip of her is shown.\n\n                            ANNOUNCER\n               Art Carney.\n\n     A clip of him is shown. \n\n                            ANNOUNCER\n               Diahann Carroll.\n\n     A clip of her singing is shown. \n\n                            ANNOUNCER\n               The Jefferson Starship.\n\n     A clip of the band performing is shown.\n \n                            ANNOUNCER\n               Harvey Korman.\n\n     Different clips of him is shown in the roles he plays. \n\n                            ANNOUNCER\n               And an animated Star Wars story on...\n\n     A clip is shown from the cartoon of Boba Fett on some\n     creature.\n\n                            ANNOUNCER\n               The Star Wars Holiday Special.\n \n     The original graphic of THE STAR WARS HOLIDAY SPECIAL, \n     is brought back up. \n\n7.",
        "dictionary": {
            "Star Wars": "Galactic Odyssey",
            "lightspeed": "hyperspace",
            "Luke Skywalker": "Astronaut Jack",
            "Han Solo": "Captain Maverick",
            "Princess Leia": "Royal Ambassador",
            "C-3PO": "Protocol Officer",
            "Chewbacca": "Furry Companion",
            "R2-D2": "Robotic Assistant",
            "Darth Vader": "Imperial Commander",
            "Death Star": "Space Station",
            "Malla": "Wookiee Mate",
            "Itchy": "Wookiee Patriarch",
            "Lumpy": "Wookiee Child",
            "Jefferson Starship": "Space Rock Band",
            "Boba Fett": "Galactic Hunter"
        }
    },
    {
        "message_id": 1592,
        "passage": "Outside shot of Chewbacca's family's home. It is a high \n     in the trees and looks like a cartoonish painting.\n\n8.",
        "dictionary": {
            "Chewbacca": "a Wookiee",
            "Wookiee": "a humanoid alien"
        }
    },
    {
        "message_id": 1593,
        "passage": "Malla is busy in the kitchen cleaning or cooking. Itchy is\n     sitting in a chair carving X-wings out of wood. Lumpy \n     comes down the steps \"flying\" one of the X-wings that \n     his grandfather has carved. He then proceeds to \"fly\" the \n     X-wing around Itchy's head. Itchy growls at Lumpy in \n     anger. Malla makes a reluctant Lumpy leave his Grandfather\n     alone and to take out the garbage. On his way over to the\n     garbage can, Lumpy sees some cookies on the table and \n     picks one up. Malla sees this and makes him put it back. \n     She then hands him the garbage can he is to take out.\n     Lumpy heads to take out the garbage and Malla goes back\n     into the kitchen.\n\n9.",
        "dictionary": {
            "X-wings": "fighter planes",
            "Lumpy": "Timmy",
            "Itchy": "John"
        }
    },
    {
        "message_id": 1594,
        "passage": "Lumpy exits the door and sets the can next to it. He \n     looks through the railing to the cartoonish ground far \n     below. He then looks back into the house to see if anyone \n     is watching. Apparently, the coast is clear, so, he \n     climbs up on the railing and walks along it like a \n     tightrope walker.\n\n10.",
        "dictionary": {}
    },
    {
        "message_id": 1595,
        "passage": "Malla walks over to Itchy and pats him on the shoulder. \n     She then walks over to some shelves and gets a picture \n     frame down with a picture of Chewbacca in it. Itchy walks\n     over to her. They exchange some grunts and growls. Malla \n     goes back to the kitchen. Itchy gets a cartridge from a \n     shelf and looks around for Lumpy. Lumpy runs up to him. \n     They head over to a hologram table similar to the chess \n     board on the Falcon. Itchy puts the cartridge in and a\n     strange circus of holographic aliens appear. They dance, \n     do acrobatics, and in general caper around. Lumpy is \n     very amused by this and claps at the end of the show. \n     Malla makes Lumpy come over and dry the dishes when its \n     over.\n\n     Malla goes over to a computer console and pushes some \n     buttons on it. Nonsense letter and number combinations \n     come up and then the message: YOU HAVE REACHED TRAFFIC\n     CONTROL is displayed. Itchy becomes interested and comes \n     over to Malla. She pushes more buttons and a message \n     saying: NO STARSHIPS IN AREA is displayed. Malla switches \n     off the computer.\n\n     They both then go over to the shelves again and pull \n     aside two panels to reveal a hidden communications \n     monitor. Appearing on the screen is Luke, in his pilot\n     uniform, and Artoo working on an engine in a workshop. \n     Luke, who is on his knees, looks up.\n\n                            LUKE\n                    (on monitor)\n               What's that?\n                    (to Artoo)\n               Oh, Artoo, look. It's Chewbacca's family.\n\n11.",
        "dictionary": {
            "Chewbacca": "the Wookiee",
            "Lumpy": "the young one",
            "Falcon": "the spacecraft",
            "Artoo": "the droid",
            "Luke": "the pilot"
        }
    },
    {
        "message_id": 1596,
        "passage": "Chewbacca's family waves at Luke and Artoo from the \n     monitor on Luke's end.\n\n12.",
        "dictionary": {
            "Chewbacca": "the Wookiee",
            "Artoo": "the robot"
        }
    },
    {
        "message_id": 1597,
        "passage": "On the monitor, Luke gives Artoo something.\n\n                            LUKE \n                    (to Artoo)\n               Here, keep working on it.\n\n     Luke gets up and walks toward his monitor.\n\n                            LUKE\n                    (to wookiees)\n               Hello Malla, Itchy. Hiya Lumpy.\n\n     The wookiees wave at Luke through the monitor.\n\n                            LUKE\n               Where's Chewbacca?\n\n     All three of them start grunting and growling at the same\n     time. Luke holds up his hands, as if to slow them down.\n\n                            LUKE\n               Whoa, wait a minute! One at a time.\n\n     Itchy growls at Lumpy and Lumpy walks away mad at him. \n     Malla then \"explains\" to Luke what is wrong.\n\n                            LUKE\n               Yeah...\n\n     Something begins to smoke so Artoo whistles and bumps \n     into Luke's leg. Luke just motions him away without \n     looking at what Artoo wants.\n\n                            LUKE\n               Not now, Artoo.\n\n     Malla gets down the picture of Chewbacca off of her shelf \n     and holds it up to her monitor. Artoo beeps more at Luke.\n     This time he notices the problem about the smoke.\n\n                            LUKE\n               Uh, wait a minute, I don't like the \n               looks of this. Let me get this fixed.\n\n     More smoke pours out of the engine that Luke was working \n     on. He takes a tool to it and adjusts something.\n\n                            LUKE\n                    (to Artoo)\n               Oh, Artoo, you're supposed to be watching \n               that... There, that ought to hold it. I \n               think.\n\n     He waves the smoke away and makes another adjustment. He \n     then looks up to his monitor.\n\n                            LUKE\n                    (to Malla)\n               What's up?\n\n     He sees the picture of Chewbacca that Malla is holding.\n\n                            LUKE\n               Chewbacca... yeah, well, bring him to the \n               screen. I want to say hello to him.\n\n     The wookiees shake their heads at Luke. They continue \n     their growling.\n\n                            LUKE\n               You don't know where he is? ...Oh, he's \n               not there yet. Is that it?\n\n     The wookiees shake their heads in agreement at Luke's \n     answer.\n\n                            LUKE\n               Oh boy. Well, all I can tell you is that, \n               uh, he and Han left here on schedule. If \n               he's not there now, they're way overdue. \n               There must've been trouble.\n\n     More smoke comes out of the engine and Artoo beeps at \n     Luke. The wookiees start sounding upset.\n\n                            LUKE\n                    (to Artoo)\n               Artoo, please, this is important.\n                    (to Malla)\n               Now, now listen. Calm down. I mean, you \n               know how Han and Chewbacca are - anything \n               could've happened - they could've, they \n               could've stopped off somewhere, or been  \n               held up by an asteroid storm. Listen, I \n               wouldn't worry about Chewbacca, I know \n               him and he hasn't missed a Life Day yet, \n               right?\n\n     The wookiees nod in agreement at Luke on their monitor.\n\n                            LUKE\n               Well, there you go! He's not going to \n               miss this one either. It's just taking \n               him a little longer to get there, that's \n               all. He'll make it.\n\n     Luke starts to turn away and notices the \"sad\" expression \n     on Malla's face.\n\n                            LUKE\n               Come on, don't look so worried. Now, \n               Chewie's not gonna wanna come home to a \n               house full of long faces, is he? Come on, \n               Malla. Let's see a little smile. Come on...\n\n     Malla finally gives in and smiles for Luke. Luke smiles \n     back at her in response.\n\n                            LUKE\n               There, that's better. Try to enjoy your \n               Life Day. I gotta get back to this engine. \n               I think we might have it solved.\n\n     Artoo touches the engine and smoke comes out of it very\n     heavily.\n\n                            LUKE\n                    (to Artoo)\n               OH! ARTOO! What are you doing?! Oh no...\n\n     Artoo beeps at Luke. He looks up and pats Artoo on his \n     dome.\n\n                            LUKE\n               It's alright. Nobody's perfect.\n\n     Smoke continues to fill the workshop and the wookiees\n     monitor's picture breaks up as the connection is broken. \n     They then close the secret panels to conceal the monitor. \n     Malla walks back over to the console that she used \n     earlier. She pushes more buttons on it and the screen \n     comes to life. First, the screen displays a message \n     saying: SUB TERMINAL 446B. Then, it flashes: STANDBY \n     followed by: CONNECT. The next screen pulls up the \n     message: TRADING POST WOOKIEE PLANET C. This then cuts to \n     a scene of a shop with an Imperial guard looking around \n     at the goods for sale. The owner of the establishment \n     walks into the store and notices the man. The owner is\n     Saundan.\n\n                            SAUNDAN\n               Hello, an Imperial Guard. I suppose you \n               want to see my identification.\n\n     He reaches into his pocket to pull out his identification.\n\n                            IMPERIAL GUARD\n               No, I'm off duty. I've come to look around \n               your shop.\n\n                            SAUNDAN\n               Well, good, good, good. Look around, \n               browse around, make yourself at home... \n               As you can see I've got just about \n               everything a man or wookiee would want.\n\n     The Imperial Guard, who looking around on a table picks\n     up a clear bag and examines it.\n\n                            SAUNDAN\n               Oh here, let me show you this; I really \n               love this.\n\n     He picks up a small clear box with a dark back on it. He\n     blows on it and shines it with his sleeve. He decides that \n     it is not good enough.\n\n                            SAUNDAN\n               No...\n\n     He then picks up another and decides it is not good \n     enough either.\n\n                            SAUNDAN\n               Uh-uh...\n\n     He then gets one that has a green base and smiles.\n\n                            SAUNDAN\n               Ah, here we are. Here it is. A pocket \n               sized aquarium. Wonderful, isn't it?\n\n     He hands the aquarium to the guard who holds it up to \n     show the fish that are inside of it.\n\n                            SAUNDAN\n               And, you can take it with you anywhere. \n               And the tank is a snap to clean.\n\n                            IMPERIAL GUARD\n               I hate fish.\n\n     He puts the small tank back on the table and browses some\n     more at what is on it.\n\n                            SAUNDAN\n               Well, so do I, as a matter of fact. I \n               take a drink once and a while, but I just \n               thought I'd show you some of the stupid \n               stuff those wookiees purchase from me. Oh, \n               here...\n\n     He walks over to a shelf behind them and gets a shoe box \n     sized container from off it.\n\n                            SAUNDAN\n               Here's a hot little item that seems to be \n               moving pretty rapidly these days.\n\n     He sets the box on the table and opens it. A warbling \n     buzzer sounds and makes him look up.\n\n                            SAUNDAN\n               Excuse me, I got a wall screen customer.\n\n     He turns to the wall screen.\n\n                            SAUNDAN\n                    (to Malla)\n               Good to see you again.\n\n     Malla growls and waves to him.\n\n                            SAUNDAN\n               Don't worry Malla. I know just why you're \n               calling. You're wondering when that \n               shaggy carpet you ordered will arrive at \n               your home.\n\n     Malla growls in agreement with his assumption.\n\n                            SAUNDAN\n               Let me assure you madam, it's on its way. \n               You know, it was made especially for you \n               by a little old woman four planets away. \n               She did it all by herself. In fact, you \n               might say she did it by Han... Solo.\n\n     Malla growls enthusiastically at him.\n\n                            SAUNDAN\n               Tho' it's going to take some time to get \n               to you. I know you'll understand.\n\n     He looks back to see if the Imperial Guard is paying\n     attention to him.\n\n                            SAUNDAN\n                    (under his breath)\n               You understand don't you?\n\n     Malla growls agreement.\n\n                            SAUNDAN\n                    (normally)\n               Terrific! By the way, I'll be by later to \n               drop off that extra proton energy pack.\n\n     Malla waves farewell and growls.\n\n                            SAUNDAN\n               You're welcome.\n\n     The call is terminated. Saundan turns back to the Guard \n     who is still browsing around the shop. He then proceeds \n     to pick up the item from the box that he was showing \n     before the wall screen call.\n\n                            SAUNDAN\n                    (to guard)\n               What's a matter? Don't you like this?\n\n                            IMPERIAL GUARD\n               It's just a groomer.\n\n                            SAUNDAN\n               Just a groomer?\n\n                            IMPERIAL GUARD\n               A groomer..\n\n                            SAUNDAN\n               Just a groomer, you say? It's a lot more \n               than that.\n\n     He picks up the manual for the groomer out of its box.\n\n                            SAUNDAN\n               Evidently, you haven't read the \n               instructions, the warranty, and the \n               guarantee.\n                    (reading from the manual)\n               ... besides shaving and hair trimming. \n               It's guaranteed to lift stains off \n               clothing, faces, and hands. Cleans teeth, \n               fingers, and toenails. Washes eyes, \n               pierces ears, calculates, modulates, and\n               syncopates like rhythms and can repeat \n               the entire Imperial Code, all 17 volumes, \n               in half the time of the old XP-21. Just \n               the thing to keep you squeaky clean.\n\n     He puts the manual down on the table.\n\n                            SAUNDAN\n               I use one of these all the time.\n\n                            IMPERIAL GUARD\n               Really?\n\n     Saundan glances down at himself and notices how unkempt he\n     looks.\n\n                            SAUNDAN\n               Well, not all the time, but some of the \n               time. Oh, another outstanding, uh, \n               feature of this little model - you can \n               recharge it by simply plugging it into \n               any ordinary laser outlet.\n\n     The Imperial Guard takes the groomer from the Saundan's \n     hands and puts it in his belt.\n\n                            IMPERIAL GUARD\n               I'll take it.\n\n                            SAUNDAN\n               Good! I thought you would. Well, would you \n               like to pay me something for it or give me\n               something in trade?\n\n                            IMPERIAL GUARD\n               I said I'll take it!\n\n     The Imperial Guard turns and leaves the shop with the\n     groomer.\n\n                            SAUNDAN\n               That's a load off my mind. I thought I \n               might embarrass you when I told you it \n               was a gift.\n                    (to himself)\n               I don't like embarrassing people. I don't \n               like being embarrassed myself that's why \n               I, uh, don't like to embarrass people. I \n               just said that. ... just a groomer...\n\n13.",
        "dictionary": {
            "Life Day": "Holiday",
            "Wookiee": "Alien"
        }
    },
    {
        "message_id": 1598,
        "passage": "Two Star Destroyers head across the screen.\n\n14.",
        "dictionary": {
            "Star Destroyers": "Warships"
        }
    },
    {
        "message_id": 1599,
        "passage": "Darth Vader and an Imperial Officer are walking down a\n     corridor.\n\n                            IMPERIAL OFFICER\n               We've ordered a blockade and a curfew. And, \n               started a search operation. It's just a \n               matter of time before we find the Rebels.\n\n                            DARTH VADER\n               I want the Rebels located and identified. \n               If it means searching every household in \n               the system.\n     \n15.",
        "dictionary": {
            "Rebels": "Insurgents",
            "Imperial": "Government"
        }
    }
]