[
    {
        "message_id": 1460,
        "passage": "PALPATINE listens to a delegation from the Senate, which includes PADME and five other Senators: NEE ALAVAR, FANG ZAR, MALEDEE, SWEITT CONCORKILL, and MON CALAMARI. ANAKIN stands to one side of PALPATINE. \n\nPALPATINE: I understand your reservations completely, Senator, and I assure you the appointment of Governors will in no way compete with the duties of the Senate. \n\nPADME: May I take it then, that there will be no further amendments to the Constitution? \n\nPALPATINE: I want this terrible conflict to end as much as you do, My Lady, and when it does I guarantee an immediate return to democracy . . . \n\nPADME: You are pursuing a diplomatic solution to the war, then. \n\nPALPATINE: You must trust me to do the right things, Senator. That is why I am here. \n\nFANGZAR: But surely . . . \n\nThe Chancellor turns on FANG ZAR. \n\nPALPATINE: I have said I will do what is right, that should be enough for your . . . committee. \n\nPADME: On behalf of the \"delegation of two thousand,\" I thank you, Chancellor. \n\nPALPATINE: I thank you for bringing this to my attention, Senator. \n\nPADME gives ANAKIN a frustrated look, then turns and exits with the other FIVE SENATORS. PALPATINE turns to ANAKIN. \n\nPALPATINE: (continuing) Their sincerity is to be admired, although I sense there is more to their request than they are telling us. \n\nANAKIN: What do you mean? \n\nPALPATINE: They are not to be trusted. \n\nANAKIN: Surely Senator Amidala can be trusted . . . \n\nPALPATINE: These are unstable times for the Republic, Anakin. Some see instability as an opportunity. Senator Amidala is hiding something. I can see it in her eyes. \n\nANAKIN: I'm sure you're mistaken. \n\nPALPATINE: I'm surprised your Jedi insights are not more sensitive to such things. \n\nANAKIN: I simply don't sense betrayal in Senator Amidala. \n\nPALPATINE studies ANAKIN carefully and gives him a skeptical look. \n\nPALPATINE: Yes, you do, but you don't seem to want to admit it. There is much conflict in you, Anakin. \n\n117",
        "dictionary": {
            "Chancellor": "Head of State",
            "Jedi": "Mystic Warrior",
            "Republic": "Galactic Government",
            "Senator": "Elected Representative"
        }
    },
    {
        "message_id": 1461,
        "passage": "KI-ADI-MUNDI, ANAKIN, YODA, MACE, CLONE COMMANDER CODY, and AAYLA SECURA talk via holograms. \n\nCLONE COMMANDER CODY: Master Windu, may I interrupt? General Kenobi has made contact with General Grievous, and we \nhave begun our attack. \n\nMACE WlNDU: Thank you, Commander. Anakin, deliver this report to the Chancellor. His reaction will give us a clue to his \nintentions. \n\nANAKIN: Yes, Master. \n\nANAKIN leaves the room. COMMANDER CODY's hologram disappears. \n\nMACE WINDU: I sense a plot to destroy the Jedi. The dark side of the Force surrounds the Chancellor. \n\nKl-ADI-MUNDI: If he does not give up his emergency powers after the destruction of Grievous, then he should be removed from \noffice. \n\nMACE WiNDU: That could be a dangerous move ... the Jedi Council would have to take control of the Senate in order to secure a peaceful transition . . . \n\nKl-ADI-MUNDI: . . . and replace the Congress with Senators who are not filled with greed and corruption. \n\nYODA: To a dark place this line of thought will carry us. Hmmmmm. . . . great care we must take. \n\n118",
        "dictionary": {
            "KI-ADI-MUNDI": "High Council",
            "Anakin": "Luke",
            "YODA": "Wise Jedi",
            "MACE": "Jedi Master",
            "CLONE COMMANDER CODY": "Military Officer",
            "AAYLA SECURA": "Jedi Knight"
        }
    },
    {
        "message_id": 1462,
        "passage": "ANAKIN brings news to PALPATINE. \n\nANAKIN: Chancellor, we have just received a report from Master Kenobi. He has engaged General Grievous. \n\nPALPATINE: We can only hope that Master Kenobi is up to the challenge. \n\nANAKIN: I should be there with him. \n\nPALPATINE: It is upsetting to me to see that the Council doesn't seem to fully appreciate your talents. Don't you wonder why they won't make you a Jedi Master? \n\nANAKIN: I wish I knew. More and more I get the feeling that I am being excluded from the Council. I know there are things about the Force that they are not telling me. \n\nPALPATINE: They don't trust you, Anakin. They see your future. They know your power will be too strong to control. Anakin, you must break through the fog of lies the Jedi have created around you. Let me help you to know the subtleties of the Force. \n\nThey walk into the hallway. \n\nANAKIN: How do you know the ways of the Force? \n\nPALPATINE: My mentor taught me everything about the Force . . . even the nature of the dark side. \n\nThey stop. \n\nANAKIN: You know the dark side?!? \n\nPALPATINE: Anakin, if one is to understand the great mystery, one must study all its aspects, not just the dogmatic, narrow view of the Jedi. If you wish to become a complete and wise leader, you must embrace a larger view of the Force. Be careful of the Jedi, Anakin. (pausing) They fear you. In time they will destroy you. Let me train you. \n\nANAKIN: I won't be a pawn in your political game. The Jedi are my family. \n\nPALPATINE: Only through me can you achieve a power greater than any Jedi. Learn to know the dark side of the Force, Anakin, and you will be able to save your wife from certain death. \n\nANAKIN: What did you say? \n\nPALPATINE: Use my knowledge, I beg you . . . \n\nANAKIN: You're a Sith Lord! \n\nANAKIN ignites his lightsaber. \n\nPALPATINE: I know what has been troubling you . . . Listen to me. Don't continue to be a pawn of the Jedi Council! Ever since I've known you, you've been searching for a life greater than that of an ordinary Jedi . . . a life of significance, of conscience. \n\nANAKIN: You're wrong! \n\nPALPATINE: Are you going to kill me? \n\nANAKIN: I would certainly like to. \n\nPALPATINE: I know you would. I can feel your anger. It gives you focus, makes you stronger. \n\nANAKIN raises his lightsaber to PALPATINE's throat. There is a tense moment, then ANAKIN relaxes, and then turns off his lightsaber. \n\nANAKIN: I am going to turn you over to the Jedi Council. \n\nPALPATINE: Of course you should. But you're not sure of their intentions, are you? What if I am right and they are plotting to take over the Republic? \n\nANAKIN: I will quickly discover the truth of all this. \n\nPALPATINE: You have great wisdom, Anakin. Know the power of the dark side. The power to save Padme. \n\nANAKIN stares at him for a moment. \nPALPATINE turns and moves to his office. \n\nPALPATINE: (continuing) I am not going anywhere. You have time to decide my fate. Perhaps you'll reconsider and help me rule the galaxy for the good of all . . . \n\nPALPATINE sits behind his desk. \n\n119",
        "dictionary": {
            "ways of the Force": "path of the energy",
            "dark side": "shadowy aspect",
            "Sith Lord": "powerful sorcerer",
            "Jedi": "Guardians of Peace"
        }
    },
    {
        "message_id": 1463,
        "passage": "OBI-WAN gives the LIZARD a swift kick with the heel of his boot, and they take off down the vertical side of the sheer cliff. As GENERAL GRIEVOUS reaches the landing platform where his shuttle is waiting. OBI-WAN drops onto the top of the starship with his LIZARD. GENERAL GRIEVOUS spins his scooter around and takes off up the vertical cliff face with OBI-WAN and his LIZARD in hot pursuit. The sinkhole is engulfed in a great battle between CLONES and DROIDS. The PEOPLE OF UTAPAU cower in whatever shelter they can find. \n\n120",
        "dictionary": {
            "LIZARD": "Reptile",
            "GENERAL GRIEVOUS": "High-ranking Officer",
            "CLONES": "Recreated Soldiers",
            "DROIDS": "Robot Warriors",
            "PEOPLE OF UTAPAU": "Inhabitants of the Planet"
        }
    },
    {
        "message_id": 1464,
        "passage": "A LARGE GROUP OF UTAPAUAN TROOPS on LIZARDS attack the DROID ARMY. \n\nOBI-WAN and GENERAL GRIEVOUS race through the city at breakneck speed. Passing through battle zones, narrowly escaping EXPLOSIONS, laser bolts, and TROOPS from both sides. \n\nGENERAL GRIEVOUS lays the Scooter down as he goes around sharp turns. Obi-Wan's LIZARD breathes hard as she tries to keep up. They destroy droids, equipment, and clone troops as the JEDI and the GENERAL cut a swath of destruction through the city. \n\n121",
        "dictionary": {
            "UTAPAUAN": "Native Troops",
            "DROID ARMY": "Robot Forces",
            "LIZARDS": "Reptilian Creatures",
            "GENERAL GRIEVOUS": "High-Ranking Officer",
            "EXPLOSIONS": "Explosive Blasts",
            "TROOPS": "Soldiers"
        }
    },
    {
        "message_id": 1465,
        "passage": "GENERAL GRIEVOUS works his way out onto the rim of the sinkhole, passing some wind blades. The evil Droid General releases the brakes on the lethal blades, and they begin to spin, cutting off Obi-Wan's access to the General. Obi-Wan's LIZARD pulls up short in front of the blades. GENERAL GRIEVOUS laughs and talks into a comlink. \n\nGENERAL GRIEVOUS: Prepare to move out of orbit. I will be up in a few moments. \n\nOBI-WAN sizes up the situation, looking for a way to get to GENERAL GRIEVOUS. \n\nThe GENERAL accelerates off the edge, activating his claws, drops, and clings to another nearby grouping of windmills. Obi-Wan's LIZARD attempts to jump to follow and barely makes it, almost falling into the precipice below. \n\n122",
        "dictionary": {
            "Droid General": "Cyber Commander",
            "LIZARD": "Vehicle",
            "wind blades": "whirling blades"
        }
    },
    {
        "message_id": 1466,
        "passage": "GENERAL GRIEVOUS roars through the stone block tunnel system, riding up on the curved walls as he goes around corners or passes oncoming traffic. OBI-WAN races after the Droid, his LIZARD moving onto the ceiling as they pass traffic. OBI-WAN catches up with GENERAL GRIEVOUS, and they charge through the tunnel, side by side. OBI-WAN grabs the Droid's electronic staff. \n\n123",
        "dictionary": {
            "LIZARD": "vehicle",
            "Droid": "robot"
        }
    },
    {
        "message_id": 1467,
        "passage": "Extending from the wall of a small sinkhole is a secret landing platform with a small Federation Fighter sitting in the middle of it. OBI-WAN and GENERAL GRIEVOUS race out of the tunnel system and onto the landing platform. \n\nOBI-WAN yanks on the staff, then jumps off his LIZARD onto the General's scooter, knocking both warriors to the ground. GENERAL GRIEVOUS pulls out a laser pistol and fires at OBI-WAN. The Jedi reaches out his hand, grabs the General's electro-staff and spins the staff, blocking the laser bolts. \n\nOBI-WAN charges GENERAL GRIEVOUS, swinging the staff and hitting the Droid in the stomach, knocking the gun away. GENERAL GRIEVOUS is hit by the staff, and the Force bends his forearm. He pulls OBI-WAN close to him, and they engage in a furious fight. The electro-staff is knocked away. The two engage in hand-to-hand combat. OBI-WAN struggles to avoid the deadly blows of the brutal, unstoppable Droid. \n\nGENERAL GRIEVOUS's stomachplate is loose. OBI-WAN grabs it and rips it off, revealing the alien life form's guts encased in a bag in the Droid's chest. GENERAL GRIEVOUS grabs OBI-WAN, hoists him over his head, and tosses him across the platform. OBI-WAN dangles off the edge of the platform. He clutches the rim, trying to hold on. The DROID then grabs the staff and charges OBI-WAN. At the last second, OBI-WAN reaches out his hand and uses the Force to retrieve the Droid's laser pistol. \n\nThe JEDI fires several blasts in the stomach area of the alien Droid, and he EXPLODES from the inside out. The smoldering Droid falls to the ground. OBI-WAN has killed GENERAL GRIEVOUS. He pulls himself up onto the platform and walks by the destroyed carcass. \n\nOBI-WAN: So uncivilized . . . \n\nOBI-WAN brushes himself off. He throws the pistol onto the platform, picks up the electro-staff, and jumps on BOGA. The trusty beast rears up and takes off into the tunnel system. \n\n124",
        "dictionary": {
            "OBI-WAN": "Captain",
            "GENERAL GRIEVOUS": "Commander",
            "LIZARD": "Vehicle",
            "BOGA": "Mount",
            "JEDI": "Warrior",
            "DROID": "Robot",
            "electro-staff": "Energy Rod",
            "Federation Fighter": "Spacecraft",
            "Force": "Energy Field"
        }
    },
    {
        "message_id": 1468,
        "passage": "MACE and the JEDI (AGEN KOLAR, KIT FISTO, AND SAESEE TIIN) are preparing to board a JEDI GUNSHIP to the CHANCELLOR's office. ANAKIN enters the hangar. \n\nANAKIN: Master Windu, I must talk to you. \n\nMACE WiNDU: What is it, Skywalker? We are in a hurry. We have just received word that Obi-Wan has destroyed General Grievous. We are on our way to make sure the Chancellor returns emergency powers back to the Senate. \n\nANAKIN: He won't give up his power. I've just learned a terrible truth. I think Chancellor Palpatine is a Sith Lord. \n\nMACE WINDU: A Sith Lord? \n\nANAKIN: Yes. The one we have been looking for. \n\nMACE WiNDU: How do you know this? \n\nANAKIN: He knows the ways of the Force. He has been trained to use the dark side. \n\nMACE WiNDU: Are you sure? \n\nANAKIN: Absolutely. \n\nMACE WiNDU: Then our worst fears have been realized. We must move quickly if the Jedi Order is to survive. \n\nANAKIN: Master, the Chancellor is very powerful. You will need my help if you are going to arrest him. \n\nMACE WiNDU: For your own good, stay out of this affair. I sense a great deal of confusion in you, young Skywalker. There is much fear that clouds your judgment. \n\nANAKIN: I must go, Master. \n\nMACE WiNDU: No. If what you told me is true, you will have gained my trust, but for now remain here. \n\nANAKIN: Yes, Master. \n\nMACE WiNDU: Wait for us in the Council Chamber until we return. \n\nANAKIN: Yes, Master. \n\nANAKIN watches as the JEDI leave in their ship. \n\n125",
        "dictionary": {
            "JEDI": "Peacekeepers",
            "CHANCELLOR": "Leader",
            "Sith Lord": "Dark Side Master",
            "JEDI GUNSHIP": "Space Cruiser",
            "MACE": "General",
            "AGEN KOLAR": "Jedi Knight",
            "KIT FISTO": "Jedi Master",
            "SAESEE TIIN": "Jedi Councilor"
        }
    },
    {
        "message_id": 1469,
        "passage": "(INTERCUT) \n\nPADME is alone in her apartment, thinking of Anakin. ANAKIN sits alone in the Jedi Council Chamber thinking of PADME. \n\nPALPATINE: (V.O.) You do know, don't you, if the Jedi destroy me, any chance of saving her will be lost. \n\nPADME: I truly, deeply love you. Before I die. I want you to know. \n\nC-3PO: My Lady, are you. . . . Are you all right? \n\nANAKIN: I can't do this ... I can't let her die. \n\nANAKIN rushes out of the Council Chamber and to his speeder. The hangar door opens and he lifts off. \n\n126",
        "dictionary": {
            "Jedi": "Guardians of Peace",
            "V.O.": "Off-camera voice",
            "My Lady": "Ma'am",
            "Council Chamber": "Meeting Room"
        }
    }
]