[
    {
        "message_id": 1470,
        "passage": "The sky is still blue as a JEDI GUNSHIP lands on the Senate Office Building landing platform. \nFOUR JEDI exit the SHUTTLE and enter the Senate Office Building. MACE WINDU, AGEN KOLAR, KIT FISTO, and SAESEE TIIN, like gunfighters out of the Old West, walk through the massive hallway, four across. \n\n127",
        "dictionary": {
            "JEDI GUNSHIP": "military spacecraft",
            "FOUR JEDI": "four warriors",
            "SHUTTLE": "spacecraft",
            "MACE WINDU": "Kaelin",
            "AGEN KOLAR": "Kael",
            "KIT FISTO": "Gideon",
            "SAESEE TIIN": "Tinn"
        }
    },
    {
        "message_id": 1471,
        "passage": "The FOUR JEDI enter the lobby, raising their arms, and send the Chancellor's aide, DAR WAC, flying against the wall, along with TWO REPUBLIC GUARDS. They storm into the Chancellor's office. \n\n128",
        "dictionary": {
            "FOUR JEDI": "Four Knights",
            "DAR WAC": "Aide",
            "TWO REPUBLIC GUARDS": "Two Security Officers"
        }
    },
    {
        "message_id": 1472,
        "passage": "MACE arrives with THREE JEDI to arrest PALPATINE. \n\nPALPATINE: Master Windu. I take it General Grievous has been destroyed then. I must say, you're here sooner than expected. \n\nMACE WINDU: In the name of the Galactic Senate of the Republic, you are under arrest, Chancellor. \n\nMACE WINDU and the other JEDI ignite their lightsabers. \n\nPALPATINE: Are you threatening me, Master Jedi? \n\nMACE: The Senate will decide your fate. \n\nPALPATINE: (burst of anger) I am the Senate! \n\nMACE: Not yet! \n\nPALPATINE stands, a laser sword appears out of his cloak sleeve, and he spins toward the JEDI. \n\nPALPATINE: It's treason, then. \n\nA close shot of PALPATINE as the fight begins. Close shots of THREE JEDI getting cut down by PALPATINE. PALPATINE and MACE continue to fight. \n\nJedi Master MACE WINDU and the Sith Lord fight their way down the hallway and into the main office area. PALPATINE is able to use the Force to slam MACE against the wall, but he recovers before the Chancellor can cut him down. \n\nANAKIN lands his speeder, jumps out, and runs down a long corridor toward the Chancellor's office. \n\nIn the heat of battle, MACE cuts the window behind the Chancellor's desk, and it crashes away. MACE is forced out onto the ledge, which is twenty stories up. They fight over the precipice. ANAKIN arrives to see PALPATINE and MACE fighting. \n\nThey stop as MACE forces PALPATINE to drop his sword. PALPATINE and MACE start yelling at each other. \n\nMACE WINDU: You are under arrest, My Lord. \n\nPALPATINE: Anakin! I told you it would come to this. I was right. The Jedi are taking over. \n\nMACE WlNDU: You old fool. The oppression of the Sith will never return. Your plot to regain control of the Republic is over . . . you have lost . . . \n\nPALPATINE: No! No! You will die! \n\nPALPATINE raises his hands, and lightning bolts shoot out. They are blocked by MACE's lightsaber. PALPATINE is pushed back against the window sill. \n\nPALPATINE: He is a traitor, Anakin. \n\nMACE WlNDU: He's the traitor. Stop him! \n\nPALPATINE: Come to your senses, boy. The Jedi are in revolt. They will betray you, just as they betrayed me. \n\nMACE WlNDU: Aarrrrggghhhhh . . . \n\nPALPATINE: You are not one of them, Anakin. Don't let him kill me. \n\nMACE WlNDU: Aarrrrggghhhhh . . . \n\nPALPATINE: I am your pathway to power. I have the power to save the one you love. You must choose. You must stop him. \n\nMACE WlNDU: Don't listen to him, Anakin. \n\nPALPATINE: Help me! Don't let him kill me. I can't hold on any longer. Ahhhhhhh . . . ahhhhhhh . . . ahhhhhhh . . . \n\nMACE pushes PALPATINE out to the edge of the ledge. As the Jedi moves closer, the bolts from Palpatine's hands begin to arch back on him. The Chancellor's face begins to twist and distort. His eyes become yellow as he struggles to intensify his powers. \n\nPALPATINE: I can't ... I give up. Help me. I am weak ... I am too weak. Don't kill me. I give up. I'm dying. I can't hold on any longer. \n\nMACE WlNDU: You Sith disease. I am going to end this once and for all. \n\nANAKIN: You can't kill him, Master. He must stand trial. \n\nMACE WlNDU: He has too much control of the Senate and the Courts. He is too dangerous to be kept alive. \n\nPALPATINE: I'm too weak. Don't kill me. Please. \n\nANAKIN: It is not the Jedi way . . . \n\nMACE raises his sword to kill the CHANCELLOR. \n\nANAKIN: (continuing) He must live . . . \n\nPALPATINE: Please don't, please don't . . . \n\nANAKIN: I need him . . . \n\nPALPATINE: Please don't . . . \n\nANAKIN: NO!!! \n\nJust as MACE is about to slash PALPATINE, ANAKIN steps in and cuts off the Jedi's hand holding the lightsaber. \n\nAs MACE stares at ANAKIN in shock, PALPATINE springs to life. \nThe full force of Palpatine's powerful Bolts blasts MACE. He attempts to deflect them with his one good hand, but the force is too great. As blue rays engulf his body, he is flung out the window and falls twenty stories to his death. No more screams. No more moans. PALPATINE lowers his arm. \n\nPALPATINE: Power! Unlimited power! \n\nHis face has changed into a horrible mask of evil. ANAKIN looks on in horror. PALPATINE cackles. \n\nANAKIN: What have I done? \n\nANAKIN sits. \n\nPALPATINE: You are fulfilling your destin, Anakin. Become my apprentice. Learn to use the dark side of the Force. \n\nANAKIN: I will do whatever you ask. \n\nPALPATINE: Good. \n\nANAKIN: Just help me save Padme's life. I can't live without her. I won't let her die. I want the power to stop death. \n\nPALPATINE: To cheat death is a power only one has achieved, but if we work together, I know we can discover the secret. \n\nANAKIN kneels before PALPATINE. \n\nANAKIN: I pledge myself to your teachings. To the ways of the Sith. \n\nPALPATINE: Good. Good. The Force is strong with you. A powerful Sith you will become. Henceforth, you shall be known as Darth . . . Vader. \n\nANAKIN: Thank you. my Master. \n\nPALPATINE: Rise, Darth Vader. \n\nPalpatine moves over to his desk. \n\n129",
        "dictionary": {
            "Sith": "Dark Force Warrior",
            "Jedi": "Guardians of Peace",
            "Galactic Senate": "Intergalactic Assembly",
            "Chancellor": "Leader of the Republic"
        }
    },
    {
        "message_id": 1473,
        "passage": "YODA winces, closes his eyes, and holds his head. He feels a disturbance in the Force. \n\n130",
        "dictionary": {
            "Force": "energy field",
            "Yoda": "the wise one"
        }
    },
    {
        "message_id": 1474,
        "passage": "PALPATINE is putting on his dark cloak: he is now fully DARTH SIDIOUS. \n\nPALPATINE: Because the Council did not trust you, my young apprentice, I believe you are the only Jedi with no knowledge of this plot. When the Jedi learn what has transpired here, they will kill us, along with all the Senators. \n\nANAKIN: I agree. The Jedi's next move will be against the Senate. \n\nPALPATINE: Every single Jedi, including your friend Obi-Wan Kenobi, is now an enemy of the Republic. You understand that, don't you? \n\nANAKIN: I understand, Master. \n\nPALPATINE: We must move quickly. The Jedi are relentless; if they are not all destroyed, it will be civil war without end. First, I want you to go to the Jedi Temple. We will catch them off balance. Do what must be done, Lord Vader. Do not hesitate. Show no mercy. Only then will you be strong enough with the dark side to save Padme. \n\nANAKIN: What about the other Jedi spread across the galaxy? \n\nPALPATINE: Their betrayal will be dealt with. After you have killed all the Jedi in the Temple, go to the Mustafar system. Wipe out Viceroy Gunray and the other Separatist leaders. Once more, the Sith will rule the galaxy, and we shall have peace. \n\n131",
        "dictionary": {
            "DARTH SIDIOUS": "Dark Lord",
            "Jedi": "Knights of the Force",
            "Sith": "Dark Warriors",
            "Lord Vader": "Dark Knight",
            "Padme": "Princess"
        }
    },
    {
        "message_id": 1475,
        "passage": "ANAKIN goes to the Jedi Temple with a battalion of Clone Troopers. \n\n132",
        "dictionary": {
            "Clone Troopers": "Elite Soldiers",
            "Jedi Temple": "Sacred Citadel"
        }
    },
    {
        "message_id": 1476,
        "passage": "The battle between the CLONES and the DROIDS rages throughout the sinkhole. OBI-WAN rides up to CLONE COMMANDER CODY. \n\nOBI-WAN: Commander, contact your troops. Tell them to move to the higher levels. \n\nCLONE COMMANDER CODY: Very good, sir. \n\nCLONE COMMANDER CODY starts to move away, then remembers something and returns to OBI-WAN. \n\nCLONE COMMANDER CODY: (continuing) Oh, by the way, I think you'll be needing this. \n\nHe hands OBI-WAN his lightsaber, and the LIZARD rears up. \n\nOBI-WAN: Thank you, Cody, (smiling) Now let's get a move on. We've got a battle to win here. \n\nCLONE COMMANDER CODY: Yes, sir! \n\nOBI-WAN and the LIZARD ride off down the wall of the giant sinkhole. \nThe battle rages throughout the city. CLONE COMMANDER CODY (2224,) takes out his comlink and listens to the HOLOGRAM OF DARTH SIDIOUS as, far below, OBI-WAN can been seen battling DROIDS on a landing platform. \n\nDARTH SlDIOUS: Commander Cody, the time has come. Execute Order Sixty-Six. \n\nCLONE COMMANDER CODY: It will be done, My Lord. \n\nThe HOLOGRAM disappears, and CLONE COMMANDER CODY gestures to a nearby Clone Trooper. \n\nCLONE COMMANDER CODY: Blast him! \n\nThe battle rages all around OBI-WAN. DROIDS and CLONES are everywhere. OBI-WAN is riding on a LIZARD, cutting down DROIDS as he races across the battlefield. Suddenly a volley of laser blasts from behind him knocks him and his LIZARD off the wall of the sinkhole. He looks around just in time to see his CLONE TROOPS are firing on him. \nOBI-WAN falls hundreds of feet to the bottom of the water-filled sinkhole. \n\n133",
        "dictionary": {
            "CLONES": "Mechanized Soldiers",
            "DROIDS": "Robotic Warriors",
            "OBI-WAN": "General Owen",
            "CLONE COMMANDER CODY": "Lieutenant Commander Chris",
            "LIZARD": "Reptilian Mount",
            "HOLOGRAM OF DARTH SIDIOUS": "Projection of Lord Dark",
            "ORDER SIXTY-SIX": "Operational Directive Sixty-Six"
        }
    },
    {
        "message_id": 1477,
        "passage": "The sky slowly awakens on the crystal world of Mygeeto. A battle rages. Clone troops battle the droid armies across a long bridge. KI-ADI-MUNDi uses his light saber to deflect enemy fire. CLONE COMMANDER BACARA (1138) exits a Gunship near the entrance to the city. He rallies his TROOPS to attack the city, then gets a message on his comlink. He stops and moves to one side as a HOLOGRAM OF DARTH SIDIOUS appears on the comlink in the palm of his hand. He moves further into the shadows. \n\nDARTH SlDIOUS: Commander 1138 . . . \n\nCLONE COMMANDER BACARA: Yes, sir. \n\nDARTH SlDIOUS: The time has come. Execute Order Sixty-Six. \n\nCLONE COMMANDER BACARA: It will be done, My Lord. \n\nDARTH SIDIOUS fades, and the CLONE COMMANDER snaps the comlink closed and looks to the main plaza of the city, where KI-ADI-MUNDI is leading the charge. The clones stop. KI-ADI-MUNDI turns around and is blasted by clone fire. He's killed before he can defend himself. \n\n134",
        "dictionary": {
            "Darth Sidious": "The Emperor",
            "Order Sixty-Six": "The Execution Order",
            "Clone Commander": "Troop Commander",
            "Hologram": "Projection"
        }
    },
    {
        "message_id": 1478,
        "passage": "A column of CLONE WALKERS marches across the forest floor. The STRANGE CALLS of the alien forest creatures of FELUCIA suddenly stop. The Jedi AAYLA SECURA and her CLONE TROOPS brace for an ambush. \n\nAAYLA: Steady. . . . steady . . . \n\nThey all look around for signs of the enemy. CLONE COMMANDER BLY moves up behind the Jedi. \n\nAAYLA: (continuing) Bly, do you think they're Droids? \n\nBLY: No. \n\nBLY blasts AAYLA in the back. The OTHER CLONES fire on her as she hits the ground. \n\nAnother Jedi, BARRISS OFFEE, is cutting down a patrol of DROIDS when a CLONE WALKING TANK and SEVEN CLONE TROOPERS round a corner and blast the Jedi away. \n\n135",
        "dictionary": {
            "CLONE WALKERS": "Mechanical Soldiers",
            "STRANGE CALLS": "Unusual Noises",
            "FELUCIA": "Exotic Planet",
            "AAYLA SECURA": "Jedi Master",
            "CLONE TROOPS": "Mechanical Soldiers",
            "CLONE COMMANDER BLY": "Military Leader",
            "Droids": "Robotic Soldiers",
            "BARRISS OFFEE": "Jedi Knight",
            "CLONE WALKING TANK": "Mechanical Vehicle"
        }
    },
    {
        "message_id": 1479,
        "passage": "YODA drops his gimer stick, clutches his chest, and rests against a wall. \n\n136",
        "dictionary": {
            "YODA": "the wise one",
            "gimer stick": "walking cane"
        }
    }
]