[
    {
        "message_id": 2040,
        "passage": "Through the round window behind the Emperor's throne can be\n     seen the distant flashes of the space battle in progress.\n\n                         EMPEROR\n               Come, boy. See for yourself.\n\n     The Emperor is sitting in his throne, with Vader standing at\n     his side. Luke moves to look through a small section of the\n     window.\n\n                          EMPEROR (CONT’D)\n               From here you will witness the\n               final destruction of the Alliance,\n               and the end of your insignificant\n               Rebellion.\n\n     Luke is in torment. He glances at his lightsaber sitting on\n     the armrest of the throne. The Emperor watches him and\n     smiles, touches the lightsaber.\n\n                         EMPEROR (CONT’D)\n               You want this, don't you? The hate\n               is swelling in you now. Take your\n               Jedi weapon. Use it. I am unarmed.\n               Strike me down with it. Give in to\n               your anger. With each passing\n               moment, you make yourself more my\n               servant.\n\n     Vader watches Luke in his agony.\n\n                           LUKE\n               No!\n\n                         EMPEROR\n               It is unavoidable. It is your\n               destiny. You, like your father, are\n               now mine!\n\n99",
        "dictionary": {
            "Rebellion": "Resistance",
            "Jedi": "Warrior",
            "lightsaber": "energy blade"
        }
    },
    {
        "message_id": 2041,
        "passage": "Han, Leia, Chewie, and the rest of the strike team are led\n     out of the bunker by their captors. The surrounding area,\n     deserted before, is now crowded with two-legged Imperial\n     walkers and hundreds of Imperial troops. The situation looks\n     hopeless.\n\n                         STORMTROOPER\n               All right, move it! I said move it!\n               Go on!\n\n     From the undergrowth beyond the clearing comes a wild series\n     of beeps and whistles. And --\n\n                         THREEPIO\n               Hello! I say, over there! Were you\n               looking for me?\n\n                         BUNKER COMMANDER\n               Bring those two down here!\n\n                           STORMTROOPER\n               Let's go!\n\nArtoo and Threepio are standing near one of the big trees. As\nsix Imperial stormtroopers rush over to take them captive,\nthe two droids duck out of sight behind the tree.\n\n                    THREEPIO\n          Well, they're on their way. Artoo,\n          are you sure this was a good idea?\n\n                    STORMTROOPER\n          Freeze! Don't move!\n\n                    THREEPIO\n          We surrender.\n\nThe stormtroopers come around the tree and find the two\ndroids waiting quietly to be taken. As the Imperial troops\nmove to do that, however, a band of Ewoks drops down from\nabove and overpowers them.\n\n                    THREEPIO (CONT’D)\n          Ohhh! Stand back, Artoo.\n\nIn a nearby tree, an Ewok raises a horn to his lips and\nsounds the EWOK ATTACK CALL. All hell breaks loose as\nhundreds of Ewoks throw their fuzzy bodies into the fray\nagainst the assembled stormtroopers and their awesome two-\nlegged walkers. Biker scouts dart about blasting Ewoks, only\nto be crushed by a volley of rocks tossed by Ewoks from the\ntrees above.\n\nIn the confusion of the battle, Han and Leia break away and\ndive for the cover of the bunker door as explosions erupt\naround them. Han goes to the bunker door control panel.\n\n                    LEIA\n          The code's changed. We need Artoo!\n\n                    HAN\n          Here's the terminal.\n\n                    LEIA   (INTO COMLINK)\n          Artoo, where are you? We need you\n          at the bunker right away.\n\nArtoo and Threepio are hiding behind a log as the battle\nragesaround them. Suddenly the stubby little astrodroid lets\nout a series of whistles and shoots off across the\nbattlefield. Threepio, panicked, runs after him.\n\n                    THREEPIO\n          Going? What do you mean, you're\n          going. But-- but going where,\n          Artoo? No, what! Artoo! Oh, this is\n          no time for heroics. Come back!\n\n      Biker scouts race around and over the two droids, blasting\n      away at the little Ewoks as the furries scurry for cover.\n\n      A group of Ewoks have moved a primitive catapult into\n      position. They fire off a large boulder that hits one of the\n      walkers. The walker turns and heads for the catapult,\n      blasting away with both guns. The Ewoks abandon their weapons\n      and flee in all directions. Just as the walker moves in to\n      stomp the catapult, Ewoks drop vines restraining two huge\n      logs that swing down and smash thewalker's head flat.\n\n      A line of Ewoks hang desperately to a vine that is hooked to\n      a walker's foot. As the walker moves along, the fuzzy\n      creatures are dragged behind.\n\n      Two speeder bikes chase Ewoks through the underbrush. As the\n      scouts round a tree, they are knocked off their bikes by a\n      vinetied between two trees.\n\n100",
        "dictionary": {
            "EWOK ATTACK CALL": "Battle Cry",
            "BUNKER COMMANDER": "Imperial Officer",
            "STORMTROOPER": "Army Soldier",
            "THREEPIO": "Robot Assistant",
            "AROO": "Astro Droid",
            "EWOK": "Furry Creature"
        }
    },
    {
        "message_id": 2042,
        "passage": "The Falcon and other Rebel fighters are engaged in a\n      ferocious combat with Imperial TIE fighters, the battle\n      raging around thecruisers of the Rebel armada.\n\n101",
        "dictionary": {
            "TIE": "Enemy Pilots",
            "Rebel armada": "Allied Fleet"
        }
    },
    {
        "message_id": 2043,
        "passage": "Lando is in radio communication with the pilots of the other\n      Rebel squads.\n\n                            LANDO\n                  Watch yourself, Wedge! Three from\n                  above!\n\n                            WEDGE\n                  Red Three, Red Two, pull in!\n\n                            RED TWO\n                  Got it!\n\n                            RED THREE\n                  Three of them coming in, twenty\n                  degrees!\n\n                            WEDGE\n                  Cut to the left! I'll take the\n                  leader! They're heading for the\n                  medical frigate.\n\n      Lando steers the Falcon through a complete flip, as his crew\n      fires at the TIEs from the belly guns.\n\n                            NAVIGATOR\n                  Pressure's steady.\n\n      The copilot Nien Nunb chatters an observation.\n\n                          LANDO\n                Only the fighters are attacking. I\n                wonder what those Star Destroyers\n                are waiting for.\n\n102",
        "dictionary": {
            "TIEs": "enemy fighters",
            "Star Destroyers": "large warships"
        }
    },
    {
        "message_id": 2044,
        "passage": "The giant Imperial Star Destroyer waits silently some\n      distance from the battle. The Emperor's huge Super Star\n      Destroyer rests in the middle of the fleet.\n\n103",
        "dictionary": {
            "Imperial Star Destroyer": "Mighty Warship",
            "Super Star Destroyer": "Gigantic Warship"
        }
    },
    {
        "message_id": 2045,
        "passage": "Admiral Piett and two fleet commanders watch the battle at\n      the huge window of the Super Star Destroyer bridge.\n\n                          COMMANDER\n                We're in attack position now, sir.\n\n                             PIETT\n                Hold here.\n\n                          COMMANDER\n                We're not going to attack?\n\n                          PIETT\n                I have my orders from the Emperor\n                himself. He has something special\n                planned for them. We only need to\n                keep them from escaping.\n\n104",
        "dictionary": {
            "Super Star Destroyer": "Gigantic Warship",
            "Emperor": "Supreme Leader"
        }
    },
    {
        "message_id": 2046,
        "passage": "The Emperor, Vader, and a horrified Luke watch the aerial\n      battle fireworks out the window and on the viewscreens.\n      Another Rebel ship explodes against the protective shield.\n\n                          EMPEROR\n                As you can see, my young\n                apprentice, your friends have\n                failed. Now witness the firepower\n                of this fully armed and operational\n                battle station.\n                    (into comlink)\n                Fire at will, Commander.\n\n      Luke, in shock, looks out across the surface of the Death\n      Star to the Rebel fleet beyond.\n\n105",
        "dictionary": {
            "Death Star": "Galactic Fortress",
            "fully armed and operational": "fully equipped and functioning",
            "Rebel fleet": "enemy armada"
        }
    },
    {
        "message_id": 2047,
        "passage": "Controllers pull back on several switches. Commander\n      Jerjerrod stands over them.\n\n                          JERJERROD\n                Fire!\n\n106",
        "dictionary": {}
    },
    {
        "message_id": 2048,
        "passage": "A button is pressed, which switches on a panel of lights. A\n      hooded Imperial soldier reaches overhead and pulls a lever. A\n      huge beam of light emanates from a long shaft. Two\n      stormtroopers stand to one side at a control panel.\n\n107",
        "dictionary": {
            "stormtroopers": "space marines",
            "Imperial": "government"
        }
    },
    {
        "message_id": 2049,
        "passage": "The giant laser dish on the completed half of the Death Star\n      begins to glow; Then a powerful beams shoots out toward the\n      aerial battle.\n\n108",
        "dictionary": {
            "Death Star": "Galactic Fortress",
            "laser dish": "energy projector"
        }
    }
]