[
    {
        "message_id": 110,
        "passage": "CAPTAIN PANAKA, ANAKIN, and PADME rush into the cockpit where OBI-WAN and\nRIC OLIE are checking the hyperdrive.\n\nCAPT. PANAKA : Qui-Gon is in trouble, he says to take off!\nPILOT : I don't see anything.\nOBI-WAN : Over there! Fly low!\n\nIn the distance is a small cloud of dust.",
        "dictionary": {
            "Qui-Gon": "Commander",
            "Anakin": "Young Pilot",
            "Padme": "Senator",
            "Obi-Wan": "Navigator",
            "Captain Panaka": "Flight Commander"
        }
    },
    {
        "message_id": 111,
        "passage": "QUI-GON and DARTH MAUL continue theirsword battle. Leaping over one another\nin an incredible display of acrobatics, the two warrios hear the ship fly\nover them a few feet off the ground. QUI-GON almost dissapears for a\nmoment.\nBefore DARTH MAUL knows what's happening, QUI-GON is on the spacecrat's\nramp.",
        "dictionary": {
            "DARTH MAUL": "Dark Lord",
            "warrios": "fighters",
            "spacecrat": "craft"
        }
    },
    {
        "message_id": 112,
        "passage": "The SITH LORD immediately jumps onto the ramp after QUI-GON, but barely\nmakes it. His heels hang over the edge of a forty-foot drop. QUI-GON swings\nhis laser sword with all his might and knocks DARTH AMUL off the ramp and\nonto the desert floor. The ramp closes, and the Naboo craft rockets away,\nleaving the Sith Lord standing alone.",
        "dictionary": {
            "SITH LORD": "Dark Lord",
            "QUI-GON": "General",
            "DARTH AMUL": "Dark Knight",
            "Naboo craft": "Alien Vessel"
        }
    },
    {
        "message_id": 113,
        "passage": "The sleek spacecraft rockets away from the planet Tatooine.",
        "dictionary": {
            "Tatooine": "Dusty Planet"
        }
    },
    {
        "message_id": 114,
        "passage": "ANAKIN and OBI-WAN rush into the hallway to find QUI-GON collapsed on the\nfloor opposite the entry. ARTOO is looking over him. The JEDI is breathing\nhard, wet with sweat and covered in dirt.\n\nANAKIN : Are you all right?\nQUI-GON : I think so... that was a surpirse I wont soon forget.\nOBI-WAN : What was it?\nQUI-GON : I don't know... but he was well trained in the Jedi arts. My\nguess is he was after the Queen...\nANAKIN : Do you think he'll follow us?\nQUI-GON : We'll be safe enough once we're in hyperspace, but I have no\ndoubt he knows our destination.\nANAKIN : What are we going to do about it?\n\nOBI-WAN gives ANAKIN a \"who are you?\" look. ANAKIN returns an innocent\nstare.\n\nQUI-GON : We will be patient. Anakin Skywalker, meet Obi-Wan Kenobi.\nANAKIN : Pleased to meet you. Wow! You're a Jedi too?\n\nOBI-WAN gives the boy a skeptical look.",
        "dictionary": {
            "JEDI": "Warriors of Peace",
            "QUI-GON": "John",
            "ARTOO": "R2-D2",
            "HYPERSPACE": "Warp Drive",
            "JEDI arts": "Martial Arts"
        }
    },
    {
        "message_id": 115,
        "passage": "RIC OLIE pulls back on the hyperdrive. OBI-WAN, QUI-GON, and ANAKIN watch.\n\nQUI-GON : Let's hope this hyperdrive works and Watto didn't get the last\nlaugh.\n\nThe stars streak outside the cockpit window.",
        "dictionary": {
            "hyperdrive": "faster-than-light propulsion",
            "Watto": "the mechanic"
        }
    },
    {
        "message_id": 116,
        "passage": "The ship streaks into hyperspace.",
        "dictionary": {
            "hyperspace": "faster-than-light travel"
        }
    },
    {
        "message_id": 117,
        "passage": "SEVERAL FEDERATION DROIDS patrol a deserted city street. The Palace can be\nseen in the distance.",
        "dictionary": {}
    },
    {
        "message_id": 118,
        "passage": "NUTE sits in a strange, mechanical walking chair, which approaches SIO\nBIBBLE and SEVERAL OTHER NABOO OFFICIALS. RUNE follows a few paces behind.\nDROID GUARDS surround SIO BIBBLE and THE OTHERS as FOUR COUNCIL MEMBERS\nwatch.\n\nNUTE : When are you going to give up this pointless strike? Your Queen is\nlost, your people are starving, and you, Governor, are going to die, much\nsooner than your people, I'm afraid. Take him away!\nBIBBLE : This invasion will gain you nothing. We're a democracy. The people\nhave decided... They will not live under your tyranny.\n\nBIBBLE is taken away as OOM-9 approaches NUTE.\n\nOOM-9 : My troops are in position to begin searching the swamps for these\nrumored underwater villages... they will not stay hidden for long.",
        "dictionary": {
            "NABOO OFFICIALS": "Government Officials",
            "DROID GUARDS": "Robot Soldiers",
            "OOM-9": "Commander Nine",
            "SEVERAL OTHER": "Additional"
        }
    },
    {
        "message_id": 119,
        "passage": "The ship is asleep. The lights are dim as PADME walks into the main room.\nShe goes to a monitor and watches the BIBBLE plea recording. JAR JAR is\nstretched out on the floor, snoring. ARTOO is to one side, cooing as he\nrests.\nPADME appears tired. She senses someone watching her and turns around with\na start. She sees ANAKIN sitting in the corner, shivering and looking\nverydejected. She goes over to him. He looks up at her with tears in his\neyes. He is holding his arms to keep himself warm.\n\nPADME : Are you all right?\nANAKIN : It's very cold.\n\nPADME gives him her over-jacket.\n\nPADME : You're from a warm planet, Annie. Too warm for my taste. Space is\ncold.\nANAKIN : You seem sad.\nPADME : The Queen is...worried. Her people are suffering...dying. She must\nconvince the Senate to intervene, or...I'm not sure what will happen.\nANAKIN : I'm...I'm not sure what's going to happen to me. I dunno if I'll\never see you again.. (he pulls something from his pocket) I made this for\nyou. Sou you'd remember me. I carved it out of a japor snippet... It will\nbring you good fortune.\n\nANAKIN hands a wooden pendant to PADME. She inspects it, then puts it\naround her neck.\n\nPADME : It's beautiful, but I don't need this to remember you. Many things\nwill change when we reach the capital, Annie. My caring for you will always\nremain.\nANAKIN : I care for you too. Only I...miss...\n\nANAKIN is disturbed about something. Tears are in his eyes.\n\nPADME : ...You miss your mother.\n\nANAKIN looks at her, unable to speak. She hugs him.",
        "dictionary": {
            "BIBBLE": "Galactic plea recording",
            "JAR JAR": "Sleeping alien",
            "ARTOO": "Resting droid",
            "ANAKIN": "Young Jedi",
            "PADME": "Queen Amidala",
            "japor snippet": "Wooden carving material"
        }
    }
]