[
    {
        "message_id": 1390,
        "passage": "ARTOO continues to skid and slide toward open space. He swerves around boxes and wrecked fighters. One of the BATTLE DROIDS stumbles and is consumed by the electronic shield in a zap. ARTOO BEEPS a reply as he dodges the laser blasts of the BATTLE DROIDS. One bolt hits very near him, and he SCREAMS in terror. \n\n47",
        "dictionary": {
            "BATTLE DROIDS": "Robot Soldiers",
            "SCREAMS": "Shrieks"
        }
    },
    {
        "message_id": 1391,
        "passage": "PILOT: Magnetize! Magnetize! \n\n48",
        "dictionary": {
            "Magnetize": "Align"
        }
    },
    {
        "message_id": 1392,
        "passage": "ARTOO is about to be overtaken by a starfighter sliding behind him. He falls into a heap of broken battle droid parts and the fighter bounces over him. \n\n49",
        "dictionary": {
            "ARTOO": "R2-D2",
            "starfighter": "spaceship"
        }
    },
    {
        "message_id": 1393,
        "passage": "The TRADE FEDERATION CRUISER heads straight down toward the planet. \n\n50",
        "dictionary": {
            "TRADE FEDERATION CRUISER": "spacecraft"
        }
    },
    {
        "message_id": 1394,
        "passage": "ANAKIN jumps into the horizontal elevator shaft with OBI-WAN still on his shoulder. \n\nANAKIN: We can't wait. Come on, we have to be fast. \n\nPALPATINE climbs into the elevator shaft also. They start running. The ship begins to roll again, and the Jedi and the Chancellor are forced to jump from one side of the elevator to the other. \n\n51",
        "dictionary": {
            "OBI-WAN": "Jedi Master",
            "PALPATINE": "Supreme Leader"
        }
    },
    {
        "message_id": 1395,
        "passage": "GENERAL GRIEVOUS: Fire the emergency booster engines. \n\nPILOT: Leveling out, sir. \n\n52",
        "dictionary": {
            "emergency booster engines": "auxiliary propulsion systems"
        }
    },
    {
        "message_id": 1396,
        "passage": "ANAKIN still carrying OBI-WAN on his back, and PALPATINE run down the elevator shaft as it starts to move upright. ANAKIN cuts a control box on one of the doors, but before the doors can open, the ship moves to an angle, causing ANAKIN and PALPATINE to start sliding down the shaft. ANAKIN grabs some wires in the control box with one hand. PALPATINE grabs onto the Jedi's leg. As the ship rights itself, they are left hanging in the bottomless elevator shaft. \n\n53",
        "dictionary": {
            "Jedi": "Warrior Monk",
            "Obi-Wan": "Luke's Mentor",
            "Palpatine": "Sith Lord",
            "ANAKIN": "Darth Vader",
            "OBI-WAN": "Ben",
            "PALPATINE": "Emperor"
        }
    },
    {
        "message_id": 1397,
        "passage": "ANAKIN, OBI-WAN, and PALPATINE hang precariously on the side of the bottomless elevator shaft. OBI-WAN regains consciousness and tries to look around. \n\nANAKIN: Easy. . . . We're in a bit of a situation. \n\nOBI-WAN: Did I miss something? \n\nOBI-WAN looks down and sees PALPATINE and the bottomless pit. They hear ARTOO BEEPING on Obi-Wan's comlink. The ship begins to roll, causing the vertical shaft to move into a forty-five-degree angle. They hear the elevator brakes release and look up to see the elevator heading toward them. \n\nANAKINN: Hold on. \n\nOBI-WAN: What is that? \n\nOBI-WAN and ANAKIN look up to watch the elevator approach them at high speed, then OBI-WAN turns to ANAKIN. \n\nOBI-WAN: (continuing) Oops. \n\nANAKIN: Artoo, Artoo, shut down the elevator! \n\nOBI-WAN: Too late! Jump! \n\nThey fall about three hundred feet before the tilt of the ship catches up with them, and they hit the side of the shaft and slide at great speed just ahead of the elevator. The shaft continues to rotate until it is completely horizontal. \nANAKIN and OBI-WAN take out and throw grappling hooks. The hooks catch and they continue to fall. All the doors in the elevator shaft open up, and the group swings through the open door into a hallway. The elevator roars by. \n\n54",
        "dictionary": {
            "ARTOO": "the droid",
            "OBI-WAN": "the Jedi",
            "PALPATINE": "the Emperor",
            "ANAKIN": "the young Jedi"
        }
    },
    {
        "message_id": 1398,
        "passage": "ANAKIN, OBI-WAN, and PALPATINE fly through the elevator door and land. \n\nOBI-WAN: Let's see if we can find something in the hangar bay that's still flyable. Come on. \n\nANAKIN: Artoo, get down here. Artoo, do you copy? \n\n55",
        "dictionary": {
            "ANAKIN": "Alex",
            "OBI-WAN": "Captain",
            "PALPATINE": "President",
            "Artoo": "Assistant Robot"
        }
    },
    {
        "message_id": 1399,
        "passage": "As the Federation Cruiser continues to rotate, ARTOO SQUEALS and pokes a periscope out of a pile of broken BATTLE DROID PARTS. He looks around then rockets up out of the debris. \n\n56",
        "dictionary": {
            "ARTOO": "Droid",
            "BATTLE DROID PARTS": "Robot Components"
        }
    }
]