[
    {
        "message_id": 1010,
        "passage": "OBI-WAN walks in to find the room in complete disorder. The bedroom door is wide open - clear signs of hurried departure. All of the Fetts' personal belongings are gone.\n\nOBI-WAN goes to an ultra-thin computer screen. He punches up AN ONSCREEN PICTURE of JANGO FETT and BOBA FETT unhitching the lines securing their ship to the landing platform. JANGO FETT is wearing his armour and rocket pack. BOBA FETT climbs aboard the small Fighter.",
        "dictionary": {
            "JANGO FETT": "Space Pilot",
            "BOBA FETT": "Young Space Warrior",
            "ONSCREEN PICTURE": "Computer Display"
        }
    },
    {
        "message_id": 1011,
        "passage": "JANGO FETT picks up a case and swings it up to BOBA FETT, who stows it inside the ship. JANGO FETT picks up another case and is about to swing it, when:\n\n\t\t\t\tBOBA FETT\n\t\t\tDad!!\n\nJANGO FETT turns to see OBI-WAN charging out of the tower toward him. As he runs, OBI-WAN draws his lightsaber from his belt. It flashes on.\n\nJANGO FETT draws his gun and fires at the charging JEDI. OBI-WAN deflects the blast and swings at JANGO FETT.\n\nThe bounty hunter rockets up and over OBI-WAN, landing behind him. He fires a thin wire from his wrist pack, trying to entangle the Jedi.\n\nJANGO FETT fire several Kamino Kyber Darts from his elbow launcher. OBI-WAN deflects them back at JANGO FETT, but they strike harmlessly against the bounty hunter's armour.\n\nIN THE COCKPIT of Jango Fett's ship, BOBA FETT grabs the controls of a laser gun and swings it to aim at OBI-WAN.\n\nOUTSIDE, in the driving rain, OBI-WAN and JANGO FETT circle each other, sizing each other up - feinting.\n\nIN THE COCKPIT, each time BOBA FETT is ready to fire, JANGO FETT blocks his view of OBI-WAN.\n\nOUTSIDE, OBI-WAN makes a sudden attack, swinging at JANGO FETT, who deflects the blows. One slices off a piece of the bounty hunter's shoulder plate. JANGO FETT rockets into the air and hovers above OBI-WAN. The Jedi spins as:\n\nIN THE COCKPIT, BOBA FETT fires.\n\nOUTSIDE, the laser shell streaks past OBI-WAN to strike the edge of the tower. JANGO FETT fires down at OBI-WAN. The Jedi deflects the shots back, but JANGO FETT evades them. Then he swoops down, swinging around OBI-WAN. As he shoots past, he kicks the lightsaber out of the Jedi's hand.\n\nThe lightsaber skids across the wet surface of the landing platform. OBI-WAN dives after it. JANGO FETT zooms in front of him and grabs the lightsaber. OBI-WAN punches it out of his hand.\n\nIN THE COCKPIT, BOBA FETT watches as:\n\nOUTSIDE, OBI-WAN and JANGO FETT grapple and fight, punching, kicking, grabbing hold, and throwing each other around. OBI-WAN grabs JANGO FETT tightly, and JANGO FETT rockets up into the air and kicks OBI-WAN loose. OBI-WAN crashes to the deck and slides toward the edge. He grapples desperately for a handhold on the slick surface.\n\nJANGO FETT rockets down to kick at him. OBI-WAN hauls himself up. JANGO FETT zooms to the far side of the platform.\n\nOBI-WAN uses Jedi powers to pull part of the structure loose. It hits JANGO FETT, who loses his balance, teetering on the edge. OBI-WAN charges acress, dives, and grabs hold of JANGO FETT just as he falls over the edge.\n\nLocked together, OBI-WAN and JANGO FETT plummet down toward the raging ocean. At the last moment, JANGO FETT fires a cable out of his backpack that shoots upward and locks onto a metal strut on the underside of the platform. OBI-WAN and JANGO FETT swing and CRASH onto one of the stilts.\n\nOBI-WAN is knocked clear and drops onto a SMALL SERVICE PLATFORM just above the waves. He hauls himself to his feet. JANGO FETT hovers in mid-air opposite him, as a HUGE WAVE crashes over OBI-WAN. When it subsides, the Jedi has disappeared.\n\nJANGO FETT rockets up to the landing platform, where he drops down beside his ship. He clambers inside the cockpit and settles into the pilot's seat. He punches buttons. The engines ROAR.\n\nOUTSIDE, Jango Fett's ship lifts off from the platform and heads up into the lowering sky. It disappears. Lightning flashes. Rain lashes the tower and streams across the surface of the platform, to where:\n\nA HAND suddenlt clutches at the very edge of the platform. A moment later, ANOTHER HAND grabs hold.",
        "dictionary": {
            "Kamino Kyber Darts": "High-Speed Darts",
            "Jedi": "Guardian",
            "lightsaber": "energy sword",
            "BOBA FETT": "son",
            "Kamino": "Unknown Planet",
            "JANGO FETT": "father",
            "OBI-WAN": "Jedi Master"
        }
    },
    {
        "message_id": 1012,
        "passage": "The Naboo Starship descends, hovers, and land on a bluff. ANAKIN and PADME get out. They look down from the edge of the bluff to where the homestead is seen on the desert floor below.\n\n\t\t\t\tPADME\n\t\t\tStay with the ship, Artoo.\n\nARTOO WHISTLES as ANAKIN and PADME start down the trail toward the homestead.",
        "dictionary": {
            "Naboo": "alien planet",
            "Starship": "spaceship"
        }
    },
    {
        "message_id": 1013,
        "passage": "C-3PO is working outside the homestead. He still lacks an outer covering; his inner parts and wiring show. He looks up as ANAKIN and PADME arrive,\n\n\t\t\t\tC-3PO\n\t\t\tGood evening. May I help you?\n\n\t\t\t\tANAKIN\n\t\t\tThreepio?\n\n\t\t\t\tC-3PO\n\t\t\tOh, my... oh, my! Master\n\t\t\tAnakin! My goodness, I can hardly\n\t\t\tbelieve it! And this must be Miss\n\t\t\tPadme.\n\n\t\t\t\tPADME\n\t\t\tHello, Threepio.\n\n\t\t\t\tANAKIN\n\t\t\tI've come to see my mother.\n\n\t\t\t\tC-3PO\n\t\t\tOh, dear! I'm so terribly sorry,\n\t\t\tMaster Annie.\n\n\t\t\t\tPADME\n\t\t\tThreepio, what's happened?\n\n\t\t\t\tC-3PO\n\t\t\tI think we'd better go inside.",
        "dictionary": {
            "Threepio": "The robot",
            "Master Annie": "Young Lord"
        }
    },
    {
        "message_id": 1014,
        "passage": "ANAKIN, PADME and THREEPIO arrive in the courtyard. THREEPIO shuffles ahead.\n\n\t\t\t\tC-3PO\n\t\t\tMaster Lars - Master Owen!\n\t\t\tSomebody to see you!\n\nOWEN LARS and BERU WHITESUN come out into the courtyard.\n\n\t\t\t\tANAKIN\n\t\t\tI'm Anakin Skywalker. I'm here\n\t\t\tlooking for my mother.\n\n\t\t\t\tOWEN\n\t\t\tOwen Lars... I guess I'm your\n\t\t\tstep-brother.\n\t\t\t\t(they shake hands)\n\t\t\tThis is my girlfriend, Beru.\n\n\t\t\t\tBERU\n\t\t\tHello.\n\n\t\t\t\tPADME\n\t\t\tI'm Padme.\n\n\t\t\t\tOWEN\n\t\t\tI had a feeling you might show up\n\t\t\tsome day.\n\n\t\t\t\tANAKIN\n\t\t\tIs my mother here?\n\n\t\t\t\tCLIEGG\n\t\t\tNo, she's not.\n\nCLIEGG LARS swings from the house on a small floating chair. One of his legs is heavily bandaged; the other is missing. He balances awkwardly and puts out a hand.\n\n\t\t\t\tCLIEGG\n\t\t\t\t(continuing)\n\t\t\tCliegg Lars. Shmi is my wife...\n\t\t\tCome on inside. We have a lot to\n\t\t\ttalk about.",
        "dictionary": {
            "C-3PO": "Galactic Translator",
            "Master Lars": "Owen Lars",
            "Master Owen": "Owen Lars",
            "Padme": "Senator",
            "Beru": "Owen's Girlfriend",
            "Shmi": "Cliegg's Wife",
            "Cliegg": "Owen's Father"
        }
    },
    {
        "message_id": 1015,
        "passage": "BERU puts several steaming cups of ardees on a tray and exits the kitchen...\n\n\t\t\t\tCLIEGG (O.S.)\n\t\t\tIt was just before dawn. They\n\t\t\tcame out of nowhere. A hunting\n\t\t\tparty of Tusekn Raiders.",
        "dictionary": {
            "ardees": "coffee",
            "Tusekn Raiders": "bandits"
        }
    },
    {
        "message_id": 1016,
        "passage": "CLIEGG, OWEN, PADME and ANAKIN sit around the table, BERU brings the drinks from the kitchen.\n\n\t\t\t\tCLIEGG\n\t\t\tYour mother had gone out early,\n\t\t\tlike she always did, to pick\n\t\t\tmushrooms that grow on the\n\t\t\tvaporatos. From the tracks, she\n\t\t\twas about halfway when they\n\t\t\ttook her. Those Tuskens walk like\n\t\t\tmen, but they're vicious, mindless\n\t\t\tmonsters. Thirty of us went out\n\t\t\tafter her. Four of us came back.\n\t\t\tThree more are still out there\n\t\t\tlooking. I'd be with them,\n\t\t\tonly... I just couldn't ride any\n\t\t\tmore... until I heal.\n\nCLIEGG grimaces, easing his throbbing leg.\n\n\t\t\t\tCLIEGG\n\t\t\t\t(continuing)\n\t\t\tThis isn't the way I wanted to\n\t\t\tmeet you, son. This isn't how\n\t\t\tyour mother and I planned it. I\n\t\t\tdon't want to give up on her, but\n\t\t\tshe's been gone a month. There's\n\t\t\tlittle hope she's lasted this long.\n\nSilence. Then ANAKIN stands up.\n\n\t\t\t\tOWEN\n\t\t\tWhere are you going?\n\n\t\t\t\tANAKIN\n\t\t\tTo find my mother.\n\n\t\t\t\tPADME\n\t\t\tNo, Annie!\n\n\t\t\t\tCLIEGG\n\t\t\tShe's daed, son. Accept it.\n\n\t\t\t\tANAKIN\n\t\t\tI can feel her pain, and I will\n\t\t\tfind her. I know she's alive.\n\nANAKIN turns abruptly.",
        "dictionary": {
            "Tuskens": "Savage Raiders",
            "vaporatos": "fungi"
        }
    },
    {
        "message_id": 1017,
        "passage": "ANAKIN stands looking across the desert. PADME comes running out of the homestead after him, followed by OWEN. ANAKIN turns to PADME.\n\n\t\t\t\tANAKIN\n\t\t\tYou are going to have to stay\n\t\t\there. These are good people,\n\t\t\tPadme. You'll be safe.\n\n\t\t\t\tOWEN\n\t\t\tTake my speeder bike.\n\n\t\t\t\tPADME\n\t\t\tAnakin...\n\nPADME hugs him. ANAKIN walks over to Owen's speeder bike, which is standing close by.\n\n\t\t\t\tANAKIN\n\t\t\tI trust you'll watch over her,\n\t\t\tOwen.\n\n\t\t\t\tOWEN\n\t\t\tDon't worry.\n\nANAKIN swings onto the bike. The engine fires.\n\n\t\t\t\tANAKIN\n\t\t\tI won't be long.\n\nANAKIN takes off across the desert. PADME watches him go.",
        "dictionary": {
            "Anakin": "Alex",
            "Padme": "Sarah"
        }
    },
    {
        "message_id": 1018,
        "passage": "The red planet of Geonosis is circled by a large asteroid field that form rings. Jango Fett's ship appears, heading toward it.",
        "dictionary": {
            "Geonosis": "Dwarf Planet X",
            "Jango Fett": "Mercenary Pilot"
        }
    },
    {
        "message_id": 1019,
        "passage": "JANGO FETT grins at BOBA FETT.\n\n\t\t\t\tJANGO FETT\n\t\t\tNearly there, son.\n\nJANGO FETT guides he ship around the asteroids. Suddenly:\n\n\t\t\t\tBOBA FETT\n\t\t\tDad, look!!\n\nOn the view screen, Obi-Wan's ship appears, chasing after them. JANGO FETT grabs the controls. They are thrown around as the ship plummets to try to lose OBI-WAN.\n\n\t\t\t\tJANGO FETT\n\t\t\tHang on!\n\nThe ship goes into a power-climb. A GREAT SPACE DDOGFIGHT ensues between OBI-WAN and JANGO FETT.",
        "dictionary": {
            "GREAT SPACE DDOGFIGHT": "Intense Space Battle",
            "JANGO FETT": "Captain Fett",
            "BOBA FETT": "Young Fett",
            "OBI-WAN": "Pilot One"
        }
    }
]