[
    {
        "message_id": 1520,
        "passage": "The Chancellor is in the podium in the center of the vast arena giving a speech. MAS AMEDDA stands to the right of SIDIOUS. BAIL ORGANA walks through the hallway of the Main Senate Chamber. He enters the Senate Pod of Naboo and sits next to PADME. JAR JAR, CAPTAIN TYPHO and TWO HANDMAIDENS are in the pod also. \n\nPALPATINE: . . . and the Jedi Rebellion has been foiled. \n\nBAIL ORGANA: I was held up. What's happening? \n\nPADME: The Chancellor has been elaborating on a plot by the Jedi, to overthrow the Senate. \n\nBAIL ORGANA: That's not true! \n\nPADME: He's been presenting evidence all afternoon. \n\nBAIL ORGANA: And the Senate will go along with it, just like they always do. \n\nPALPATINE: The remaining Jedi will be hunted down and defeated. (applause) Any collaborators will suffer the same fate. \n\n(applause) \n\nThese have been trying times, but we have passed the test. \n\n177",
        "dictionary": {
            "MAS AMEDDA": "High-Ranking Official",
            "SIDIOUS": "Powerful Politician",
            "JAR JAR": "Loyal Servant",
            "CAPTAIN TYPHO": "Military Leader",
            "TWO HANDMAIDENS": "Attendants",
            "PALPATINE": "Authoritative Figure",
            "BAIL ORGANA": "Diplomat",
            "PADME": "Senator"
        }
    },
    {
        "message_id": 1521,
        "passage": "YODA and OBI-WAN make their way through the Temple, avoiding the HUNDREDS OF CLONE TROOPERS. They use the Force to distract the CLONES when they can. \nYODA and OBI-WAN walk through the ruins of the Temple until they come across the bodies of some students. \n\nOBI-WAN: Not even the younglings survived. \n\nYODA: Killed not by clones, this Padawan. By a lightsaber, he was. \n\nOBI-WAN: . . .Who?? Who could have done this? \n\n178",
        "dictionary": {
            "HUNDREDS OF CLONE TROOPERS": "Hordes of Soldiers",
            "CLONES": "Soldiers",
            "Padawan": "Young Disciple",
            "lightsaber": "energy sword"
        }
    },
    {
        "message_id": 1522,
        "passage": "ANAKIN ignites his lightsaber, NUTE and the OTHERS panic. The DROIDS at the controls and the GUARDS grab their weapons, but it is too late. They are cut down in a flash. The Separatists bang on the doors, and NUTE and RUNE HAAKO flee under a table. \n\nANAKIN, stone-faced, moves through the room like the grim reaper. Bodies drop everywhere. SCREAMS are cut short as the head of the Banking Clan dies. \n\nThen POGGLE THE LESSER loses his head; WAT TAMBOR, SHU MAI, and the REST OF THE SEPARATISTS run into the conference room. \n\n179",
        "dictionary": {
            "lightsaber": "energy sword",
            "Separatists": "rebel forces",
            "DROIDS": "robots",
            "GUARDS": "security personnel",
            "grim reaper": "executioner",
            "SCREAMS": "cries of terror",
            "Banking Clan": "financial institution",
            "POGGLE THE LESSER": "unimportant official",
            "WAT TAMBOR": "high-ranking officer",
            "SHU MAI": "high-ranking officer",
            "REST OF THE SEPARATISTS": "remaining rebels"
        }
    },
    {
        "message_id": 1523,
        "passage": "PALPATINE: The attempt on my life has left me scarred and deformed, but I assure you my resolve has never been stronger. \n\nApplause. \n\n180",
        "dictionary": {
            "PALPATINE": "The Emperor"
        }
    },
    {
        "message_id": 1524,
        "passage": "In the hallway, ANAKIN cuts down DROIDS and SEPARATISTS alike. He is unstoppable. ANAKIN turns his head-his eyes are yellow. \n\n181",
        "dictionary": {
            "ANAKIN": "The Hero",
            "DROIDS": "Robots"
        }
    },
    {
        "message_id": 1525,
        "passage": "PALPATINE continues his speech at the podium. \n\nPALPATINE: The war is over. (applause) The Separatists have been defeated, (applause) and the Jedi rebellion has been foiled. We stand on the threshold of a new beginning. \n\nThere is a long period of APPLAUSE. \n\nPADME: Well, this is the moment we discover if he intends to return the Republic to a democracy. \n\nPALPATINE: In order to ensure our security and continuing stability, the Republic will be reorganized into the first Galactic Empire, for a safe and secure society which I assure you will last for ten thousand years. \n\nThere is a loud, sustained CHEER from the Senate. BAIL ORGANA and PADME sit, dumbfounded. \n\nPALPATINE: (continuing) An empire that will continue to be ruled by this august body, and a sovereign ruler chosen for life . . . \n\nThe Senate CHEERS again. BAIL and PADME are devastated. PADME begins to cry. \n\nPALPATINE: (continuing) An empire ruled by the majority . . . Ruled by a new constitution . . . \n\nThe Senate APPLAUDS. \n\nPADME: So this is how liberty dies, with thunderous applause . . . \n\nBAIL ORGANA: We cannot let this happen. \n\nHe starts to stand up. PADME stops him. \n\nPADME: Not now! There will be a time. \n\n182",
        "dictionary": {
            "Separatists": "Rebels",
            "Jedi": "Knights",
            "Galactic Empire": "Unified Government",
            "APPLAUSE": "Cheering",
            "CHEER": "Celebration",
            "Republic": "Government"
        }
    },
    {
        "message_id": 1526,
        "passage": "After everyone in the Main Control Room is dead, ANAKIN moves to the small conference room where WAT TAMBOR. SHU MAI, and some OTHER SEPARATISTS are hiding. RUNE HAAKO tries to run but is trapped by a dead-end as ANAKIN advances. \n\nRUNE HAAKO: Stop! Enough, this is not right! \n\nRUNE is cut down. NUTE GUNRAY crawls out from under the table and opens the Main Door, allowing DESTROYER DROIDS to enter. WAT TAMBOR is cut down, along with SHU MAI. DESTROYER DROIDS appear in the doorway and blast away, causing total destruction. When the firing is over, ANAKIN is gone. Blown away? No. ANAKIN drops from the ceiling behind the TWO DROIDS and cuts them to pieces before they know what hit them. \n\n183",
        "dictionary": {
            "ANAKIN": "The Commander",
            "SEPARATISTS": "Rebel Forces",
            "RUNE HAAKO": "John",
            "WAT TAMBOR": "General",
            "SHU MAI": "Lieutenant",
            "DESTROYER DROIDS": "Assault Drones"
        }
    },
    {
        "message_id": 1527,
        "passage": "NUTE GUNRAY is the last Separatist leader alive. ANAKIN moves on to find NUTE GUNRAY hiding in an alcove. \n\nNUTE GUNRAY: The war is over. Lord Sidious promised us peace ... we only want . . . \n\nNUTE GUNRAY is cut down in midsentence. \n\n184",
        "dictionary": {
            "Separatist": "Rebel",
            "Lord Sidious": "Supreme Commander",
            "ANAKIN": "Luke"
        }
    },
    {
        "message_id": 1528,
        "passage": "OBI-WAN stands in a large computer area as YODA looks on, in the hatchway to the Main Control Center. \n\nOBI-WAN: I've recalibrated the code warning all surviving Jedi to stay away. \n\nYODA: Good . . . For the Clones to discover the recalibration, a long time it will take. To change it back, longer still. Hurry. \n\n185",
        "dictionary": {
            "Jedi": "Knights",
            "Clones": "Soldiers"
        }
    },
    {
        "message_id": 1529,
        "passage": "OBI-WAN enters the Main Control Center with YODA and heads for the hologram area. \n\nOBI-WAN: Wait, Master. There is something I must know . . . \n\nYODA: If into the security recordings you go, only pain will you find. \n\nOBI-WAN: I must know the truth, Master. \n\nOBI-WAN moves to a panel and flips some switches. He sees a HOLOGRAM of ANAKIN slaughtering JEDI, including the YOUNG ONES. OBI-WAN and YODA react. \n\nOBI-WAN: (continuing) It can't be . . . It can't be . . . \n\nAs ANAKIN surveys the carnage, a DARK-ROBED SITH LORD enters. ANAKIN turns to DARTH SIDIOUS and kneels before him. \n\nANAKIN: The traitors have been taken care of, Lord Sidious. \n\nDARTH SlDIOUS: Good . . . good . . . You have done well, my new apprentice. Do you feel your power growing? \n\nANAKIN: Yes, My Master. \n\nDARTH SlDIOUS: Now, Lord Vader, now go and bring peace to the Empire. \n\nOBI-WAN watches in horror. Tears well up in his eyes. \n\nOBI-WAN: I can't watch any more. \n\nOBI-WAN switches off the hologram. The TWO JEDI stand in silence for a few moments. \n\nYODA: Destroy the Sith, we must. \n\nOBI-WAN: Send me to kill the Emperor. I will not kill Anakin. \n\nYODA: To fight this Lord Sidious, strong enough, you are not. \n\nOBI-WAN: He is like my brother ... I cannot do it. \n\nYODA: Twisted by the dark side, young Skywalker has become. The boy you trained, gone he is . . . Consumed by Darth Vader. \n\nOBI-WAN: How could it have come to this? \n\nYODA: To question, no time there is. \n\nOBI-WAN: I do not know where the Emperor has sent him. I don't know where to look. \n\nYODA: Use your feelings, Obi-Wan, and find him, you will. Visit the new Emperor, my task is. May the Force be with you. \n\nOBI-WAN: May the Force be with you, Master Yoda. \n\n186",
        "dictionary": {
            "HOLOGRAM": "Virtual Projection",
            "DARK-ROBED SITH LORD": "Powerful Dark Side Warrior",
            "DARTH SIDIOUS": "Supreme Dark Lord",
            "DARTH VADER": "Dark Lord of the Sith",
            "MAY THE FORCE BE WITH YOU": "May Fortune Smile Upon You",
            "YOUNG ONES": "Innocent Children"
        }
    }
]