[
    {
        "message_id": 140,
        "passage": "The Naboo Cruiser heads toward the lush green planet. There is only one\nFederation battle cruiser orbiting. OBI-WAN and CAPTAIN PANAKA spot it on\nthe view screen.\n\nPANAKA : The blockade's gone.\nOBI-WAN : The war's over...No need for it now.\nRIC OLIE : I have one battleship on my scope.\nOBI-WAN : A droid control ship.\nPANAKA : They've probably spotted us.\nOBI-WAN ; We haven't much time.",
        "dictionary": {
            "Naboo Cruiser": "Space Vessel",
            "Federation battle cruiser": "Alien Warship",
            "OBI-WAN": "Wise Mentor",
            "CAPTAIN PANAKA": "Galactic Commander",
            "RIC OLIE": "Astronaut"
        }
    },
    {
        "message_id": 141,
        "passage": "The QUEEN, CAPTAIN PANAKA, TROOPS, and HANDMAIDENS get ready to disembark\nas the ship alnds. The elevator door slides open, and ANAKIN emerges into\nthe hold area. He see PADME and run up to her.\n\nANAKIN : Hi! Where have you been?\nPADME : Annie! What are you doing here?\nANAKIN : I'm with Qui-Gon...but...they're not going to let me be a Jedi.\nI'm too old.\nPADME : This is going to be dangerous, Annie.\nANAKIN : Is it? I can help... Where are we going?\nPADME : To war, I'm afraid. The Queen has had to make the most difficuld\ndecision of her life. She doesn't believe in fighting, Annie. We are a\npeaceful people...\nANAKIN : I want to help...I'm glad you're back.\n\nANAKIN smiles. PADME smiles back.",
        "dictionary": {
            "QUEEN": "Ruler",
            "CAPTAIN PANAKA": "Senior Officer",
            "HANDMAIDENS": "Attendants",
            "Qui-Gon": "Mentor",
            "Jedi": "Warrior Monk"
        }
    },
    {
        "message_id": 142,
        "passage": "The Naboo spacecraft has landed in the Gungan swamp. TROOPS unload the\nships in the background as OBI-WAN approaches QUI-GON.\n\nOBI-WAN : Jar Jar is on his way to the Gungan city, Master.\n\nQUI-GON's thoughts are elsewhere.\n\nQUI-GON : Good.\n\nOBI-WAN and QUI-GON stand silently for a moment.\n\nOBI-WAN : Do you think the Queen's idea will work?\nQUI-GON : The Gungans will not easily be swayed, and we cannot use our\npower to help her.\nOBI-WAN : I'm...I'm sorry for my behavior, Master. It is not my place to\ndisagree with you about the boy. I am grateful you think I am ready for the\ntrials.\n\nQUI-GON looks at him for a long moment.\n\nQUI-GON : You have been a good apprentice. You are much wiser than Iam,\nObi-Wan. I foresee you will become a great Jedi Knight.",
        "dictionary": {
            "Naboo": "Planet Xylophia-IV",
            "Gungan": "Inhabitants of the Swamp",
            "TROOPS": "Soldiers",
            "QUI-GON": "Master Kenji",
            "Jar Jar": "Local Guide",
            "Gungan city": "Swamp Metropolis",
            "Queen's idea": "Plan of Action",
            "Gungans": "Swamp Dwellers"
        }
    },
    {
        "message_id": 143,
        "passage": "JAR JAR swims down into Bubble City.",
        "dictionary": {
            "JAR JAR": "Unlikely Hero"
        }
    },
    {
        "message_id": 144,
        "passage": "JAR JAR enters the main square of the bubble city. He stands, stunned, in\namazement and fear. He is nervous and shaking.\n\nJAR JAR : Ello! Where das everybody?\n\nThe plaza is empty. He notices that many of the buildings are shot up as if\nthere had been a battle of some kind.",
        "dictionary": {
            "JAR JAR": "the clumsy visitor",
            "Ello": "Hello"
        }
    },
    {
        "message_id": 145,
        "passage": "JAR JAR exits the swamp lake and walks over to QUEEN AMIDALA, CAPTAIN\nPANAKA, OBI-WAN, and QUI-GON. PADME, EIRTAE, RABE, ANAKIN, and ARTOO,\nFOUR\nPILOTS, and EIGHT GUARDS stand in the background near the starship.\n\nJAR JAR : Dare-sa nobody dare. All gone. Some kinda fight, I tink. Sorry,\nno Gungas...no Gungas.\nCAPT. PANAKA : Do you think they have been taken to camps?\nOBI-WAN : More likely they were wiped out.\nJAR JAR : No...mesa no tink so. Gungan hiden. When in trouble, go to sacred\nplace. Mackineeks no find them dare.\nQUI-GON : Do you know where they are?",
        "dictionary": {
            "Gungas": "Soldiers",
            "Mackineeks": "Enemies",
            "Dare-sa": "Don't dare",
            "Gungan": "Native"
        }
    },
    {
        "message_id": 146,
        "passage": "The GROUP follows JAR JAR as he moves through the swamp. JAR JAR stops and\nsniffs the air. The GROUP stop behind him.\n\nJAR JAR : Dissen it.\n\nJAR JAR makes a strange chattering noise. Suddenly, out of nowhere, CAPTAIN\nTARPALS and SIX OTHER GUNGAN TROOPS riding on KAADUS emerge from the brush.\n\nJAR JAR : (Cont'd) Heyo-dalee, Captain Tarpals.\nCAPT. TARPALS : Binks!! Noah gain!\nJAR JAR : We comen to see da boss.\n\nCAPTIAN TARPALS rolls his eyes.\n\nCAPT. TARPALS : Ouch time, Binks... Ouch time for all-n youse.",
        "dictionary": {
            "GROUP": "company",
            "JAR JAR": "John",
            "Gungan": "tribal warriors",
            "KAADUS": "mountain goat",
            "CAPTAIN TARPALS": "Captain James",
            "SIX OTHER GUNGAN TROOPS": "six guards"
        }
    },
    {
        "message_id": 147,
        "passage": "JAR JAR, QUEEN AMIDALA, ANAKIN, ARTOO, QUI-GON, OBI-WAN, PADME, RABE,\nEIRTAE, and the rest of her group are led through a clearing full of GUNGAN\nrefugees. At the far end are the ruins of a grand temple with massive\ncarved heads. BOSS NASS and several other COUNCIL MEMBERS walk out on the\ntop of a three-quarter-submerged head.\n\nBOSS NASS : Jar Jar, yousa payen dis time. Who's da uss-en others??\n\nQUEEN AMIDALA steps forward. CAPTAIN PANAKA and the JEDI stand behind her.\n\nAMIDALA : I am Queen Amidala of the Naboo...I come before you in peace.\nBOSS NASS : Naboo biggen. Yousa bringen da Mackineeks... Dya busten uss-en\nomm. Yousa all bombad. Yousa all die'n, mesa tink.\n\nCAPTAIN PANAKA and HALF A DOZEN GUARDS and PILOTS look around nervously,\nand the GUNGAN TROOPS lower their long power poles. The JEDI stay relaxed.\nANAKIN watches everything with great interest.\n\nAMIDALA : We wish to form an alliance...\n\nSuddenly, PADME steps forward.\n\nPADME : Your Honor...\n\nARTOO whistles a quiet \"uh oh.\"\n\nBOSS NASS : Whosa dis?\nPADME : I am Queen Amidala (points to Queen) This is my decoy...my\nprotection...my loyal bodyguard.\n\nANAKIN is stunned. OBI-WAN and QUI-GON give each other a knowing look.\n\nPADME : (Cont'd) ...I am sorry for my deception, but under the\ncircumstances it has become necessary to protect myself. Although we do not\nalways agree, Your Honor, our two great societies have always lived in\npeace...until now. The Trade Federation has destroyed all that we have\nworked so hard to build. You are in hiding, my people are in camps. If we\ndo not act quickly, all will be lost forever...I ask you to help us...no, I\nbeg you to help us.\n\nPADME drops to her knees and prostrates herself before BOSS NASS. There is\na gasp from CAPTAIN PANAKA, HIS TROOPS, and the HANDMAIDENS.\n\nPADME : (Cont'd) We are your humble servants...our fate is in your hands.\n\nSlowly, CAPTAIN PANAKA and his TROOPS bow down before the GUNGAN COUNCIL.\nThen the HANDMAIDENS, ANAKIN, and finally the JEDI. The GUNGANS are puzzled\nby this. BOSS NASS begins to laugh.\n\nBOSS NASS : Yousa no tinken yousa greater den da Gungans.. Mesa like dis.\nMaybe wesa bein friends.",
        "dictionary": {
            "GUNGAN": "River Dwellers",
            "BOSS NASS": "Leader Nass",
            "COUNCIL MEMBERS": "Community Leaders",
            "JAR JAR": "Finnley",
            "QUEEN AMIDALA": "Naboo Ruler",
            "CAPTAIN PANAKA": "Commander Panaka",
            "JEDI": "Peacekeepers",
            "GUNGAN TROOPS": "Water Warriors",
            "HANDMAIDENS": "Personal Servants"
        }
    },
    {
        "message_id": 148,
        "passage": "NUTE, RUNE, and DARTH MAUL walk with a hologram of DARTH SIDIOUS.\n\nNUTE : ...we've sent out patrols. We've already located their starship in\nthe swamp....It won't be long, My Lord.\nDARTH SIDIOUS : This is an unexpected move for her. It's too aggresive..\nLord Maul, be mindful.\nDARTH MAUL : Yes, my Master.\nDARTH SIDIOUS : Be patient... Let them make the first move.",
        "dictionary": {
            "DARTH SIDIOUS": "The Emperor",
            "DARTH MAUL": "The Dark Warrior",
            "Lord Maul": "The Sith Apprentice",
            "My Lord": "Your Excellency"
        }
    },
    {
        "message_id": 149,
        "passage": "A GUNGAN SENTRY sits on top of the ancient temple heah, searching the\nlandscape with a pair of electrobinoculars. He sees something and yells\ndown to ANAKIN at the foot of the statue.\n\nGUNGAN LOOKOUT : Daza comen!\nANAKIN : All right. They're here!\n\nANAKIN yells and runs over to PADME and the JEDI, who are discussing a\nbattle plan with FIVE GUNGAN GENERALS. SABE and EIRTAE stand nearby. BOSS\nNASS puts his arm around JAR JAR.\n\nBOSS NASS : Yousa doen grand. Jar Jar bringen da Naboo together.\nJAR JAR : Oh, no, no, no...\nBOSS NASS : So, wesa maken yousa Bombad General.\nJAR JAR : General??! Oh, no..\n\nJAR JAR's eyes roll back, his tongue flops out and he faints.\nFOUR SPEEDERS pull up to the GROUP. CAPTAIN PANAKA and a DOZEN OR SO\nGUARDS\nand PILOT pile out and join the group.\n\nPADME : What is the situation?\nCAPT. PANAKA : Almost everyone's in camps. A few hundred police and guards\nhave formed an underground movement. I brought as many of the keaders as I\ncould. The Federation Army's also much larger than we thought, and much\nstronger. Your Highness, this is a battle I do not think we can win.\nPADME : The battle is a diversion. The Gungans must draw theDroid Army away\nfrom the cities. We can enter the city using the secret passages on the\nwaterfall side. Once we get to the main entrance, Captain Pnaka will create\na diversion, so that we can enter the palace and capture the Viceroy.\nWithout the Viceroy, they will be lost and confused.\n\nQUI-GON and OBI-WAN look on with interest.\n\nPADME : (Cont'd) What do you think, Master Jedi?\nQUI-GON : The Viceroy will be well guarded.\nCAPT. PANAKA : The difficulty's getting into the throne room. Once we're\ninside, we shouldn't have a problem.\nQUI-GON : There is a possibility with this diversion many Gungans will be\nkilled.\nBOSS NASS : Wesa ready to do are-sa part.\n\nJAR JAR smiles a very worried and sheepish grin. ANAKIN watches with\ninterest, as does ARTOO.\n\nPADME : We have a plan which should immobilize the Droid Army. We will send\nwhat pilots we have to knock out the Droid control ship which is orbiting\nthe planet. If we can get past their rayshields, we can sever communication\nand their droids will be helpless.\nQUI-GON : A well-conceived plan. However, there's great risk. The weapons\non your fighters may not penetrate the shields on the control ship.\nOBI-WAN : And there's an even bigger danger. If the Vicroy escapes, Your\nHighness, he will return with another droid army.\nPADME : That is why we must not fail to get to the Viceroy. Everything\ndepends on it.",
        "dictionary": {
            "Gungans": "Native Inhabitants",
            "Daza comen": "They're here",
            "Bombad General": "High-Ranking Officer",
            "Naboo": "Planet",
            "Droid Army": "Robot Troops",
            "Viceroy": "Governor",
            "Jedi": "Peacekeepers"
        }
    }
]