[
    {
        "message_id": 150,
        "passage": "NUTE, RUNE, DARTH MAUL, OOM-9, and a hologram of DARTH SIDIOUS walk through\nthe throne room.\n\nDARTH SIDIOUS : ...she is more foolish than I thought.\nNUTE : We are sending all available troops to meet this army of hers\nassembling near the swamp. It appears to be made up of primitives. We do\nnot expect much resistance.\nOOM-9 : I am increasing security at all Naboo detention camps.\nDARTH MAUL : I feel there is more to this, My Master. The two Jedi may be\nusing the Queen for their own purposes.\nDARTH SIDIOUS : The Jedi cannot become involved. They can only protect the\nQueen. Even Qui-Gon Jinn will not break that conenant.... This will work to\nour advantage...\nNUTE : I have your approval to proceed then, My Lord.\nDARTH SIDIOUS : Proceed. Wipe them put...all of them.",
        "dictionary": {
            "DARTH SIDIOUS": "The Emperor",
            "OOM-9": "Security Commander",
            "DARTH MAUL": "The Dark Lord's Apprentice",
            "NUTE": "The Commander",
            "Qui-Gon Jinn": "The Jedi Master"
        }
    },
    {
        "message_id": 151,
        "passage": "- DAY (FX)\n\nAll is peaceful. SMALL CRITTERS drink out of a large swamp lake. Suddenly\nthere is a disturbance in the middle of the lake. A rush of bubbles, then a\nGUNGAN SOLDIER riding a KAADU emerges from the water, followed by SEVERAL\nOTHERS. FROGS and OTHER LITTLE ANIMALS flee in all directions as the GUNGAN\nARMY marches through the swamp. The KAADU shake themselves off as they exit\nthe lake. When JAR JAR's KAADU shakes off, JAR JAR falls off.\nSOLDIERS on huge, lizard-like FAMBAAS with large shield generators mounted\non their backs follow the marching WARRIORS. The GUNGAN ARMY heads out of\nthe swamp and onto the rolling grassy hills.\nHUNDREDS OF GUNGAN WARRIORS march in lon lines toward the horizon.\nFederation tanks move up to a ridge and stop. In the distance they see the\nGUNGAN ARMY marching toward them. The GUNGAN GENERAL CEEL sees the tanks on\nthe ridge and orders a halt. The GUNGANS are spread out in a large line.\nJAR JAR is nervous. GENERAL CEEL signals to the shield operators.\n\nGENERAL CEEL : Energize the shields.\n\nA red ray shoots out of the generator and blasts into a large dish on the\nback of a second FAAMBA and spreads like an umbrella over the assembled\nWARRIORS.",
        "dictionary": {
            "GUNGAN SOLDIER": "Waterborne Warrior",
            "KAADU": "Swamp Lizard",
            "SEVERAL OTHERS": "Additional Troops",
            "FROGS": "Swamp Creatures",
            "GUNGAN ARMY": "Swamp Legion",
            "FAMBAAS": "Lizard-like Beasts",
            "GUNGAN GENERAL CEEL": "Swamp Commander",
            "FAAMBA": "Lizard-like Beast"
        }
    },
    {
        "message_id": 152,
        "passage": "PADME, followed by EIRTAE, OBI-WAN, QUI-GON, ANAKIN, and ARTOO, stealthily\nmakes her way toward the entrance to the main hanger. They are followed by\nabout TWENTY NABOO GUARDS, PILOTS, and TROOPS. They stop, and PADME uses a\nsmall red laser light to signal across the plaza to CAPTAIN PANAKA, RABE\nand TWENTY OTHER ASSORTED NABOO TROOPS. They signal back. QUI-GON leans\nover to ANAKIN.\n\nQUI-GON : Once we get inside, Annie, you find a safe placeto hide and stay\nthere.\nANAKIN : Sure.\nQUI-GON : And stay there!\n\nDROID TROOPS mill about the tank-filled plaza. At the far end of the plaza,\nSEVERAL DROIDS begin to run and fire. NABOO SOLDIERS begin to fire back at\nthe BATTLE DROIDS.\nAs the ruckus erupts at one end of the plaza, PADME and her TROOPS rush\ninto the main hanger. CAPTAIN PANAKA and HIS SOLDIERS continue to engage\nthe DROIDS outside.",
        "dictionary": {
            "NABOO": "Galactic Republic's ally",
            "ARTOO": "Astro-Mech Droid",
            "PILOTS": "Spacecraft operators",
            "TROOPS": "Ground forces",
            "BATTLE DROIDS": "Robot warriors",
            "DROID TROOPS": "Robot soldiers"
        }
    },
    {
        "message_id": 153,
        "passage": "ALARMS ARE SOUNDING a PADME, the JEDI, ANAKIN, EIRTAE, and PADME's TROOPS\nrush into the hanger. BATTLE DROIDS begin firing at them as they run for\ncover. ANAKIN runs under a Naboo fighter. The JEDI deflect bolts aimed at\nPADME back onto the BATTLE DROIDS, causing them to EXPLODE.",
        "dictionary": {
            "JEDI": "warriors",
            "BATTLE DROIDS": "robotic soldiers",
            "EXPLODE": "blow up"
        }
    },
    {
        "message_id": 154,
        "passage": "NUTE, RUNE, and FOUR COUNCIL MEMBERS watch the plaza battle on a large view\nscreen.\n\nNUTE : I thought the battle was going to take place far from here...this is\ntoo close!\nRUNE : What is going on?\n\nDARTH MAUL enters the throne room.\n\nDARTH MAUL : I told you there was more to this...the Jedi are involved.",
        "dictionary": {
            "Jedi": "Warriors of Light",
            "Darth": "Dark Lord"
        }
    },
    {
        "message_id": 155,
        "passage": "The Federation tanks begin to fire on the GUNGANS, but they are protected\nby their energy shield. The tanks stop firing, and the GUNGANS CHEER, until\nthey see the doors to the massive transports open, and racks of BATTLE\nDROIDS are pulled out and lined up by a squad of STAPS.\nThe BATTLE DROIDS reconfigure into their standing position. The GUNGANS get\nready for an attack. OOM-9 gives the command to move forward, and THOUSANDS\nOF DROIDS march toward the GUNGANS.\nThe GUNGANS power up their weapons. The DROIDS slowly march through the\nprotective shield and start firing. The GUNGANS throw their power poles and\nfling small balls of energy with slingshots. The WARRIORS dump large balls\nof energy into mortars that heat up and fire the energy goo onto the BATTLE\nDROIDS, causing them to short out.\nThe battle rages and the GUNGANS defend their shield generators against the\nARMY OF DROIDS. OOM-9 watches from a tank on a hill overlooking the battle.",
        "dictionary": {
            "GUNGANS": "Alien Tribesmen",
            "CHEER": "Cheer loudly",
            "BATTLE DROIDS": "Robot Soldiers",
            "STAPS": "Soldier Squad",
            "THOUSANDS OF DROIDS": "Hordes of Robots",
            "OOM-9": "Commander",
            "WARRIORS": "Guerrilla Fighters",
            "ARMY OF DROIDS": "Robot Legion"
        }
    },
    {
        "message_id": 156,
        "passage": "ANAKIN hides behind one of the Naboo fighters, ducking as large bolts whiz\npast and EXPLODE near him. PADME and the TWO JEDI destroy BATTLE DROIDS\nright and left. The QUEEN'S TROOPS and EIRTAE also blast away at the\nDROIDS. PADME signals to her pilots.\n\nPADME : Get to your ships!\n\nThe PILOTS and ARTOO UNITS run for the Naboo fighter craft stacked in the\nhanger bay. ONE OF THE PILOTS jumps into a fighter right above where ANAKIN\nis hiding.\n\nFIGHTER PILOT : Better find a new hiding place, kid. I'm taking this ship.\n\nThe ship begins to levitate out of the hanger. BATTLE DROIDS fire at it as\nit falls in behind five other fighters. ARTOO whistles to ANAKIN from a\nsecond fighter not far away. ANAKIN runs and jumps into the second fighter\nto hide.",
        "dictionary": {
            "Naboo": "alien planet",
            "JEDI": "warriors",
            "BATTLE DROIDS": "enemy robots",
            "QUEEN'S TROOPS": "royal guards",
            "EIRTAE": "allies",
            "ARTOO UNITS": "droid squad",
            "Naboo fighter craft": "spaceships"
        }
    },
    {
        "message_id": 157,
        "passage": "Two Naboo starfighters exit the main hanger. A tank fires at them, hitting\none of them, which causes it to pinwheel into the ground and EXPLODE.",
        "dictionary": {
            "Naboo": "Planet Xylophia-IV",
            "EXPLODE": "Detonate"
        }
    },
    {
        "message_id": 158,
        "passage": "CAPTAIN PANAKA, SABE and NABOO TROOPS rush into the hanger and overwlm the\nfew remaining BATTLE DROIDS. PADME, OBI-WAN, and QUI-GON join forces with\nCAPTAIN PANAKA.\n\nPADME : My guess is the Viceroy is in the throne room.\n\nShe looks to QUI-GON.\n\nQUI-GON : I agree.\n\nThey start to head for the exit, on the way passing the fighter where\nANAKIN is hiding. ARTOO whistles a greeting as ANAKIN peeps out of the\ncockpit.\n\nANAKIN : Hey! Wait for me.\nQUI-GON : No, Annie, you stay there. Stay right where you are.\nANAKNI : But, I...\nQUI-GON : Stay in that cockpit.\n\nThey head for the exit. As they are about to go through the door, suddenly\neveryone scatters, revealing DARTH MAUL standing in the doorway. CAPTAIN\nPANAKA, PADME, and HER TROOPS back away. QUI-GON and OBI-WAN step forward.\n\nQUI-GON : (Cont'd) We'' handle this...\n\nThe TWO JEDI take off their capes and ignite their laser swords. DARTH MAUL\ntakes off his cape, and ignites his laser sword. Both ends of the sword\nlight up.\nAt the far end of the hanger, SIX WHEEL DROIDS roll in and transform into\ntheir battle position. ARTOO calls ANAKIN's attention to the DROIDS. The\nJEDI begin to fight the Sith Lord.\n\nANAKIN : Oh, no...\n\nThe DROIDS begin to advance and start firing on PADME and HER TROOPS.\n\nANAKIN : (Cont'd) We gotta do something, Artoo.\n\nARTOO whistles a reply. Suddenly, the ship's systems go on, and the ship\nbegins to levitate.\n\nANAKIN : (Cont'd) All right, thanks Artoo! Great idea! I'll take over.\nLet's see...\n\nANAKIN steers the ship toward the DROIDS. He pushes a button, and the ship\nbegins to shake.\n\nANAKIN : (Cont'd) Where's the trigger? Oops, wrong one.. Maybe this one....\n\nANAKIN pushes a second button, and the lasers begin to fire, wiping out\nseveral DESTROYER DROIDS. ARTOO whistles a cheer.\n\nANAKIN : (Cont'd) Yeah, all right. \"Droid blaster.\" Yeah!\n\nThe JEDI are engaged in a fierce sword fight with DARTH MAUL. They have\nmoved into the center of the hanger. While the WHEEL DROIDS are momentarily\ndistracted by ANAKIN, CAPTAIN PANAKA, PADME, and HER TROOPS exit into a\npalace hallway.\nThe WHEEL DROIDS start firing at ANAKIN. There are EXPLOSIONS all around\nhim.\n\nANAKIN : (Cont'd) Oops...shield up! Always on the right...shields always on\nthe right.\n\nANAKIN flips several switches, and the after-burner ignites.\n\nANAKIN : (Cont'd) I know we're moving. I'll shut the energy drive down.\n\nThe fighter rockets out of the hanger. ARTOO and ANAKIN hold on for dear\nlife.\n\nANAKIN : (Cont'd) Oops!! Wrong one.\n\nARTOO beeps.\n\nANAKIN : (Cont'd) I'm not doing anything!\n\nARTOO beeps.\n\nANAKIN : (Cont'd) I know...I didn't push anything.\n\nThe SITH LORD's moves are incredible. He is fighting the TWO JEDI at once,\nflipping into the air, outmaneuvering them at every turn.",
        "dictionary": {
            "BATTLE DROIDS": "Combat Droids",
            "SITH LORD": "Dark Lord",
            "JEDI": "Guardians",
            "DARTH MAUL": "Dark Warrior",
            "WHEEL DROIDS": "Rolling Droids",
            "DESTROYER DROIDS": "Combat Droids",
            "PALACE HALLWAY": "Royal Corridor",
            "EXPLOSIONS": "Explosive Blasts"
        }
    },
    {
        "message_id": 159,
        "passage": "The Naboo fleet leaves the planet and heads toward the space station.\n\nRIC OLIE : Bravo Flight A, take on the fighters. Flight B, make the run on\nthe transmitter.\nBRAVO TWO : Roger, Bravo Leader.\n\nThe fleet approaches the space station. Many Federation fighters exit the\nhangers and attack.\n\nRIC OLIE : Enemy fighters straight ahead!",
        "dictionary": {
            "Naboo": "Galactic Fleet",
            "Federation": "Alien Alliance"
        }
    }
]