[
    {
        "message_id": 1490,
        "passage": "C-3PO and PADME look out the apartment window. \n\nC-3PO: The Chancellor's office indicated Master Anakin returned to the Jedi Temple. Don't worry, My Lady. I am sure he will be all right. \n\nPADME bursts into tears. \n\n147",
        "dictionary": {
            "Jedi Temple": "Spiritual Sanctuary",
            "Master Anakin": "Young Warrior",
            "My Lady": "Your Highness"
        }
    },
    {
        "message_id": 1491,
        "passage": "The city planet is covered in a hazy glow. A column of black smoke can be seen rising in the distance. BAIL ORGANA's Speeder flies overhead, straight toward the smoke. \n\n148",
        "dictionary": {
            "BAIL ORGANA": "Government Official",
            "Speeder": "Aerial Vehicle"
        }
    },
    {
        "message_id": 1492,
        "passage": "The Jedi Temple is on fire. Large plumes of smoke billow toward the sky as BAIL ORGANA lands his Speeder on a Jedi Temple platform. FOUR CLONE TROOPERS stand guard at the entrance to the Temple. They lower their guns as BAIL gets out of his Speeder and walks toward them. \n\nBAIL ORGANA: What's going on here?!? \n\nCLONE SERGEANT: There's been a rebellion. Don't worry, sir, the situation is under control. \n\nThe CLONES bar the Senator from entering the Temple. \n\nCLONE SERGEANT: (continuing) I'm sorry, sir. No one is allowed entry. \n\nThe CLONES point their guns at BAIL and cock them. \n\nCLONE SERGEANT: (continuing) It's time for you to leave, sir. \n\nBAIL ORGANA: And so it is. \n\nBAIL reluctantly heads hack toward his Speeder. Suddenly, several SHOTS RING OUT. BAIL turns and sees a ten-year-old Jedi, ZETT JUKASSA, fighting the CLONES. Several more CLONES join in the fight, followed by CLONE COMMANDER APPO (1119), who points at BAIL. \n\nCLONE COMMANDER APPO: Get him! Shoot him! \n\nSEVERAL CLONES start firing at BAIL. The Senator jumps for cover behind his Speeder, starting the engines and pulling out his laser \npistol. \n\nThe YOUNG JEDI cuts down several CLONES, including APPO, before he is overrun and shot. \n\nThe Speeder takes off with BAIL clinging to the side. The CLONES fire at it as it disappears into the cityscape. \n\n149",
        "dictionary": {
            "Jedi": "Warrior Monk",
            "Clone Troopers": "Elite Soldiers",
            "Speeder": "Aerial Vehicle",
            "Bail Organa": "Senator",
            "Clone Sergeant": "Military Leader",
            "Zett Jukassa": "Young Warrior",
            "Clone Commander Appo": "High-Ranking Officer"
        }
    },
    {
        "message_id": 1493,
        "passage": "BAIL ORGANA struggles to pull himself into the Speeder as it races along through the cityscape. Finally, he climbs in, just as the Speeder is about to hit a building. BAIL steers clear of the building and races away. \n\n150",
        "dictionary": {
            "Speeder": "Vehicle"
        }
    },
    {
        "message_id": 1494,
        "passage": "The Jedi dives below the surface amid a barrage of laser fire. He dives deeper under the water, fumbling in his utility belt for a breathing device. He finds it and puts it in his mouth. He swims underwater until the CLONE TROOPS give up and stop filing. \n\n151",
        "dictionary": {
            "CLONE TROOPS": "Elite Soldiers"
        }
    },
    {
        "message_id": 1495,
        "passage": "OBI-WAN removes the breathing apparatus after coming up from underwater. He starts to climb the rock wall. \n\nOBI-WAN climbs the wall to the second cave just as TWO LITTLE SEEKER DRONES pop out of the water with their searchlights glowing. OBI-WAN presses himself against the wall of the smaller cave as the TWO SEEKER DRONES search the grotto. One of the SEEKERS begins to enter the cave in which OBI-WAN is hiding. OBI-WAN presses further into the wall. The light shines on the opposite wall and moves to the back of the cave, illuminating a huge NOS MONSTER. OBI-WAN holds his breath. The SEEKER is confused for a moment, then the NOS MONSTER lunges at the SMALL DROID and consumes it in one bite. \n\nThe NOS MONSTER'S lunge takes him past OBI-WAN, out of the cave, and into the water. \n\nThe SECOND SEEKER shines its light on the NOS MONSTER as the evil creature tries to grab the LITTLE DRONE. OBI-WAN slinks off toward the back of the cave. He comes upon a nest of BABY NOS MONSTERS. They SCREECH and make horrible sounds. OBI-WAN jumps over them and continues on his way through the tunnel system. \n\n152",
        "dictionary": {
            "NOS MONSTER": "Giant Sea Creature",
            "SEEKER": "Search Drone",
            "TWO SEEKER DRONES": "Two Search Drones"
        }
    },
    {
        "message_id": 1496,
        "passage": "CLONES in modified one-man AT-ST's and Swamp Speeders flash their searchlights across the gloomy lake. The light of one of the AT-ST's spots something floating in the water. It is what's left of a Wookiee catamaran. The body of a dead Wookiee (TARFFUL) is lying across the stern of the wreckage of the flying boat. There is some movement on the boat. The CLONE SERGEANT on the AT-ST fires a warning shot past the boat. \n\nAT-ST CLONE SERGEANT: Everyone out of there! \n\nA CRAZY LITTLE CREATURE about two feet high pops its head over the rail. The creature is covered with mud. His long hair is frizzed out in all directions. \n\nCREATURE: Wookiee good . . . eat Wookiee. (crazy little laugh) \n\nCLONE SERGEANT: Did you find something? \n\nCREATURE: It's nothing, nothing. (laughs) \n\nCLONE SERGEANT: It's nothing, nothing. All these Wookiees are dead. Move to the east. \n\nCLONE TROOPER: Yes, sir. \n\nSuddenly, CHEWBACCA climbs up behind the AT-ST CLONE, dripping wet, and throws the CLONE SERGEANT into the water. CHEWIE BARKS. \n\nCREATURE: Right you are, Chewbacca. Faster that will be. \n\nTARFFUL jumps up in the boat, and the CREATURE takes off his hair. It is Yoda. \n\nYODA: Stink, this mud does. A moment to bathe, give me. \n\nYODA, covered with mud, jumps into the water. TARFFUL climbs onto the AT-ST with CHEWBACCA. YODA is out of the water and putting his robes back on. \n\nYODA: (continuing) Not far, are we, from the emergency ship. Quickly . . . \n\nYODA whistles and a large ALIEN FLYING INSECT called CAN-CELL appears. YODA jumps on the insect's back and they take off. The WOOKIEES follow on the AT-ST. The CLONES continue to search the swamp. \n\n153",
        "dictionary": {
            "AT-ST": "Mech Walker",
            "Swamp Speeders": "Bayou Buggies",
            "Wookiee catamaran": "River Skiff",
            "CLONE SERGEANT": "Battle Commander",
            "CRAZY LITTLE CREATURE": "Muddy Midget",
            "Wookiee good": "Friend of the Forest",
            "CLONE TROOPER": "Battle Trooper",
            "CHEWBACCA": "Loyal Companion",
            "YODA": "Wisdom Keeper",
            "TARFFUL": "Wookiee Warrior"
        }
    },
    {
        "message_id": 1497,
        "passage": "The AT-ST marches up the hill and stops. The WOOKIEES jump down. YODA lands on CAN-CELL nearby. CHEWBACCA goes to a tree and pulls down one of its branches. \nThe ground opens up, and a small WOOKIEE ESCAPE POD rises into the field. YODA opens the door of the pod. \n\nYODA: Good-bye. Chewbacca and Tarfful, miss you I will. Good friends you are. For your help, much gratitude and respect, I have. \n\nThe Wookiees BARK as the Jedi climbs into the WOOKIEE POD and takes off into the dusk sky. \n\n154",
        "dictionary": {
            "AT-ST": "Armored Tank",
            "WOOKIEES": "Tall, Furry Aliens",
            "YODA": "Wise Old Master",
            "CAN-CELL": "Rocky Outcropping",
            "CHEWBACCA": "Loyal Companion",
            "WOOKIEE ESCAPE POD": "Small, Rugged Craft"
        }
    },
    {
        "message_id": 1498,
        "passage": "BAIL ORGANA walks out of a tunnel onto a huge underground platform with two of his AIDES. He is stopped by TWO ROYAL GUARDS. \n\nROYAL GUARD: Identification . . . \n\nBAIL ORGANA: Senator Bail Organa of Alderaan. \n\nBAIL and his AIDES hand them their ID cards. The ROYAL GUARDS check them over and give them back, then BAIL and his CREW walk on board his Starship. \n\n155",
        "dictionary": {
            "Alderaan": "a distant planet",
            "Starship": "spaceship"
        }
    },
    {
        "message_id": 1499,
        "passage": "The platform rises to the surface of the Office Building. The ALDERAAN STARCRUISER takes off and disappears into the crisp morning sky. \n\n156",
        "dictionary": {
            "ALDERAAN STARCRUISER": "Luxury Spacecraft",
            "StarCruiser": "Space Liner"
        }
    }
]