[
    {
        "message_id": 90,
        "passage": "The Podracers fly across the desert. SEBULBA is running neck and neck with\nMAWHONIC. They round the first turn in the track, side by side. SEBULBA\ndrives his Pod into his rival, forcing him into the wall of a large rock\nformation. MAWHONIC crashes in a spectacular display of fire and smoke.\nANAKIN is much faster than the back-end stragglers and passes them easily.\nOne of the drivers, GASGANO, won't let ANAKIN by. ANAKIN tries to pass him\non one side and is cut off. He then tries to pass him on the other side\nansd is cut off. As they come up on a cliff drop-off, ANAKIN backs off,\nthen guns it as GASGANO goes over the cliff. ANAJIN accelerates so fast\nthat he sails right over the top of GASGANO and speeds away.\nFour TUSKEN RAIDERS perched above the race course fire their rifles at the\nPods racing in the canyon below them. One shot ricochets off the back of\nAnakin's Pod.\n\nFODE/BEED : -\nB : Looks like a few Tusken Riaders have campe out on the canyon dune turn.",
        "dictionary": {
            "Podracers": "Speeders",
            "SEBULBA": "Rival Driver",
            "MAWHONIC": "Competitor",
            "ANAKIN": "Young Driver",
            "TUSKEN RAIDERS": "Desert Bandits",
            "FODE/BEED": "Communication Device"
        }
    },
    {
        "message_id": 91,
        "passage": "JABBA THE HUTT and the crowd watch the progress of the race on small,\nhand-held view screens. JAR JAR is looking over the shoulder of a strange\nalien named FANTA.\n\nJAR JAR : Where's Skywalker?\n\nFANTA moves the view screen out of Jar Jar's view. PADME, SHMI, and QUI-GON\nwatch another screen and look worried.\nARTOO, down in the pits with KITSTER, lets out a worried sigh. The driver\nof the quadra-Pod looks worried.",
        "dictionary": {
            "JABBA THE HUTT": "Galactic Crime Lord",
            "JAR JAR": "Alien Servant",
            "FANTA": "Alien Observer",
            "QUI-GON": "Jedi Master",
            "ARTOO": "Droid Companion",
            "KITSTER": "Racing Mechanic",
            "quadra-Pod": "High-Speed Vehicle"
        }
    },
    {
        "message_id": 92,
        "passage": "ANAKIN is powering around corners and over hills and cliffs, passing other\nracers right and left. SEBULBA is in the lead. He is being challenged by\nanother racer, XELBREE.\nSEBULBA slows a little, and as XELBREE pulls alongside, he opens a side\nvent on the racer's engine and the exhaust starts to cut through the\nalien's engine.\nThe blast cuts along the engine until finally it EXPLODES. SEBULBA deftly\nveers away.\nANAKIN works his way through a dense mass of racers as they zoom over a\ndune sea, kicking up dust. His Pod shakes violently as he goes over a jump.\nOne of the Podracers, ODY, catches one of his engines in the sand, and the\nwhole thing EXPLODES.",
        "dictionary": {
            "Podracers": "Racing Cars",
            "SEBULBA": "Racing Driver",
            "EXPLODES": "Blows Up",
            "Pod": "Racing Vehicle"
        }
    },
    {
        "message_id": 93,
        "passage": "QUI-GON sits quietly, meditating. PADME and SHMI search the landscape for\nany sign of the racers. JAR JAR is still annoying FANTA for information.\nThe crowd SCREAMS. WATTO is laughing with his friends, confident in\nAnakin's defeat.\nThe quadra-Pod engines start just as the racers come around the corner. The\nDRIVER, BEN QUADINAROS, puts it in gear, and the four engines go off in all\ndirections, EXPLODING in a spectacular display. The Pod drops to the ground\nas SEBULBA enters the arena, closely followed by all the OTHER RACERS.\nKITSTER strains to see as ARTOO beeps excitedly. The announcer continues.\n\nFODE/BEED : - (O.S)\nB ; There goes Quadinaros' power couplings.\nA : Sebulba! Ka pa me cheespa wata! (Here comes Sebulba in record time.)\n\nQUI-GON, PADME, SHMI, and JAR JAR yell for joy as ANAKIN passes. JAR JAR is\nvery nervous and pounds on the back of his alien neighbor, FANTA. JAR JAR :\nWhat gooie-on?\nFANTA : Bug off.\n\nLap two. SEBULBA and the pack race past the main arena. The crowd stands\nand YELLS as the Podracers scream off into the distance. QUI-GON and PADME\nlook worried.\n\nJAR JAR : He musta crash-ud.\nPADME : Here he comes!",
        "dictionary": {
            "Podracers": "Racing Cars",
            "Sebulba": "Driver X",
            "Quadinaros": "Racer Y",
            "FODE/BEED": "Announcer",
            "Ka pa me cheespa wata": "Here comes Sebulba in record time",
            "googie-on": "What's going on",
            "Bug off": "Leave me alone"
        }
    },
    {
        "message_id": 94,
        "passage": "ARTOO lets out an excited whistle, as KITSTER yells.\n\nTHREEPIO : He has to complete two more circuits? Oh dear!",
        "dictionary": {
            "ARTOO": "the droid",
            "THREEPIO": "the protocol droid"
        }
    },
    {
        "message_id": 95,
        "passage": "Sure enough, coming around the bend is ANAKIN, quickly gaining on the pack.\nThe two-headed announcer describes the action. The crowd goes wild.\n\nFODE/BEED : - (O.S.)\nB : It looks like Skywalker is moving up through the field. He's in...\nA : Steeth pa nagoola! (Sixth place, not bad.)\n\nANAKIN continues to gain on the pack. Tension for SHMI and PADME is\nunbearable.\nODY stops in the pits. Droids work on his engines. DUM-4 stands in front of\nthe engine and is sucked in, causing the engine to die. DUM-4 is spit out\nthe back of the engine, very bent up. The engine lets out one final wheeze,\nthen EXPLODES in a puff of smoke.\n\nFODE/BEED : - (O.S.)\nA : Ody Mandrell! Coona wa wunda dunko! (Ody Mandrell into the pits for\nsome attention.)\nODY : Droids!\n\nTERTER is getting close to SEBULBA, who purposely breaks a small part off\nhis Pod, sending it into Terter's engine, causing him to veer into ANAKIN,\nand unhooks one of the main straps on Anakin's engines that links the Pod\nto his engines.\nANAKIN struggles to keep control of the little Pod. It whips about wildly.\nAs the Pod swings near the broken engine strap, ANAKIN grabs for it.\nFinally, he catches the strap and manages to unhook it to the Pod.\nSEBULBA cuts the engine of OBITOKI with his side exhaust, and the racer\ncrashes with a cloud of dust. A THIRD RACER, HABBA, flie into the cloud of\ndust and crashes into OBITOKI. ANAKIN rounds a corner and heads into the\ncloud of smoke. He hits a part of one of the engines but regains control.\n\nFODE/BEED : - (O.S.)\nB :At the start of the third and final lap, Sebulba is in the lead, closely\nfollowed by Skywalker...\n\nANAKIN finally catches up with SEBULBA, and runs neck and neck over the\nrough terrain. JAR JAR, QUI-GON, SHMI, and PADME all SCREAM s ANAKIN comes\nthrough the arena. The lights in the tower indicate that this is the third\nand last lap. WATTO begins to worry.\nSEBULBA uses his side exhaust port to try to cut through Anakin's engines.\nANAKIN manages to avoid having his engine disabled but is forced off\ncourse.\n\nFODE/BEED : - (O.S.)\nB : Skywalker is forced onto the service ramp!\nA : Oh noah!\n\nOn a tight corner, ANAKIN dives to the inside and takes the lead.\n\nFODE BEED : - (O.S.)\nB : Amazing... a controlled thrust and he's back on course! What a move!\n\nSEBULBA is furious. He stay's right on Anakin's tail, crowding him and\npushing him through the turns.\nSEBULBA pushes ANAKIN harder, and the young boy has a difficult time\nkeeping control. One of the parts on Anakin's engines begins to shake\nloose. ANAKIN sees it and switches over to an auxiliary system. While he is\ntrying to accomplish this maneuver, SEBULBA races past him.\nANAKIN tries to get around SEBULBA, to no avail. Every move ANAKIN makes,\nSEBULBA is able to block.\nFinally, ANAKIN fakes a move into the inside as he usually does, then tries\nto go around SEBULBA on the outside. They race sid by side down the final\nstretch of the track.\n\nFODE/BEED : - (O.S.)\nB : He's catching Sebulba.\nA : Inkabunga. (Incredible!)\n\nSEBULBA veers toward ANAKIN and bangs into his Pod. He crashes into ANAKIN\nover and over. The young boy struggles to maintain control as the steering\nrods on the two Pods become hooked together. SEBULBA laughs at ANAKIN.\n\nFODE/BEED : - (O.S.)\nB : That little human being is out of his mind.\nA : Punda tah punda! (They're neck and neck!)\nB : They're side by side!\nA : Bongo du bongu! (Shoulder to shoulder!)\n\nAs they head for the final stretch, ANAKIN fights to unlock the steering\nrods by trying to pull away from SEBULBA. The strain on the steering rod is\ntremendous. Suddenly, ANAKIN's steering arm breaks, and his Pos starts\nspinning.\nThe release of tension sends SEBULBA into an ancient statue. One engine\nEXPLODES, then the other. SEBULBA skids through the fire-balls, blackened,\nbut unhurt. He slides to a smoking stop, gets out of his racer, and throws\nwhat's left of a shifter arm on the ground. Suddenly he realizes his pants\nare on fire, and he struggles to put them out. ANAKIN flies through the\nEXPLOSION as the crowd stands, CHERRING. PADME and JAR JAR jump up and down\nwith excitment, PADME screaming for joy. ARTOO and KITSTER whistle\nhysterically. QUI-GON and SHMI smile. ANAKIN races over the finish line,\nthe winner.",
        "dictionary": {
            "ANAKIN": "The Young Boy",
            "SEBULBA": "The Rival Racer",
            "FODE/BEED": "The Commentators",
            "PADME": "The Concerned Woman",
            "JAR JAR": "The Excited Gungan",
            "QUI-GON": "The Proud Mentor",
            "SHMI": "The Worried Mother",
            "AROO/KITSTER": "The Celebrating Droids",
            "ODY": "The Racer in Trouble",
            "TERTER": "The Racer in Pursuit",
            "SEBULBA's side exhaust port": "The Rival's Engine",
            "DUM-4": "The Bent Droid",
            "HABBA": "The Unfortunate Racer",
            "WATTO": "The Concerned Owner",
            "JAR JAR's SCREAM": "The Excited Shout",
            "CHERRING": "Cheering",
            "ANKA's auxiliary system": "The Backup Engine"
        }
    },
    {
        "message_id": 96,
        "passage": "The two-headed announcer excitedly calls the finish.\n\nFODE/BEED : -\nB : It's Skywalker! The crowd are going nuts! Oh Ah Oh Ah (rock head in\ntandem with partner)",
        "dictionary": {
            "FODE/BEED": "Announcer's Call",
            "rock head in tandem with partner": "cheer in harmony"
        }
    },
    {
        "message_id": 97,
        "passage": "As ANAKIN stops the Podracer, KISTER turns up, and they embrace. Hundreds\nof SPECTATORS join them and put ANAKIN on their shoulders, marching off,\nCHEERING AND CHANTING. Darth Maul's PROBE DROIDS move through the crowd.",
        "dictionary": {
            "ANAKIN": "The Pilot",
            "Podracer": "Racing Car",
            "KISTER": "The Friend",
            "SPECTATORS": "The Crowd",
            "CHEERING AND CHANTING": "Cheering Loudly",
            "PROBE DROIDS": "Surveillance Robots"
        }
    },
    {
        "message_id": 98,
        "passage": "Several ALIENS leave Watto's box, laughing and counting their money. WATTO\nsees QUI-GON standing in the doorway.\n\nWATTO : You! You swindled me! You knew the boy was going to win! Somehow\nyou knew it! I lost everything.\n\nWATTO flies up to QUI-GON and puts his face right up against QUI-GON's.\nQUI-GON simply smiles.\n\nQUI-GON : Whenever you gamble, my freind, eventually you'll lose. Bring the\nparts to the main hanger. I'll come by your shop later so you can release\nthe boy.\nWATTO : You can't have him! It wasn't a fair bet!\nQUI-GON : Would you like to discuss it with the Hutts...I'm sure they can\nsettle this.\nWATTO : No, no! I want no more of your tricks! Take him!\n\nThe SITH PROBE DROID watches with great interest.",
        "dictionary": {
            "ALIENS": "non-human beings",
            "QUI-GON": "the negotiator",
            "WATTO": "the merchant",
            "QUI-GON's": "the negotiator's",
            "Hutts": "the crime lords"
        }
    },
    {
        "message_id": 99,
        "passage": "The Main Hanger is almost deserted as RACERS depart.",
        "dictionary": {
            "RACERS": "spacecraft",
            "Main Hanger": "main hangar"
        }
    }
]