[
    {
        "message_id": 1960,
        "passage": "Jabba is asleep on his throne, with Leia lying in front of\n     him. Salacious sits by Jabba's tail, watching it wriggle.\n     Leia is now dressed in the skimpy costume of a dancing girl;\n     a chain runs from a manacle/necklace at her throat to her new\n     master, Jabba the Hutt. Threepio stands behind Jabba as Bib\n     comes up to the gangster slug.\n\n                          THREEPIO\n               At last! Master Luke's come to\n               rescue me.\n\n                         BIB\n               Master.\n\n     Jabba awakens with a start and Bib continues, in Huttese.\n\n                    BIB (CONT’D)\n          ...Luke Skywalker, Jedi Knight.\n\n                    JABBA (IN HUTTESE SUBTITLED)\n          I told you not to admit him.\n\n                    LUKE\n          I must be allowed to speak.\n\n                    BIB (IN HUTTESE SUBTITLED)\n          He must be allowed to speak.\n\nJabba, furious, clobbers Bib and shoves him away.\n\n                    JABBA (IN HUTTESE SUBTITLED)\n          You weak-minded fool! He's using an\n          old Jedi mind trick.\n\nLuke stares hard at Jabba.\n\n                    LUKE\n          You will bring Captain Solo and the\n          Wookiee to me.\n\n                    JABBA (IN HUTTESE SUBTITLED)\n          Your mind powers will not work on\n          me, boy.\n\n                    LUKE\n          Nevertheless, I'm taking Captain\n          Solo and his friends. You can\n          either profit by this... or be\n          destroyed! It's your choice. But I\n          warn you not to underestimate my\n          powers.\n\nJabba's laugh is mean and loud. Threepio attempts to warn\nLuke about the pit.\n\n                    THREEPIO\n          Master Luke, you're standing on...\n\n                    JABBA (IN HUTTESE SUBTITLED)\n          There will be no bargain, young\n          Jedi. I shall enjoy watching you\n          die.\n\nLuke reaches out, and a pistol jumps out of a guard's holster\nand flies into Luke's hand. The bewildered guard grabs for it\nas Jabba raises his hand.\n\n                    JABBA (CONT’D)\n          Bascka!\n\n     The floor suddenly drops away, sending Luke and the hapless\n     guard into the pit. The pistol goes off, blasting a hole in\n     the ceiling. Jabba laughs and his courtiers join in. Leia\n     starts forward but is restrained by a human guard-- Lando,\n     recognizable behind his mask. She looks at him and he shakes\n     his head \"no.\"\n\n18",
        "dictionary": {
            "Jedi Knight": "Galactic Warrior",
            "Huttese": "Galactic dialect",
            "Jabba the Hutt": "Powerful crime lord",
            "Threepio": "Droid servant",
            "Bascka": "Order to attack",
            "Jabba's courtiers": "Loyal followers"
        }
    },
    {
        "message_id": 1961,
        "passage": "Luke and the guard have dropped twenty-five feet from a chute\n     into the dungeonlike cage. Luke gets to his feet as the guard\n     yells hysterically for help. A crowd gathers up around the\n     edge of the pit as the door in the side of the pit starts to\n     RUMBLE open. The guard screams in panic. Luke looks calmly\n     around for a means of escape.\n\n                         THREEPIO\n               Oh, no! The Rancor!\n\n     At the side of the pit, an iron door rumbles upward and a\n     giant, fanged RANCOR emerges. The guard runs to the side of\n     the pit and tries futilely to scramble to the top. The\n     hideous beast closes in on him.\n\n     The Rancor moves past Luke, and as the guard continues to\n     scramble, the Rancor picks him up and pops him into its\n     slavering jaws. A few screams, and the guard is swallowed\n     with a gulp. The audience cheers and laughs at the guard's\n     fate.\n\n     The monster turns and starts for Luke. The young Jedi dashes\n     away just ahead of the monster's swipe at him, and picks up\n     the long arm bone of an earlier victim. The monster grabs\n     Luke and brings him up to his salivating mouth. At the last\n     moment, Luke wedges the bone in the monster's mouth and is\n     dropped to the floor. The monster bellows in rage and flails\n     about, hitting the side of the pit, causing an avalanche.\n\n     The monster crushes the bone in its jaws and sees Luke, who\n     squeezes into a crevice in the pit wall. Luke looks past the\n     monster to the holding cave beyond. On the far side of the\n     holding cave is a utility door--if only he can get to it. The\n     Rancor spots Luke and reaches into the crevice for him. Luke\n     grabs a large rock and raises it, smashing it down on the\n     Rancor's finger.\n\n19   HOLDING TUNNEL - RANCOR PIT                                  19\n\n     The Rancor lets out a loud howl as Luke makes a run for the\n     holding cave. He reaches the door and pushes a button to open\n     it. When he succeeds, he sees a heavy barred gate between him\n     and safety. Beyond the gate two guards look up from their\n     dinner. Luke turns to see the monster heading for him, and\n     pulls with all his might on the gate.\n\n     The guards move to the gate and start poking at the young\n     Jedi with spears, laughing.\n\n     Luke crouches (against the wall) as the monster starts to\n     reach for him. Suddenly he notices a main door control panel\n     halfway up the wall. As the Rancor moves in for the kill,\n     Luke picks up a skull from the cave floor and hurls it at the\n     panel. The giant overhead door comes crashing down on the\n     beast's head, squashing it like a sledgehammer on an egg.\n\n     A startled gasp is heard from the stunned court. There's\n     consternation at this turn of events. Heads look to Jabba,\n     who is actually turning red with anger. Leia cannot suppress\n     her joy. Jabba utters harsh commands to his guards and they\n     hurry off.\n\n                         JABBA (IN HUTTESE SUBTITLED)\n               Bring me Solo and the Wookiee. They\n               will all suffer for this outrage.\n\n21",
        "dictionary": {
            "RUMBLE": "Loudly open",
            "RANCOR": "Giant beast",
            "HUTTESE SUBTITLED": "Translated speech"
        }
    },
    {
        "message_id": 1962,
        "passage": "The Rancor KEEPERS have come into the cage and are examining\n     their dead beast. One of them breaks down and weeps. The\n     other glares menacingly at Luke, who is unworried. Several\n     guards rush into the holding tunnel and take Luke away.\n\n22",
        "dictionary": {
            "Rancor": "Fierce Beast",
            "KEEPERS": "Caretakers"
        }
    },
    {
        "message_id": 1963,
        "passage": "The crowd of creepy courtiers parts as Han and Chewie are\n     brought into the throne room, and other guards drag Luke up\n     the steps.\n\n                         LUKE\n               Han!\n\n                         HAN\n               Luke!\n\n                         LUKE\n               Are you all right?\n\n                         HAN\n               Fine. Together again, huh?\n\n                         LUKE\n               Wouldn't miss it.\n\n                         HAN\n               How are we doing?\n\n                         LUKE\n               The same as always.\n\n                    HAN\n          That bad, huh? Where's Leia?\n\nLuke looks to Leia.\n\n                      LEIA\n          I'm here.\n\nThreepio is standing behind the grotesque gangster as he\nstrokes Leia like a pet cat. Several of the guards, including\nLando, bring Luke from the other side of the room. Boba is\nstanding behind Jabba.\n\nThreepio steps forward and translates for the captives.\n\n                    THREEPIO\n          Oh, dear. His High Exaltedness, the\n          great Jabba the Hutt, has decreed\n          that you are to be terminated\n          immediately.\n\n                    HAN\n          Good, I hate long waits.\n\n                    THREEPIO\n          You will therefore be taken to the\n          Dune Sea and cast into the pit of\n          Carkoon, the nesting place of the\n          all-powerful Sarlacc.\n\n                    HAN (TO LUKE)\n          Doesn't sound so bad.\n\n                    THREEPIO\n          In his belly, you will find a new\n          definition of pain and suffering,\n          as you are slowly digested over a\n          thousand years.\n\n                     HAN\n          On second thought, let's pass on\n          that, huh?\n\nChewie barks his agreement.\n\n                    LUKE\n          You should have bargained, Jabba.\n          That's the last mistake you'll ever\n          make.\n\nJabba cackles evilly at this.\n\nAs the guards drag the prisoners from the throne room, a loud\ncheer rises from the crowd.\n\n     Leia and Chewie exchange concerned looks, but Luke Skywalker,\n     Jedi warrior, cannot suppress a smile.\n\n23",
        "dictionary": {
            "Jabba the Hutt": "The Great Overlord",
            "Sarlacc": "The Devouring Beast",
            "Dune Sea": "The Arid Expanse",
            "Carkoon": "The Swallowing Depths"
        }
    },
    {
        "message_id": 1964,
        "passage": "Jabba's huge SAIL BARGE moves above the desert surface\n     accompanied by two smaller Skiffs. One of the skiffs glides\n     close, revealing Luke, Han, and Chewie -- all in bonds --\n     surrounded by guards, one of whom is Lando in disguise.\n\n                         HAN\n               I think my eyes are getting better.\n               Instead of a big dark blur, I see a\n               big light blur.\n\n                         LUKE\n               There's nothing to see. I used to\n               live here, you know.\n\n                         HAN\n               You're gonna die here, you know.\n               Convenient.\n\n                         LUKE\n               Just stick close to Chewie and\n               Lando. I've taken care of\n               everything.\n\n                         HAN\n               Oh... great!\n\n24",
        "dictionary": {
            "SAIL BARGE": "Luxury Cruiser",
            "Skiffs": "Small Boats"
        }
    },
    {
        "message_id": 1965,
        "passage": "Jabba the Hutt rides like a sultan in the massive antigravity\n     ship. His entire retinue is with him, drinking, eating, and\n     having a good time. Leia is watching her friends in the skiff\n     when the chain attached to her neck is pulled tight and Jabba\n     tugs the scantily clad princess to him.\n\n                         JABBA (IN HUTTESE SUBTITLED)\n               Soon you will learn to appreciate\n               me.\n\n     Threepio wanders among the Sail Barge aliens, bumping into a\n     smaller droid serving drinks, spilling them all over the\n     place. The stubby droid lets out an angry series of beeps and\n     whistles.\n\n                         THREEPIO\n               Oh, I'm terribly sor... Artoo! What\n               are you doing here?\n\n     Artoo beeps a quick reply.\n\n                           THREEPIO (CONT’D)\n                 Well, I can see you're serving\n                 drinks, but this place is\n                 dangerous. They're going to execute\n                 Master Luke and, if we're not\n                 careful, us too!\n\n     Artoo whistles a singsong response.\n\n                            THREEPIO (CONT’D)\n                 Hmm.   I wish I had your confidence.\n\n25",
        "dictionary": {
            "Huttese": "Alien language",
            "Sail Barge": "Luxury yacht",
            "Jabba the Hutt": "Powerful crime lord"
        }
    },
    {
        "message_id": 1966,
        "passage": "The convoy moves up over a huge sand pit. The Sail Barge\n     stops to one side of the depression, as does the escort\n     skiff. But the prisoner's skiff moves out directly over the\n     center and hovers. At the bottom of the deep cone of sand is\n     a repulsive, mucous-lined hole, surrounded by thousands of\n     needle-sharp teeth. This is the SARLACC. A plank is extended\n     from the edge of the prisoner's skiff. Guards release Luke's\n     bonds and shove him out onto the plank above the Sarlacc's\n     mouth.\n\n26",
        "dictionary": {
            "Sarlacc": "gaping abyss",
            "Sail Barge": "large ship",
            "Sarlacc's": "its",
            "needle-sharp teeth": "sharp fangs"
        }
    },
    {
        "message_id": 1967,
        "passage": "Jabba and Leia are now by the rail, watching. Threepio leans\n     forward and the slobbering villain mumbles something to him.\n     As Threepio steps up to a comlink, Jabba raises his arm and\n     the motley array of intergalactic pirates fall silent.\n     Threepio's voice is amplified across loudspeakers.\n\n                           THREEPIO\n                 Victims of the almighty Sarlacc:\n                 His Excellency hopes that you will\n                 die honorably. But should any of\n                 you wish to beg for mercy, the\n                 great Jabba the Hutt will now\n                 listen to your pleas.\n\n27",
        "dictionary": {
            "Sarlacc": "pit of despair",
            "His Excellency": "the noble lord",
            "Jabba the Hutt": "the powerful mogul"
        }
    },
    {
        "message_id": 1968,
        "passage": "Han steps forward arrogantly and begins to speak.\n\n                           HAN\n                 Threepio, you tell that slimy piece\n                 of... worm-ridden filth he'll get\n                 no such pleasure from us. Right?\n\n     Chewie growls his agreement.\n\n                           LUKE\n                 Jabba! This is your last chance.\n                 Free us or die.\n\n     Lando moves unobtrusively along the skiff as Luke shoots a\n     quick look of conspiracy to him.\n\n28",
        "dictionary": {
            "Threepio": "Translator Droid",
            "Jabba": "The Boss"
        }
    },
    {
        "message_id": 1969,
        "passage": "The assembled monsters rock with mocking laughter as Artoo\n     zips unnoticed up the ramp to the upper deck. Jabba's\n     laughter subsides as he speaks into the comlink.\n\n                         JABBA (IN HUTTESE SUBTITLED)\n               Move him into position.\n\n     Jabba makes a thumbs-down gesture. Leia looks worried.\n\n29",
        "dictionary": {
            "Huttese": "Galactic dialect",
            "Artoo": "Robot",
            "Jabba": "Crime lord"
        }
    }
]