[
    {
        "message_id": 160,
        "passage": "JAR JAR's clumsiness works for him in the battle. He gets caught up in the\nwiring of a blasted DROID, dragging the torso around with him, the DROID's\ngun firing randomly, accidently blasting SEVERAL DROIDS in one process.\nOOM-9 decides to send in the WHEEL DROIDS and gives the signal. HUNDREDS OF\nWHEEL DROIDS roll out of the transports and head down toward the battle.\nThey slowly roll through the deflector shields, then transform themselves\nonce they get on the other side. The GUNGANS blast the WHEEL DROIDS with\nenergy balls. The DESTROYER DROIDS blast many GUNGANS.",
        "dictionary": {
            "JAR JAR": "Clumsy Alien",
            "DROID": "Robot",
            "WHEEL DROIDS": "Rolling Robots",
            "OOM-9": "Robot Commander",
            "GUNGANS": "Swamp Creatures",
            "DESTROYER DROIDS": "Heavy Robots"
        }
    },
    {
        "message_id": 161,
        "passage": "A giant dogfight ensues. ANAKIN's fighter flies into space above Naboo.\nARTOO beeps a worried concern.\n\nANAKIN : The Autopilot is searching for what other ships?\n\nARTOO beeps and whistles.\n\nANAKIN : (Cont'd) There is no manual override, Artoo. You'll have to rewire\nit or something.\n\nARTOO chirps that he's trying.\n\nANAKIN : (cont'd) Look! There they are! That's where the autopilot is\ntaking us.\n\nANAKIN's fighter flies toward the Federation Battleship.",
        "dictionary": {
            "ANAKIN": "Captain",
            "ARTOO": "Co-pilot"
        }
    },
    {
        "message_id": 162,
        "passage": "The SITH LORD drives the JEDI out of the hanger and nto the power generator\narea next door.",
        "dictionary": {
            "SITH LORD": "Dark Lord",
            "JEDI": "Knights of the Order"
        }
    },
    {
        "message_id": 163,
        "passage": "Three swords are crossed in an intense display of swordmanship. The JEDI\nand the SITH LORD fight their way across the narrow bridge of the Theed\npower generator. DARTH MAUL jumps onto the bridge above them. The JEDI\nfollow, one in front of the SITH LORD and one behind. They continue their\nsword fight.",
        "dictionary": {
            "JEDI": "Warriors of Peace",
            "SITH LORD": "Dark Warrior",
            "DARTH MAUL": "Dark Warrior's Apprentice",
            "Theed": "Power Plant"
        }
    },
    {
        "message_id": 164,
        "passage": "PADME, CAPTAIN PANAKA, EIRTAE, SABE and THIER TROOPS are trapped in a\nhallway by BATTLE DROIDS.\n\nPADME : We don't have time for this, Captain.\nCAPT. PANAKA : Let's try the outside stairway.\n\nCAPTAIN PANAKA blasts a hole in the window, and they make their way outside\nthe building onto a ledge about six stories above a raging waterfall. SABE,\nEIRTAE and about TWENTY NABOO SOLDIERS stay in the hallway to hold off the\nBATTLE DROIDS.",
        "dictionary": {
            "BATTLE DROIDS": "Robot Soldiers",
            "NABOO SOLDIERS": "Elite Troops"
        }
    },
    {
        "message_id": 165,
        "passage": "PADME, CAPTAIN PANAKA, and about TEN OTHER NABOO SOLDIERS are lined up\nalong the edge. They have pulled small attachments out of their pistols and\nfire at a ledge about four stories above them. Thin cables shoot out of the\npistols and are embedded into the ledge. PADME, CAPTAIN PANAKA, and the\nOTHERS begin to climb up the wall.",
        "dictionary": {
            "Naboo": "Planet of the Queen"
        }
    },
    {
        "message_id": 166,
        "passage": "The GUNGAN ARMY is no match for the DESTROYER DROIDS. JAR JAR tries to run\nfrom the BATTLE DROIDS.\n\nGENERAL CEEL : Retreat! Retreat!\n\nThe GUNGANS begin to turn and run, on foot, on their kaadu, and in wagons.\nJAR JAR attempts to escape on a wagon of energy balls but only manages to\nunhitch the back gate, causing all of the energy balls to roll out of the\nwagon and down the hill. JAR JAR scrambles to avoid being hit by one of the\nballs. FOUR DESTROYER DROIDS aren't so lucky. They get blasted by the\nenergy balls.\nThe GUNGANS renew their attack on the DROID ARMY. JAR JAR's bumbling\ndestroys several more DESTROYER DROIDS.",
        "dictionary": {
            "GUNGAN ARMY": "Native Troops",
            "DESTROYER DROIDS": "Mechanical Soldiers",
            "BATTLE DROIDS": "Combat Drones",
            "JAR JAR": "A Character",
            "GENERAL CEEL": "A Commander",
            "GUNGANS": "Local People",
            "kaadu": "Mounts",
            "DROID ARMY": "Machine Troops"
        }
    },
    {
        "message_id": 167,
        "passage": "ANAKIN finds himself in the middle of the space battle. A ship explodes\nbehind him (over his left shoulder).\n\nANAKIN : Whoo, boy! This is tense!\n\nHe looks forward to see enemy ships approaching head on.\n\nANAKN : (Cont'd) : Oops! Artoo, get us off Autopilot!\n\nARTOO screams a reply.\n\nANAKIN : (Cont'd) I've got control?\n\nANAKIN fips switches.\n\nANAKIN : (Cont'd) Okay, let's go left!\n\nHe moves the controls left and the ship responds, turning left.\n\nANAKIN : (Cont'd) Yes...I've got control. You did it, Artoo!\n\nARTOO beeps\n\nANAKIN : (Cont'd) Go back!?! Qui-Gon told me to stay in this cockpit and\nthat's what I'm gonna do. Now c'mon!\n\nAn enemy fighter comes into his sights. ANAKIN pushes the controls and\ninstead of firing, his fighter accelerates past the enemy ship.\n\nANAKIN : (Cont'd) Oops! Whoa!\n\nNow the enemy ship is on his tail. He tries evasive maneauvers.\n\nANAKIN : (Cont'd) I'll try spinning, that's a good trick.\n\nANAKIN rolls the ship as ARTOO screams desperately.\n\nANAKIN : (Cont'd) I know we're in trouble! Hang on! The way out of this\nmess is the way we got into it.\n\nARTOO beeps a reply.\n\nANAKIN : (Cont'd) Which one? This one?\n\nANAKIN yanks on the reverse thrusters and the ship slows instantly- the\nenemy fighter shoots past and explodes against the space station.",
        "dictionary": {
            "Whoo, boy!": "Wow, this is intense!",
            "Autopilot": "Automatic Pilot",
            "Qui-Gon": "Commander"
        }
    },
    {
        "message_id": 168,
        "passage": "The SQUADRON attacks the space station.\n\nRIC OLIE : Bravo flight...go for the central bridge.\nBRAVO TWO : ROger, Bravo Leader.\n\nThe attack is fruitless.\n\nRIC OLIE : Their deflector shield is too strong. We'll never get through\nit.\n\nMeanwhile, ANAKIN is being chased by another fighter. ARTOO shrieks.\n\nANAKIN : I know, Artoo! This isn't Podracing!\n\nThe enemy ship fires and hits ANAKIN's fighter, sending it into a spin.\nARTOO screams.\n\nANAKIN : (Cont'd) We're hit!\n\nANAKIN regains control as his ship enters the space station hanger.\n\nANAKIN : (Cont'd) Great gobs of bantha poo-doo!\n\nANAKIN's ship dodges parked transport ships and other obstacles. A huge\nbulkhead blocks his way. ARTOO beeps.\n\nANAKIN : (Cont'd) I'm trying to stop! I'm trying to stop! Whoa!\n\nANAKIN hits the reverse thrusters and the ship skids to a stop on the\nhanger deck. ARTOO givesout a worried whistle.\n\nANAKIN : (Cont'd) All right! All right! Get the system started!\n\nANAKIN ducks down to adjust a control panel.\n\nANAKIN : (Cont'd) Everything's overheated. All the lights are red.\n\nARTOO sees DROIDS appraoching, and beeps frantically.",
        "dictionary": {
            "SQUADRON": "Fighter Wing",
            "Podracing": "High-Speed Racing",
            "bantha poo-doo": "utter nonsense",
            "DROIDS": "Robots"
        }
    },
    {
        "message_id": 169,
        "passage": "The laser sword battle continues on the small catwalk around the vast power\npit. DARTH MAUL kicks OBI-WAN off one of the ramps and he falls several\nlevels. QUI-GON knocks the DARK LORD off another ramp, and he lands hard on\na ramp two levels below. QUI-GON jumps down after him. The DARK LORD backs\naway along the catwalk into a small door. QUI-GON follows as OBI-WAN runs\nto catch up.",
        "dictionary": {
            "DARTH MAUL": "Dark Lord",
            "QUI-GON": "Warrior",
            "OBI-WAN": "Companion",
            "DARK LORD": "Evil Master"
        }
    }
]