[
    {
        "message_id": 2050,
        "passage": "The air is thick with giant ships. In among them, Rebel X-\n      wings dogfight with Imperial TIE fighters. Now an enormous\n      Rebel cruiser is hit by the Death Star beam and is blown to\n      dust.\n\n      The Millennium Falcon roars over CAMERA, followed closely\n      byseveral TIE fighters.\n\n109",
        "dictionary": {
            "Death Star": "Doomsday Station",
            "Rebel X-wings": "Alliance Fighter Jets",
            "Imperial TIE fighters": "Empire Jet Fighters",
            "Millennium Falcon": "Stellar Explorer"
        }
    },
    {
        "message_id": 2051,
        "passage": "The ship is buffeted by the tremendous explosion of the Rebel\n      cruiser. Lando and his copilot are stunned by the sight of\n      the Death Star firepower.\n\n                          LANDO\n                That blast came from the Death\n                Star! That thing's operational!\n                    (into comlink)\n                Home One, this is Gold Leader.\n\n110",
        "dictionary": {
            "Death Star": "Galactic Destroyer",
            "Rebel": "Resistance"
        }
    },
    {
        "message_id": 2052,
        "passage": "Ackbar stands amid the confusion on the wide bridge and\n      speaks into the comlink.\n\n                          ACKBAR\n                We saw it. All craft prepare to\n                retreat.\n\n                          LANDO\n                You won't get another chance at\n                this, Admiral.\n\n                          ACKBAR\n                We have no choice, General\n                Calrissian. Our cruisers can't\n                repel firepower of that magnitude.\n\n                          LANDO\n                Han will have that shield down.\n                We've got to give him more time.\n\n111",
        "dictionary": {
            "comlink": "radio",
            "cruisers": "warships",
            "General": "Commander",
            "Admiral": "Commander"
        }
    },
    {
        "message_id": 2053,
        "passage": "Artoo and Threepio make it to the door, as Han and Leia\n      provide cover fire.\n\n                          THREEPIO\n                We're coming!\n\n                          HAN\n                Come on! Come on!\n\n                          THREEPIO\n                Oh, Artoo, hurry!\n\n      The little droid moves to the terminal and plugs in his\n      computer arm. A large explosion hits near Artoo, knocking him\n      head over heels, finally landing on his feet. The stubby\n      astrodroid's head is spinning and smoldering. Suddenly there\n      is a loud SPROOING and Han and Leia turn around to see Artoo\n      with all his compartment doors open, and all of his\n      appendages sticking out; water and smoke spurt out of the\n      nozzles in his body. Han rushes to the terminal, as Threepio\n      rushes to his wounded companion.\n\n                          THREEPIO (CONT’D)\n                My goodness! Artoo, why did you\n                have to be so brave?\n\n                          HAN\n                Well, I suppose I could hotwire\n                this thing.\n\n                          LEIA\n                I'll cover you.\n\n      Ewoks in handmade, primitive hanggliders drop rocks onto the\n      stormtroopers, divebombing their deadly adversaries. One is\n      hit in the wing with laser fire and crashes. A walker lumbers\n      forward, shooting laser blasts at frantic Ewoks running in\n      all directions. Two Ewoks are struck down by laser blasts.\n\n      One tries to awaken his friend, then realizes that he is\n      dead.\n\n112",
        "dictionary": {
            "SPROOING": "Ripping",
            "Ewoks": "Local tribespeople"
        }
    },
    {
        "message_id": 2054,
        "passage": "The Rebel fleet continues to be picked off, from one side by\n      the Death Star's deadly beam, from the other by the rampaging\n      Imperial Star Destroyers.\n\n113",
        "dictionary": {
            "Death Star": "Planet Destroyer",
            "Rebel fleet": "Resistance Armada"
        }
    },
    {
        "message_id": 2055,
        "passage": "Lando steers the Falcon wildly through an obstacle course of\n      floating giants. He's been yelling into the comlink.\n\n                          LANDO (DESPERATELY)\n                Yes! I said closer! Move as close\n                as you can and engage those Star\n                Destroyers at point-\n\n      blank range.\n\n                          ACKBAR\n                At that close range, we won't last\n                long against those Star Destroyers.\n\n                          LANDO\n                We'll last longer then we will\n                against that Death Star...and we\n                might just take a few of\n\n      them with us.\n\n      The Rebel cruisers move very close to the Imperial Star\n      Destroyers and begin to blast away at point-blank range. Tiny\n      fighters race across the giant surfaces, against a backdrop\n      of laser fire.\n\n      The control tower of a Star Destroyer is under attack.\n\n                          REBEL PILOT\n                She's gonna blow!\n\n                           Y-WING PILOT\n                I'm hit!\n\n      The damaged Y-wing plummets toward the Star Destroyer, and\n      crashes into the control tower, exploding.\n\n114",
        "dictionary": {
            "Star Destroyers": "Imperial Battleships",
            "Death Star": "Imperial Station"
        }
    },
    {
        "message_id": 2056,
        "passage": "Out of the window and on the view screens, the Rebel fleet is\n      being decimated in blinding explosions of light and debris.\n      But in here there is no sound of battle. The Emperor turns to\n      Luke.\n\n                             EMPEROR\n                   Your fleet has lost. And your\n                   friends on the Endor moon will not\n                   survive. There is no escape, my\n                   young apprentice. The Alliance will\n                   die...as will your friends.\n\n      Luke's eyes are full of rage. Vader watches him.\n\n                             EMPEROR (CONT’D)\n                   Good. I can feel your anger. I am\n                   defenseless. Take your weapon!\n                   Strike me down with all your\n                   hatred, and your journey towards\n                   the dark side will be complete.\n\n      Luke can resist no longer. The lightsaber flies into his\n      hand. He ignites it in an instant and swings at the Emperor.\n      Vader's lightsaber flashes into view, blocking Luke's blow\n      before it can reach the Emperor. The two blades spark at\n      contact. Luke turns to fight his father.\n\n115",
        "dictionary": {
            "Rebel fleet": "Resistance army",
            "Endor moon": "Outer planet",
            "Alliance will die": "Coalition will perish"
        }
    },
    {
        "message_id": 2057,
        "passage": "The battle rages on. Stormtroopers fire on Ewoks with\n      sophisticated weapons while their furry little adversaries\n      sneak up behind the Imperial troopers and bash them over the\n      head with large clubs.\n\n      A walker marches through the undergrowth blasting Ewoks as it\n      goes. An Ewok warrior gives the signal, and a pile of logs is\n      cut loose. The logs tumble under the walker's feet, causing\n      it to slip and slide until it finally topples over with a\n      great crash.\n\n      A scout bike races past and is lassoed with a heavy vine. The\n      other end of the vine is tied to a tree, and the bike swings\n      around in ever- tightening circles until it runs out of rope\n      and crashes into the trees with a huge explosion.\n\n      Chewie swings on a vine to the roof of one of the walkers.\n      Two Ewoks cling to him. They land with a thud on the top of\n      the lurching machine, then hang on for dear life. One of the\n      Ewoks peeks through the window.\n\n      WALKER PILOT #1\n\n      Look!\n\n                             PILOT #2\n                   Get him off of there!\n\n      The walker pilot opens the hatch to see what's going on. He\n      is yanked out and tossed overboard before he can scream.\n\n      The two Ewoks jump into the cockpit and knock the second\n      pilot unconscious. The Ewoks are thrown violently as the\n      mighty machine careens out of control. Outside, Chewie is\n      almost knocked overboard; he sticks his head into the hatch\n      with a series of angry barks. The Ewoks are too busy and\n      frightened to listen to the Wookiee's complaint. Chewie slips\n      inside the walker.\n\n      Chewbacca's walker moves through the forest, firing laser\n      blasts at unsuspecting stormtroopers, and destroying other\n      Imperial walkers. The Ewoks shout and cheer as the giant\n      machine helps turn the tide of the battle in their favor.\n\n116",
        "dictionary": {
            "Ewoks": "forest dwellers",
            "Imperial walkers": "mechanized troops",
            "Scout bike": "reconnaissance vehicle",
            "Chewie": "Wookiee",
            "Wookiee": "Furry creature"
        }
    },
    {
        "message_id": 2058,
        "passage": "Han works furiously at the control panel; wires spark as he\n      attempts to hotwire the door. He motions to Leia, who is\n      blasting away at some stormtroopers.\n\n                          HAN\n                I think I got it. I got it!\n\n      The three wires spark as the connection is made. With a LOUD\n      WHOOSH, a second blast door crashes down in front of the\n      first.\n\n      Han frowns and turns back to the wires again. Leia exchanges\n      shots with stormtroopers in the bushes, then suddenly cries\n      out in pain, her shoulder hit by a laser blast.\n\n                          THREEPIO\n                Oh, Princess Leia, are you all\n                right?\n\n                             HAN\n                Let's see.\n\n                          LEIA\n                It's not bad.\n\n                             STORMTROOPER   (OS)\n                Freeze!\n\n      They freeze.\n\n                             THREEPIO\n                Oh, dear.\n\n                          STORMTROOPER\n                Don't move!\n\n      Leia holds her laser gun ready, behind Han, out of view of\n      the two stormtroopers moving toward them. Han and Leia's eyes\n      lock; the moment seems suspended in time.\n\n                          HAN\n                I love you.\n\n      Another shared look between them, as she smiles up at Han.\n\n                             LEIA\n                I know.\n\n                          STORMTROOPER\n                Hands up! Stand up!\n\n      Han stands up slowly and turns, revealing the gun in Leia's\n      hand. She disposes of the stormtroopers in a flash. As Han\n      turns back toward Leia, he looks up to see a giant walker\n      approach and stand before him, its deadly weapons aimed right\n      at him.\n\n                             HAN    (TO LEIA)\n                Stay back.\n\n      The hatch on top of the walker opens and Chewie sticks his\n      head out and barks triumphantly.\n\n                         HAN (CONT’D)\n                Chewie! Get down here! She's\n                wounded! No, wait.... I got an\n                idea.\n\n117",
        "dictionary": {
            "I got it": "I've succeeded",
            "LOUD WHOOSH": "powerful explosion",
            "OS": "off-screen"
        }
    },
    {
        "message_id": 2059,
        "passage": "Luke and Vader are engaged in a man-to-man duel of\n      lightsabers even more vicious then the battle on Bespin. But\n      the young Jedi has grown stronger in the interim, and now the\n      advantage shifts to him. Vader is forced back, losing his\n      balance, and is knocked down the stairs. Luke stands at the\n      top of the stairs, ready to attack.\n\n                          EMPEROR (LAUGHING)\n                Good. Use your aggressive\n                feelings, boy! Let the hate flow\n                through you.\n\n      Luke looks momentarily toward the Emperor, then back to\n      Vader, and realizes he is using the dark side. He steps back,\n      turns off his lightsaber, and relaxes, driving the hate from\n      his being.\n\n                          VADER\n                Obi-Wan has taught you well.\n\n                          LUKE\n                I will not fight you, father.\n\n      Vader walks back up the stairs to Luke.\n\n                          VADER\n                You are unwise to lower your\n                defenses.\n\n      Vader attacks, forcing Luke on the defensive. The young Jedi\n      leaps in an amazing reverse flip up to the safety of the\n      catwalk overhead. Vader stands below him.\n\n                          LUKE\n                Your thoughts betray you, father. I\n                feel the good in you...the\n                conflict.\n\n                          VADER\n                There is no conflict.\n\n                          LUKE\n                You couldn't bring yourself to kill\n                me before, and I don't believe\n                you'll destroy me\n\n      now.\n\n                          VADER\n                You underestimate the power of the\n                dark side. If you will not fight,\n                then you will meet\n\n      your destiny.\n\n      Vader throws the laser sword and it cuts through the supports\n      holding the catwalk, then returns to Vader's hand. Luke\n      tumbles to the ground in a shower of sparks and rolls out of\n      sight under the Emperor's platform. Vader moves to find him.\n\n                           EMPEROR   (LAUGHS)\n                Good.   Good.\n\n118",
        "dictionary": {
            "lightsabers": "energy blades",
            "Bespin": "a distant planet",
            "Jedi": "warrior-monk",
            "dark side": "evil influence",
            "Obi-Wan": "a wise mentor",
            "father": "a parental figure"
        }
    }
]