[
    {
        "message_id": 1800,
        "passage": "Asteroids race by the cockpit window as Han pilots his\n      trusty craft through the dangerous field.\n\n      Looking out the cockpit window, the Falcon crew sees a big\n      asteroid drop past the window, narrowly missing their ship.\n\n      Chewie barks in terror as a slightly smaller asteroid comes\n      especially close - to close - and bounces off the Falcon\n      with a loud crunch. Threepio's hands cover his eyes. He\n      manages a short peek at the cockpit window. Princess Leia\n      sits stone-faced, staring at the action. Han gives her a\n      quick look.\n\n                          HAN\n                You said you wanted to be around\n                when I made a mistake; well, this\n                could be it, sweetheart.\n\n                          LEIA\n                I take it back. We're going to get\n                pulverized if we stay out here much\n                longer.\n\n      The group watches as more asteroids race by outside the\n      window.\n\n                          HAN\n                I'm not going to argue with that.\n\n                          THREEPIO\n                Pulverized?\n\n                          HAN\n                I'm going in closer to one of those\n                big ones.\n\n                           LEIA\n                Closer?\n\n                           THREEPIO\n                Closer?!\n\n      Chewbacca barks the same word, only louder.\n\n135",
        "dictionary": {
            "Falcon": "Spacecraft",
            "Threepio": "Robot",
            "Chewie": "Wookiee",
            "Princess Leia": "Leader"
        }
    },
    {
        "message_id": 1801,
        "passage": "The Millennium Falcon dives toward the surface of one of the\n      moon-sized asteroids. There is a continued display of\n      explosions against the starry void as smaller asteroids\n      collide with larger chunks of rock. The two remaining TIE\n      fighters follow the Falcon to the large asteroid. The Falcon\n      skims the surface of the giant asteroid as, all the while,\n      small asteroids explode on the surface of the ship.\n\n      The TIE fighters approach the Falcon, but a giant asteroid\n      hurtles directly into their path. As the asteroid continues\n      on its way, it leaves remains of the two exploded TIE\n      fighters to tumble into deep space.\n\n136",
        "dictionary": {
            "Millennium Falcon": "High-Speed Transport",
            "TIE fighters": "Imperial Patrol Craft"
        }
    },
    {
        "message_id": 1802,
        "passage": "Rattled by the violent rocking of the starship, Threepio is\n      nearly in hysterics.\n\n                          THREEPIO\n                Oh, this is suicide!\n\n      Han notices something on his main scope and nudges his\n      faithful Wookiee, pointing.\n\n                            HAN\n                There.    That looks pretty good.\n\n                          LEIA\n                What looks pretty good?\n\n                            HAN\n                Yeah.    That'll do nicely.\n\n                          THREEPIO\n                    (to Leia)\n                Excuse me, ma'am, but where are we\n                going?\n\n      Out the cockpit window, they see that they are skimming the\n      surface of the enormous asteroid and nearing a large crater.\n\n137",
        "dictionary": {
            "Threepio": "The android",
            "Wookiee": "Faithful companion"
        }
    },
    {
        "message_id": 1803,
        "passage": "The Millennium Falcon dives into the huge crater and\n      disappears.\n\n138",
        "dictionary": {
            "Millennium Falcon": "High-Speed Spacecraft",
            "crater": "impact site"
        }
    },
    {
        "message_id": 1804,
        "passage": "LEIA\n                I hope you know what you're doing.\n\n                          HAN\n                Yeah, me too.\n\n139",
        "dictionary": {
            "LEIA": "Princess"
        }
    },
    {
        "message_id": 1805,
        "passage": "The Falcon races down into the crater. The walls are barely\n      visible as the ship speed through the tunnellike opening. A\n      small cave appears on one side of the crater, and the Falcon\n      turns, slows, and scoots into it.\n\n140",
        "dictionary": {
            "Falcon": "Spacecraft",
            "tunnellike": "tunnel-like"
        }
    },
    {
        "message_id": 1806,
        "passage": "The tiny X-wing speeds toward the cloud cover of Dagobah.\n      Artoo, riding on the back of the fighter, turns his head\n      back and forth with some anxiety.\n\n141",
        "dictionary": {
            "Dagobah": "Remote Planet",
            "X-wing": "Experimental Fighter"
        }
    },
    {
        "message_id": 1807,
        "passage": "Luke watches Artoo's words as they are translated and\n      screened on the computer scope.\n\n                           LUKE\n                     (into comlink)\n                 Yes, that's it. Dagobah.\n\n      Artoo beeps a hopeful inquiry.\n\n                           LUKE (CONT’D)\n                     (into comlink)\n                 No, I'm not going to change my mind\n                 about this.\n                     (getting a little\n                      nervous)\n                 I'm not picking up any cities or\n                 technology. Massive life-form\n                 readings, though. There's\n                 something alive down there...\n\n      Artoo beeps, this time a slightly worried question.\n\n                           LUKE (CONT’D)\n                     (into comlink)\n                 Yes, I'm sure it's perfectly safe\n                 for droids.\n\n142",
        "dictionary": {
            "Dagobah": "Exotic Planet",
            "comlink": "Communication Device",
            "Artoo": "Robot",
            "Droids": "Artificially Intelligent Machines"
        }
    },
    {
        "message_id": 1808,
        "passage": "The X-wing continues its flight through the twilight above\n      the cloud- covered planet.\n\n143",
        "dictionary": {
            "X-wing": "fighter jet",
            "twilight": "dusk",
            "cloud-covered": "overcast",
            "planet": "world"
        }
    },
    {
        "message_id": 1809,
        "passage": "Luke sees the cloud race by as he takes his craft closer to\n      the planet. He must operate his controls carefully since the\n      cloud cover has completely obscured his vision. An alarm\n      buzzes in the background, Artoo beeps and whistles\n      frantically.\n\n                           LUKE\n                     (into comlink)\n                 I know, I know! All the scopes are\n                 dead. I can't see a thing! Just\n                 hang on, I'm going to start the\n                 landing cycle...\n\n      The blast of the retrorockets is deafening, drowning out\n      Artoo's electronic squeals. Suddenly, there is a cracking\n      sound as if limbs were being broken off trees and then a\n      tremendous jolt as the spacecraft stops. Luke pulls a\n      switch and his canopy pops open.\n\n144",
        "dictionary": {
            "Artoo": "Robot",
            "retrorockets": "reverse thrusters"
        }
    }
]