[
    {
        "message_id": 1890,
        "passage": "Moving through a tunnellike entrance, Luke cautiously\n      approaches the reactor room. He ignites his sword and moves\n      into the room and toward a large window as Vader enters.\n\n      Luke raises his sword and moves forward to attack.\n\n      Behind Luke a large piece of machinery detaches itself from\n      the wall and comes smashing forward toward his back. Luke\n      turns and cuts it in half just as another machine comes\n      hurtling at him. Using the Force, Luke manages to deflect\n      it and send it flying as if it had hit an invisible shield.\n\n      A large pipe detaches and comes flying at Luke. He deflects\n      it. Sparking wires pull out of the wall and begin to whip at\n      the youth. Small tools and equipment come flying at him.\n      Bombardment from all sides, Luke does his best to deflect\n      everything, but soon he is bloodied and bruised. Finally,\n      one machine glances off his and goes flying out the large\n      window. A fierce wind blows into the room, unmoving, stands\n      the dark, rocklike figure of Vader.\n\n      A piece of machinery hits Luke and he is knocked out of the\n      window.\n\n225",
        "dictionary": {
            "the Force": "his intuition",
            "Vader": "the dark lord"
        }
    },
    {
        "message_id": 1891,
        "passage": "Luke falls onto the gantry, rolls, and hangs over the edge,\n      holding his deactivated sword in hand. He puts the sword on\n      his belt and begins to scramble up.\n\n226",
        "dictionary": {
            "gantry": "mezzanine",
            "deactivated": "disarmed"
        }
    },
    {
        "message_id": 1892,
        "passage": "Leia, Lando, Chewie and the droids come round a corner and\n      head for the door to the landing platform. They glimpse the\n      Millennium Falcon for a moment before the door slams shut.\n      The group ducks into an alcove as stormtroopers arrive at\n      the end of the corridor. The troopers send a rain of laser\n      bolts at the group. Chewie returns their fire as Lando\n      punches desperately at the door's control panel.\n\n                          LANDO\n                The security codes has been\n                changed!\n\n                          THREEPIO\n                Artoo, you can tell the computer to\n                override the security system.\n\n      Threepio points to a computer socket on the control panel.\n      Artoo beeps and scoots toward it. Lando meanwhile has\n      connected up to the panel's intercom.\n\n                          LANDO\n                Attention! This is Lando\n                Calrissian. The Empire has takes\n                control of the city. I advise\n                everyone to leave before more\n                Imperial troops arrive.\n\n      Artoo takes off a computer cover and sticks his computer arm\n      into the socket. Suddenly, a short beep turns into a wild\n      scream. Artoo's circuits light up, his head spins wildly,\n      and smoke begins to seep out underneath him. Quickly,\n      Chewie pulls him away.\n\n                            LANDO (CONT’D)\n                This way.\n\n      Lando, Leia, Artoo, and Chewie flee down the corridor. As\n      he scoots along with them, Artoo sends some angry beeps\n      Threepio's way.\n\n                          THREEPIO\n                Don't blame me. I'm an\n                interpreter. I'm not supposed to\n                know a power socket from a computer\n                terminal.\n\n227",
        "dictionary": {
            "Millennium Falcon": "Star Destroyer",
            "stormtroopers": "imperial soldiers",
            "Lando Calrissian": "Captain Jenkins",
            "Artoo": "Robot 3000",
            "Threepio": "Assistant Translator",
            "Chewie": "Loyal Companion"
        }
    },
    {
        "message_id": 1893,
        "passage": "In a panic, Cloud City residents are trying to get out of\n      the city. Some carry boxes, others packages. They run, then\n      change direction. Some are shooting at stormtroopers, others\n      simply try to hide.\n\n      Other stormtroopers pursue Lando, Leia, and Chewie who are\n      firing back at them. Artoo works on another door to the\n      landing platform while Threepio berates him for his seeming\n      ineptitude.\n\n                          THREEPIO\n                What are you talking about? We're\n                not interested in the hyperdrive on\n                the Millennium Falcon. It's fixed!\n                Just open the door, you stupid\n                lump.\n\n      Chewie, Leia, and Lando retreat along the corridor. A\n      triumphant beep from Artoo - and the door snaps open.\n\n                           THREEPIO (CONT’D)\n                    (to Artoo)\n                I never doubted you for a second.\n                Wonderful!\n\n      Artoo lays a cloud fog, obscuring everything, as the group\n      dashes outside.\n\n228",
        "dictionary": {
            "Millennium Falcon": "High-Speed Transport",
            "stormtroopers": "imperial soldiers"
        }
    },
    {
        "message_id": 1894,
        "passage": "They race for the Millennium Falcon as a battalion of\n      stormtroopers reaches the main door. Lando and Leia hold\n      off the troops as the droids get on board with Chewie. As\n      Chewie bounds to the ship the Threepio on his back, Threepio\n      hits his head on the top of the ramp.\n\n                          THREEPIO\n                Ouch! Oh! Ah! That hurt. Bend\n                down, you thoughtless... Ow!\n\n      Chewie starts up the ship. The giant engines begin to whine\n      as Lando and Leia race up the ramp under a hail of laser\n      fire.\n\n                              LANDO\n                Leia!   Go!\n\n229",
        "dictionary": {
            "Millennium Falcon": "Galactic Cruiser",
            "stormtroopers": "armored soldiers",
            "Threepio": "Robot Companion",
            "Chewie": "Loyal Wookiee",
            "Lando": "Smooth-Talking Smuggler",
            "Leia": "Determined Princess",
            "droids": "artificial servants"
        }
    },
    {
        "message_id": 1895,
        "passage": "Artoo drags the partially assembled Threepio down the\n      corridor of the Falcon.\n\n                          THREEPIO\n                I thought that hairy beast would be\n                the end of me. Of course, I've\n                looked better.\n\n      Artoo beeps understandingly.\n\n230",
        "dictionary": {
            "Threepio": "Android",
            "Falcon": "Spaceship"
        }
    },
    {
        "message_id": 1896,
        "passage": "Chewie works the controls as Leia sits in Han's seat and\n      Lando watches over their shoulders. As Chewie pulls back on\n      the throttle, the ship begins to move.\n\n231",
        "dictionary": {
            "Chewie": "Pilot",
            "Lando": "Captain"
        }
    },
    {
        "message_id": 1897,
        "passage": "The Millennium Falcon lifts gracefully into the twilight sky\n      and roars away from the city. Troops fire after it and TIE\n      fighters take off in pursuit.\n\n232",
        "dictionary": {
            "Millennium Falcon": "High-Speed Spacecraft",
            "TIE": "Fighter Jet"
        }
    },
    {
        "message_id": 1898,
        "passage": "Luke moves along the railing and up to the control room.\n\n      Vader lunges at him and Luke immediately raises his lit\n      sword to meet Vader's. Sparks fly as they duel, Vader\n      gradually forcing Luke backward toward the gantry.\n\n                          VADER\n                You are beaten. It is useless to\n                resist. Don't let yourself be\n                destroyed as Obi-Wan did.\n\n      Luke answers by rolling sideways and thrusting his sword at\n      Vader so viciously that he nicks Vader on the shoulder. The\n      black armor sparks and smokes and Vader seems to be hurt,\n      but immediately recovers.\n\n      Luke backs off along the narrow end of the gantry as Vader\n      comes at him, slashing at the young Jedi with his sword.\n      Luke makes a quick move around the instrument complex\n      attached to the end of the gantry. Vader's sword comes\n      slashing down, cutting the complex loose; it begins to fall,\n      then is caught by the rising wind and blown upward.\n\n      Luke glances at the instrument complex floating away. At\n      that instant, Vader's sword comes down across Luke's right\n      forearm, cutting off his hand and sending his sword flying.\n      In great pain, Luke squeezes his forearm under his left\n      armpit and moves back along the gantry to its extreme end.\n      Vader follows. The wind subsides. Luke holds on. There is\n      nowhere else to go.\n\n                          VADER (CONT’D)\n                There is no escape. Don't make me\n                destroy you. You do not yet\n                realize your importance. You have\n                only begun to discover your power.\n                Join me and I will complete your\n                training. With our combined\n                strength, we can end this\n                destructive conflict and bring\n                order to the galaxy.\n\n                          LUKE\n                I'll never join you!\n\n                          VADER\n                If you only knew the power of the\n                dark side. Obi-Wan never told you\n                what happened to your father.\n\n                          LUKE\n                He told me enough!   It was you who\n                killed him.\n\n                           VADER\n                No.   I am your father.\n\n      Shocked, Luke looks at Vader in utter disbelief.\n\n                          LUKE\n                No. No. That's not true! That's\n                impossible!\n\n                          VADER\n                Search your feelings.     You know it\n                to be true.\n\n                            LUKE\n                No!   No!   No!\n\n                          VADER\n                Luke. You can destroy the Emperor.\n                He has foreseen this. It is your\n                destiny. Join me, and together we\n                can rule the galaxy as father and\n                son. Come with me. It is the only\n                way.\n\n      Vader puts away his sword and holds his hand out to Luke.\n\n      A calm comes over Luke, and he makes a decision. In the\n      next instant he steps off the gantry platform into space.\n      The Dark Lord looks over the platform and sees Luke falling\n      far below. The wind begins to blow at Vader's cape and the\n      torrent finally forces him back, away from the edge. The\n      wind soon fades and the wounded Jedi begins to drop fast,\n      unable to grab onto anything to break his fall.\n\n233",
        "dictionary": {
            "Jedi": "Warrior of the Force",
            "Obi-Wan": "Old Friend",
            "Dark Lord": "Powerful Enemy",
            "Emperor": "Supreme Ruler",
            "Force": "Energy Field"
        }
    },
    {
        "message_id": 1899,
        "passage": "Suddenly Luke is sucked into an exhaust pipe in the side of\n      the shaft. When Vader sees this, he turns and hurries off\n      the platform.\n\n234",
        "dictionary": {
            "Jedi": "Guardian of Peace",
            "Vader": "Dark Lord"
        }
    }
]