[
    {
        "message_id": 1630,
        "passage": "Leia and the communications officer are at the comm unit.\n     Luke's transmissions are being monitored by them.\n\n                            LUKE\n                    (over speaker)\n               We're approaching the water planet. We're \n               following Han and Chewie...\n\n     The message is cut off by static.\n\n                            COMMUNICATIONS OFFICER\n               We've lost them.\n\n46.",
        "dictionary": {
            "water planet": "oceanic world",
            "Chewie": "the Wookiee",
            "Han": "the smuggler"
        }
    },
    {
        "message_id": 1631,
        "passage": "The Y-wing is headed for the ocean.\n\n                            LUKE\n               Hang on, Threepio. We're going in.\n\n                            THREEPIO\n               Are you sure this is the best way, sir?\n\n     The Y-wing bounces on the surface of the water several \n     times before coming to a rest. Artoo whistles and \n     balloons inflate to keep the ship above water.\n\n47.",
        "dictionary": {
            "Threepio": "Translator Droid",
            "Y-wing": "Seaplane"
        }
    },
    {
        "message_id": 1632,
        "passage": "Threepio is in the back seat upside down. Luke who wound \n     up under the dashboard, sits up.\n\n                            THREEPIO\n               Master Luke, sir, are you all right?\n\n                            LUKE\n               Yes. How 'bout Artoo?\n\n     Artoo whistles that he is. Luke pushes a button on the\n     dashboard and it beeps.\n\n                            LUKE\n               Our comlinks are out. We can't contact the \n               base.\n\n48.",
        "dictionary": {
            "Threepio": "Mechanic",
            "Artoo": "Robot"
        }
    },
    {
        "message_id": 1633,
        "passage": "The Y-wing is floating on the ocean. The cockpit hatch \n     opens.\n\n                            THREEPIO\n               Where are you going, sir?\n\n     Luke stands up and looks around with his macrobinoculars.\n\n                            LUKE\n               To see if I can locate the Falcon by \n               visual sighting. Maybe it's close by.\n\n     A large creature has risen up from the water behind the \n     Y-wing and roars. Luke drops his macrobinoculars and \n     pulls out his blaster. He fires on the creature and hits \n     it in the head. The creature just licks his licks as if \n     it liked being shot.\n \n                            LUKE\n                    (to Artoo)\n               Artoo, stand by to fire the ejection pod.\n\n     The creature reaches its long neck down and takes a bite \n     out of the rear of the ship.\n\n                            THREEPIO\n               And hurry Artoo or we'll be desert soon.\n\n     The front of the ship detaches and speeds away. The \n     creature is hit by a ray that makes it dive into the \n     ocean. The ray came from a forked rifle held by Boba Fett. \n     He is seated in a saddle on another of the creatures.\n\n                            THREEPIO\n               What is it, master Luke?\n\n                            LUKE\n               I'm not sure.\n                    (to Boba)\n               You saved my life. Thank you.\n\n                            BOBA FETT\n               You are alone?\n\n                            LUKE\n               I have two droids. We've come in search \n               of a ship that crashed near here.\n\n                            BOBA FETT\n               Maybe I can help you. I am Boba Fett. The \n               ship you seek is nearby.\n\n                            LUKE\n               Are the Imperial troops near this planet?\n\n                            BOBA FETT\n               They are here, friend and growing more \n               powerful.\n\n                            LUKE\n               How far away?\n\n     The creature that Boba is riding licks what remains of \n     Luke's Y-wing. Boba smacks the creature with his rifle.\n\n                            BOBA FETT\n                    (to creature)\n               Settle down.\n                    (to Luke)\n               All they do is eat.\n\n               Luke pulls out a ration pack.\n\n                            LUKE\n               This is all we have but uh, he's welcome \n               to it.\n\n     The creature wraps it tongue around the pack and pulls it \n     out of Luke's hands and into its mouth. It chews it and \n     then swallows.\n\n                            BOBA FETT\n               You are foolish to waste your kindness on \n               this dumb creature. No lower life form is \n               worth going hungry for, friend. I take it \n               you have no love of the Empire.\n\n                            LUKE\n               I don't.\n\n                            BOBA FETT\n               Well, neither do I. It will be easy to \n               find the ship you seek. Follow me, \n               friend.\n\n     He hits his mount with his rifle and the creature begins \n     to move.\n\n49.",
        "dictionary": {
            "Y-wing": "Experimental Fighter",
            "macrobinoculars": "Binoculars with Zoom",
            "ejection pod": "Emergency Escape Module",
            "Falcon": "Rebel Transport",
            "Artoo": "Trusty Droid"
        }
    },
    {
        "message_id": 1634,
        "passage": "THREEPIO\n               Don't you think it might be imprudent to \n               trust him so quickly, sir?\n\n                            LUKE\n               He's our only chance. And, besides he \n               seems like a friend.\n\n     Artoo beeps.\n\n                            THREEPIO\n               Indeed, friend is merely a term that is \n               often misused.\n\n50.",
        "dictionary": {
            "THREEPIO": "Assistant Droid",
            "Artoo": "Mechanical Companion"
        }
    },
    {
        "message_id": 1635,
        "passage": "Luke's Y-wing follows Boba Fett across the ocean. Several\n     moons can be seen in the sky.\n\n                            LUKE\n                    (voice over)\n               Did Artoo say that?\n\n                            THREEPIO\n               Words to that affect.\n\n     We then see the Millennium Falcon floating on its \n     balloons.\n\n51.",
        "dictionary": {
            "Y-wing": "Fighter Jet",
            "Boba Fett": "Mercenary",
            "Millennium Falcon": "Space Cruiser"
        }
    },
    {
        "message_id": 1636,
        "passage": "Chewie is holding the glowing talisman in his hands. Luke \n     is standing a doorway.\n\n                            LUKE\n               Chewie, you've got the talisman. What's \n               wrong?\n\n     Chewie growls.\n\n                            LUKE\n               No, don't destroy it! \n\n     Chewie drops the talisman out of a porthole. Luke glows \n     and then slumps to the floor.\n\n                            LUKE\n               The talisman...\n\n     Boba sees Luke on the ground and fires a rope from his \n     wrist at Chewie. The rope wraps itself around Chewie.\n\n                            THREEPIO\n               Boba Fett, no! He's a friend. Don't hurt \n               him, Boba Fett.\n\n                            BOBA FETT\n               What did he do to Luke?\n\n     Boba releases the rope that is holding Chewie. Artoo\n     whistles.\n\n                            THREEPIO\n               He didn't do anything. R2-D2 has detected\n               contamination. \n\n     Chewie picks up Luke and carries him down a corridor. \n     Everyone follows him.\n\n                            THREEPIO\n               It must have come from the talisman.\n\n     Artoo whistles.\n\n                            THREEPIO\n               Artoo says it's some kind of sleeping \n               virus that only affects humans.\n\n     Chewie growls and then hangs Luke upside down next to Han.\n\n                            THREEPIO\n               He says the only way to keep them alive is \n               to let the blood rush to their heads.\n\n                            BOBA FETT\n               I know this sleeping virus the Empire \n               uses on its enemies. They have a remedy \n               for it in the city. I could get some for \n               you.\n\n     Chewie growls.\n\n                            THREEPIO\n               I'm afraid, Chewbacca insists on going \n               with you.\n\n                            BOBA FETT\n               You'll only get in the way. But, if you \n               must. Come on.\n\n52.",
        "dictionary": {
            "Chewie": "the Wookiee",
            "Boba Fett": "the bounty hunter",
            "R2-D2": "the droid",
            "Artoo": "the droid",
            "Threepio": "the protocol droid",
            "talisman": "the sacred relic",
            "porthole": "the airlock",
            "Fett": "the bounty hunter"
        }
    },
    {
        "message_id": 1637,
        "passage": "Chewie and Boba ride his creature towards the city. When \n     they arrive, they climb up into the city through a duct.\n\n53.",
        "dictionary": {
            "Chewie": "Wookiee",
            "Boba": "Mercenary"
        }
    },
    {
        "message_id": 1638,
        "passage": "Boba Fett and Chewie are standing in a doorway of a \n     building. There are many aliens around - either walking \n     or standing.\n\n                            BOBA FETT\n               You stay here while I get the serum.\n\n     Chewie growls.\n\n                            BOBA FETT\n               I said stay, friend. Luke trusted me and \n               I'm your only chance of getting out of \n               here alive. Do you understand me?\n\n     Chewie growls that he does. Boba walks away from Chewie \n     and walks the streets past many exotic aliens. He sees a \n     shop with a sign advertising the serum.\n\n                            CAPTAIN KAZAN\n                    (voice over)\n               Starlog update: although Boba Fett \n               quickly located the serum for the \n               sleeping virus - we had no idea of his \n               real plan.\n\n     Boba goes to a public communications unit and inserts a \n     card into it. Darth Vader appears on the monitor.\n\n                            BOBA FETT\n               I have made contact with the Rebels and \n               all is proceeding as you wish, Darth \n               Vader.\n\n54.",
        "dictionary": {
            "Boba Fett": "Elite Bounty Hunter",
            "Chewie": "Loyal Wookiee",
            "Starlog": "Galactic News Report",
            "Darth Vader": "Powerful Sith Lord"
        }
    },
    {
        "message_id": 1639,
        "passage": "At this revelation, Lumpy has a fit and starts howling. \n     The Imperial officer hears him howling and walks over to \n     him. Lumpy quickly pushes a button on the yellow box and \n     a game comes up.\n\n                            IMPERIAL OFFICER\n               What is it now? Oh is that all, just some \n               silly game.\n\n     Lumpy shakes his head \"yes.\" The officer walks away and\n     leaves him alone. Lumpy pushes another button and the \n     cartoon comes back on.\n\n55.",
        "dictionary": {
            "Imperial officer": "High-ranking official",
            "Lumpy": "Young boy"
        }
    }
]