[
    {
        "message_id": 1970,
        "passage": "Artoo appears from below and zips over to the rail facing the\n     pit. Below, in the skiff, Luke is prodded by a guard to the\n     edge of the plank over the gaping Sarlacc. Luke looks up at\n     Artoo, then gives a jaunty salute: the signal the little\n     droid has been waiting for. A flap opens in Artoo's domed\n     head.\n\n                         JABBA   (IN HUTTESE SUBTITLED)\n               Put him in.\n\n30",
        "dictionary": {
            "Sarlacc": "abyss",
            "Huttese": "alien language"
        }
    },
    {
        "message_id": 1971,
        "passage": "Luke is prodded and jumps off the plank to the cheers of the\n     bloodthirsty spectators. But, before anyone can even perceive\n     what is happening, he spins around and grabs the end of the\n     plank by his fingertips. The plank bends wildly from his\n     weight and catapults him skyward. In midair he does a\n     complete flip and drops down on the end of the plank in the\n     same spot he just vacated, but facing the skiff. He casually\n     extends an open palm and -- his lightsaber, which Artoo has\n     sent arcing toward him, drops into his hand.\n\n     With samurai speed, Luke ignites it and attacks the guard who\n     prodded him off the plank, sending the hapless monster\n     screaming overboard. The other guards swarm toward Luke. He\n     wades into them, lightsaber flashing. Lando struggles with\n     another guard at the back of the skiff.\n\n31",
        "dictionary": {
            "lightsaber": "energy sword",
            "Artoo": "droid",
            "samurai speed": " swift movement"
        }
    },
    {
        "message_id": 1972,
        "passage": "A bewildered guard lands in the soft, sandy slope of the pit,\n     and begins sliding. He claws desperately as a Sarlacc\n     tentacle grabs him and pulls him screaming into the viscous\n     mouth.\n\n32",
        "dictionary": {
            "Sarlacc": "Venomous creature",
            "pit": "abyss"
        }
    },
    {
        "message_id": 1973,
        "passage": "Jabba watches this and explodes in rage. He barks commands,\n     and the guards around him rush off to do his bidding. The\n     scuzzy creatures watching the action from the window are in\n     an uproar.\n\n33",
        "dictionary": {
            "Jabba": "The Boss",
            "barks": "yells"
        }
    },
    {
        "message_id": 1974,
        "passage": "Luke knocks another guard off the skiff and into the waiting\n     mouth of the Sarlacc. He starts to untie Chewie's bonds.\n\n                           LUKE\n                 Easy, Chewie.\n\n     At that moment, the deck gunmen on the barge unleash a series\n     of blasts from a big cannon on the upper deck. Lando is\n     tossed from the deck of the rocking skiff. He manages to grab\n     a rope, and dangles desperately above the Sarlacc pit.\n\n                           LANDO\n                 Whoa! Whoa! Help!\n\n34",
        "dictionary": {
            "Sarlacc": "giant carnivorous creature",
            "Chewie": "Wookiee",
            "LUKE": "the protagonist"
        }
    },
    {
        "message_id": 1975,
        "passage": "With two swift strides, the dangerous Boba Fett ignites his\n     rocket pack, leaps into the air, and flies from the barge\n     down to the skiff.\n\n35",
        "dictionary": {
            "Boba Fett": "Elite Mercenary",
            "rocket pack": "jetpack"
        }
    },
    {
        "message_id": 1976,
        "passage": "Boba lands on the skiff and starts to aim his laser gun at\n     Luke, who has freed Han and Chewie from their bonds. But\n     before Boba can fire, the young Jedi spins on him, lightsaber\n     sweeping, and hacks the bounty hunter's gun in half.\n\n     Immediately, the skiff takes another direct hit from the\n     barge's deck gun. Shards of skiff deck fly. Chewie and Han\n     are thrown against the rail.\n\n                           HAN\n                 Chewie, you okay? Where is he?\n\n     The Wookiee is wounded and he howls in pain.\n\n                           HAN (CONT’D)\n                 I'm okay, pal.\n\n     For a moment, Luke is distracted, and in that moment, Boba\n     fires a cable out of his armored sleeve. Instantly, Luke is\n     wrapped in a strong cable, his arms pinned against his side,\n     his sword arm free only from the wrist down.\n\n     Luke bends his wrist so the lightsaber points straight up to\n     reach the wire lasso and cuts through. Luke shrugs away the\n     cable and stands free.\n\n     Another blast from the Barge's deck gun hits near Boba and he\n     is knocked unconscious to the deck, next to where Lando is\n     hanging.\n\n                         LANDO\n               Han! Chewie?\n\n                         HAN\n               Lando!\n\n     Luke is a little shaken but remains standing as a fusillade\n     brackets him. The second skiff, loaded with guards firing\n     their weapons, moves in on Luke fast. Luke leaps toward the\n     incoming second skiff. The young Jedi leaps into the middle\n     of the second skiff and begins decimating the guards from\n     their midst.\n\n     Chewie, wounded, tries to lift himself as he barks directions\n     to Han, guiding him toward a spear which has been dropped by\n     one of the guards. Han searches the deck as Chewie barks\n     directions; finally he grabs hold of the spear.\n\n     Boba Fett, badly shaken, rises from the deck. He looks over\n     at the other skiff, where Luke is whipping a mass of guards.\n     Boba raises his arm, and aims his lethal appendage.\n\n     Chewie barks desperately at Han.\n\n                         HAN (CONT’D)\n               Boba Fett?! Boba Fett?! Where?\n\n     The space pirate turns around blindly, and the long spear in\n     his hand whacks squarely in the middle of Boba's rocket pack.\n\n     The impact of the swing causes the rocket pack to ignite.\n     Boba blasts off, flying over the second skiff like a missile,\n     smashing against the side of the huge Sail Barge and sliding\n     away into the pit. He screams as his armored body makes its\n     last flight past Lando and directly into the mucous mouth of\n     the Sarlacc. The Sarlacc burps. Chewie growls a weak\n     congratulations to Han.\n\n36",
        "dictionary": {
            "Boba Fett": "The Bounty Hunter",
            "Sarlacc": "The Pit Monster"
        }
    },
    {
        "message_id": 1977,
        "passage": "Leia turns from the spectacle outside, leaps onto Jabba's\n     throne, and throws the chain that enslaves her over his head\n     around his bulbous neck. Then she dives off the other side of\n     the throne, pulling the chain violently in her grasp. Jabba's\n     flaccid neck contracts beneath the tightening chain.\n\n     His huge eyes bulge from their sockets and his scum-coated\n     tongue flops out. The Exalted Hutt's huge tail spasms through\n     its death throes and then slams down into final stillness.\n     Leia struggles to free herself of her bondage.\n\n37",
        "dictionary": {
            "Hutt": "Corporation",
            "Exalted": "Respected"
        }
    },
    {
        "message_id": 1978,
        "passage": "Luke continues to destroy the aliens on the guards' skiff, as\n     Han extends his spear downward to Lando, who is still\n     dangling precariously from a rope on the prisoner's skiff.\n\n                           HAN\n                 Lando, grab it!\n\n                             LANDO\n                 Lower it!\n\n                           HAN\n                 I'm trying!\n\n     A major hit from the barge deck gun knocks the skiff on its\n     side. Han and almost everything else on board slides\n     overboard. The rope breaks, and Lando falls to the side of\n     the Sarlacc pit. Luckily, Han's foot catches on the skiff\n     railing and he dangles above Lando and the pit. The wounded\n     Wookiee holds onto the skiff for dear life as another hit\n     from the deck gun rocks the skiff violently.\n\n                           HAN (CONT’D)\n                 Whoa! Whoa! Grab me, Chewie! I'm\n                 slipping.\n\n     Chewie grabs hold of Han's feet, holding him upside down, as\n     Han extends the spear toward Lando, who is clutching to the\n     side of the pit.\n\n                           HAN (CONT’D)\n                 Grab it! L--Lando. Grab!\n\n     Luke finishes off the last guard on the second skiff. He sees\n     the deck gun blasting away at his helpless companions. Luke\n     leaps from the skiff, across a chasm of air, to the sheer\n     metallic side of the Sail Barge. Barely able to get a\n     fingerhold, he begins a painful climb up the hull, when\n     suddenly an ax smashes through a window an inch from his\n     head. With Jedi agility, Luke grasps the wrist holding the ax\n     and yanks the helpless guard through the broken window and\n     into the deadly pit.\n\n     The injured Chewie is reaching over the rail for the dangling\n     Han, who is in turn blindly reaching down toward the\n     desperate Lando. The Baron has stopped his slippage down the\n     sandy slope of the Sarlacc pit by lying very still.\n\n     Every time he tries to reach for Han, the loose sand moves\n     him closer to his final reward.\n\n                         HAN (CONT’D)\n               Grab it! Almost... You almost got\n               it!\n\n     Another blast hits the front of the tilted skiff, causing\n     Lando to let go of the spear.\n\n                         LANDO\n               Hold it! Whoa!\n\n     Again Han extends the spear toward Lando.\n\n                         HAN\n               Gently now. All... all right. Now\n               easy, easy. Hold me, Chewie.\n\n     Lando screams. One of the Sarlacc's tentacles has wrapped\n     tightly around his ankle, dragging him down the side of the\n     pit.\n\n                         HAN (CONT’D)\n               Chewie! Chewie, give me the gun.\n               Don't move, Lando.\n\n                         LANDO\n               No, wait! I thought you were blind!\n\n                         HAN\n               It's all right. Trust me. Don't\n               move.\n\n                         LANDO\n               All right! A little higher! Just a\n               little higher!\n\n     Han adjusts his aim as Lando lowers his head, and the fuzzy-\n     eyed pirate fires at the tentacle. Direct hit. The tentacle\n     releases Lando, and Chewie starts to pull them on board the\n     skiff.\n\n                         HAN\n               Chewie, Pull us up! Come on!\n               Okay... up, Chewie, up!\n\n38",
        "dictionary": {
            "Sarlacc": "Devouring Pit",
            "Jedi": "Warrior Monk"
        }
    },
    {
        "message_id": 1979,
        "passage": "The deck gunners have Chewie and the desperate dangling human\n     chain in their gun sights when something up on deck commands\n     their attention: Luke, standing before them like a pirate\n     king, ignites his lightsaber.\n\n     The deck gunners have barely reached for their pistols before\n     the young Jedi has demolished them. Immediately, Luke turns\n     to see two more gunners (who have been uncovering a giant gun\n     at the end of the barge) racing for him, firing their laser\n     pistols.\n\n39",
        "dictionary": {
            "Chewie": "Wookiee",
            "Jedi": "Warrior Monk",
            "lightsaber": "energy sword"
        }
    }
]