[
    {
        "message_id": 1060,
        "passage": "Among the tiers, JEDI are slowly being driven back. They have killed heaps of GEONOSIANS and have kncoked out piles of DROIDS, but sheer numbers are telling. Individual JEDI are being cut down or blasted/ The rest are retreating into the arena.\n\nANAKIN and PADME are back-to-back, fighting DROIDS and flying GEONOSIANS. MACE WINDU fights fiercely with JANGO FETT. Finally, the bounty hunter falls. His helmet goes flying, bouncing down the steps, tumbling and rolling, kicked here and there by random feet. The bounty hunter's body falls to the ground.\n\nMACE WINDU runs to the center of the arena and fights back-to-back with OBI-WAN, as they swipe and mangle DROIDS.\n\n\t\t\t\tOBI-WAN\n\t\t\tSomeone's got to - shut down -\n\t\t\tthese droids.\n\n\t\t\t\tMACE WINDU\n\t\t\tDon't worry! It's being - taken\n\t\t\tcare of!",
        "dictionary": {
            "JEDI": "Warriors",
            "GEONOSIANS": "Enemies",
            "DROIDS": "Robots",
            "ANAKIN": "Alex",
            "PADME": "Patricia",
            "MACE WINDU": "Marcus",
            "JANGO FETT": "John",
            "OBI-WAN": "Oliver"
        }
    },
    {
        "message_id": 1061,
        "passage": "KI-ADI-MUNDI leads a raiding party of about TWENTY JEDI through the lines of parked Battle Starships. They cut a swath through masses of DROIDS until they arrive at the Command Starship. Some JEDI fall. The rest cut their way up the ramps and into the Command Ship.",
        "dictionary": {
            "JEDI": "Knights of the Order",
            "DROIDS": "Robots",
            "Battle Starships": "Warships",
            "Command Starship": "Flagship"
        }
    },
    {
        "message_id": 1062,
        "passage": "KI-ADI-MUNDI and teh surviving JEDI fight their way through the corridors of the Command Ship, deflecting laser bolts, slicing DROIDS.",
        "dictionary": {
            "JEDI": "Knights of the Force",
            "DROIDS": "Robots"
        }
    },
    {
        "message_id": 1063,
        "passage": "THEY burst onto the bridge and chop down the COMMAND DROIDS. The NEIMOIDIANS flee in all directions. KE-ADI-MUNDI leans over the control panel. He locates the illuminated master switch and punches down on it. It goes dark. Instantly, all the DROIDS on the Starship and all the DROIDS in the arena FREEZE!\n\nThere is a moment of stunned silence, then the JEDI CHEER. One the bridge, PLO KOON claps KI-ADI-MUNDI on the back.\n\n\t\t\t\tPLO KOON\n\t\t\tWe've done it! Now we have a\n\t\t\tchance!\n\nSuddenly, there is a harsh BEEPING SOUND. All the DROIDS on the Starship and all the DROIDS in the arena start fighting again! KI-ADI-MUNDI stares in disbelief and dismay.\n\n\t\t\t\tKI-ADI-MUNDI\n\t\t\tThe system's off but they're still\n\t\t\tactive. That's a new feature. They\n\t\t\tare independent of the control\n\t\t\tsystem.",
        "dictionary": {
            "NEIMOIDIANS": "Alien Engineers",
            "JEDI": "Peacekeepers",
            "DROIDS": "Robots",
            "KI-ADI-MUNDI": "No alternative expression found (name unique to Star Wars)",
            "PLO KOON": "No alternative expression found (name unique to Star Wars)"
        }
    },
    {
        "message_id": 1064,
        "passage": "MACE WINDU, OBI-WAN, ANAKIN, PADME and an exhausted group of about TWENTY JEDI stand in the center of the arena surrounded by a ring of BATTLE DROIDS. The bloodied sand around them is strewn with the bodies of DEAD GEONOSIANS, SHATTERED DROIDS and JEDI.\n\nAt the foot of some steps, BOBA FETT finds his father's battered helmet. He picks it up.\n\nKI-ADI-MUNDI and the SURVIVORS from the raiding party are herded into the arena by SUPERDROIDS. From the encircling tiers above, THOUSANDS OF BATTLE DROIDS level their weapons menacingly.\n\nIn the archducal box, COUNT DOOKU lifts his hand. The DROIDS lower their weapons. The COUNT calls out to the JEDI.\n\n\t\t\t\tCOUNT DOOKU\n\t\t\tMaster Windu!\n\nSilence.\n\n\t\t\t\tCOUNT DOOKU\n\t\t\t\t(continuing)\n\t\t\tYou have fought gallantly. Worthy\n\t\t\tof recognition in the history\n\t\t\tarchives of the Jedi Order. Now\n\t\t\tit is finished.\n\t\t\t\t(pauses briefly)\n\t\t\tSurrender - and your lives will be \n\t\t\tspared.\n\n\t\t\t\tMACE WINDU\n\t\t\tWe will not be hostages for you to\n\t\t\tbarter with Dooku.\n\n\t\t\t\tCOUNT DOOKU\n\t\t\tThen, I'm sorry, old friend. You\n\t\t\twill have to be destroyed.\n\nThe DROIDS raise their weapons. ANAKIN and PADME clasps hands tightly. COUNT DOOKU raises his hand to give the order to fire. PADME looks up suddenlt and whispers to ANAKIN.\n\n\t\t\t\tPADME\n\t\t\tLook!\n\nAbove, six Gunships are descending fast through the open area in the arena ceiling. They land in a cluster around the handful of JEDI. CLONE TROOPERS spill out and start firing at the DROIDS. There is a hellstorm of laserfire that bounces off the laser shields created by the Gunships. YODA appears at the door of one of the Gunships.\n\n\t\t\t\tYODA\n\t\t\tCome on - hurry! Hurry!\n\nThe SURVIVING JEDI dash to the Gunships and scramble in. MACE WINDU hangs on tight as the Gunship, firing all its weapons, rises out of the arena up and over the topmost rim.",
        "dictionary": {
            "JEDI": "Knights of the Force",
            "BATTLE DROIDS": "War Drones",
            "GEONOSIANS": "Alien Warriors",
            "SUPERDROIDS": "Elite Drones",
            "COUNT DOOKU": "Baron Vex",
            "KI-ADI-MUNDI": "Survivor",
            "CLONE TROOPERS": "Reconnaissance Soldiers",
            "GUNSHIPS": "Assault Vessels",
            "YODA": "The Wise One"
        }
    },
    {
        "message_id": 1065,
        "passage": "The massed lines of parked Federation Starships and the DROIDS surrounding the arena, are themselves surrounded by thousands of Republic Starships, disgorging TENS OF THOUSANDS OF CLONE TROOPERS. Beyond, more Republic Starships are landing and spewing out troops.",
        "dictionary": {
            "Federation": "Alliance",
            "DROIDS": "Robots",
            "TENS OF THOUSANDS OF CLONE TROOPERS": "Thousands of Soldiers"
        }
    },
    {
        "message_id": 1066,
        "passage": "MACE WINDU stares at the incredible sight.\n\n\t\t\t\tYODA\n\t\t\tMore battalions to the left.\n\t\t\tEncircle them we must, then\n\t\t\tdivide.\n\nThe CLONE TROOPERS open fire with artillery. EXPLOSIONS wreck the parked Battle Starships. CLONE TROOPERS advance, firing at the massed DROIDS. FIGHTER DROIDS fly overhead, exchanging fire with the Gunships and JEDI fighters.",
        "dictionary": {
            "MACE WINDU": "General Commander",
            "YODA": "Senior Officer",
            "CLONE TROOPERS": "Elite Soldiers",
            "Battle Starships": "War Vessels",
            "DROIDS": "Mechanical Warriors",
            "FIGHTER DROIDS": "Combat Drones",
            "Gunships": "Heavy Artillery"
        }
    },
    {
        "message_id": 1067,
        "passage": "THREEPIO and ARTOO see flashes outside of the ship, exploding everywhere.\n\n\t\t\t\tC-3PO\n\t\t\tI'm sure I heard something, this\n\t\t\ttime. Didn't you? It's probably\n\t\t\tjust a celebration\n\nARTOO lets out an EXHAUSTED BLEEP.",
        "dictionary": {
            "BLEEP": "Sigh",
            "THREEPIO": "Protocol Droid",
            "ARTOO": "Astro-Mech Droid"
        }
    },
    {
        "message_id": 1068,
        "passage": "Gunship #2 skims the battlefield, firing down, deflecting answering fire from the droids.",
        "dictionary": {
            "Gunship": "Attack Helicopter"
        }
    },
    {
        "message_id": 1069,
        "passage": "OBI-WAN, ANAKIN and PADME are at the open sides of the Gunship. CLONES fire down at the DROIDS below.\n\nThe Gunship slows, circling over a droid gun-emplacement. It blasts it, but suddenly the Gunship is rocked by a near miss. It lurches violently.\n\n\t\t\t\tOBI-WAN\n\t\t\tHold on! Look over there...\n\nThrough the other side of the Gunship, they see a Geonosian Speeder racing past. In the open cockpit is the unmistakable figure of COUNT DOOKU.\n\n\t\t\t\tANAKIN\n\t\t\tIt's Dooku, go after him!\n\nThe PILOT starts to comply, but... there is a HUGE BLASTS, the ship lurches on its side, and PADME tumbles out.\n\n\t\t\t\tANAKIN\n\t\t\t\t(continuing)\n\t\t\tPadme!!!\n\nANAKIN stares down in horror as PADME hits thr ground below.\n\n\t\t\t\tANAKIN\n\t\t\t\t(continuing; to pilot)\n\t\t\tPut the ship down! Down!\n\n\t\t\t\tOBI-WAN\n\t\t\tNo! Forget her. We have to go\n\t\t\tafter Dooku.\n\n\t\t\t\tANAKIN\n\t\t\tNo we're not!! Land this ship!\n\n\t\t\t\tOBI-WAN\n\t\t\tDon't let your personal feelings\n\t\t\tget in the way. We've got a job to\n\t\t\tdo.\n\nBelow, PADME hauls herself to her feet and waves for them to go after DOOKU.\n\n\t\t\t\tANAKIN\n\t\t\tI don't care!.. Go back.\n\n\t\t\t\tOBI-WAN\n\t\t\tAnakin! She's all right! Look.\n\nANAKIN stares out to see PADME rescued by CLONE TROOPERS.\n\n\t\t\t\tOBI-WAN\n\t\t\t\t(continuing)\n\t\t\tFollow that speeder!\n\nOn the ground, PADME looks up at Gunship #2 as it speeds away after Count Dooku. OBI-WAN and ANAKIN follow the speeder to a Geonosian tower. The speeder decsends rapidly; the Gunship follows.\n\nCount Dooku's speeder parks outside the tower; the Gunship parks next to it. OBI-WAN and ANAKIN leap down and run inside the tower.",
        "dictionary": {
            "DROIDS": "Robots",
            "Geonosian": "Alien",
            "CLONES": "Soldiers",
            "Gunship": "Combat Helicopter",
            "COUNT DOOKU": "Lord",
            "PILOT": "Co-Pilot",
            "HUGE BLASTS": "Explosions",
            "Geonosian Speeder": "Alien Vehicle",
            "PADME": "Princess",
            "OBI-WAN": "Jedi",
            "ANAKIN": "Knight",
            "CLONE TROOPERS": "Soldiers",
            "Gunship #2": "Combat Helicopter"
        }
    }
]