[
    {
        "message_id": 240,
        "passage": "There is a large bonfire of Jawa bodies blazing in front of\n     the Sandcrawler as Ben and the robots finish burning the\n     dead. Luke drives up in the speeder and Ben walks over to\n     him.\n\n                         BEN\n               There's nothing you could have\n               done, Luke, had you been there.\n               You'd have been killed, too, and\n               the droids would be in the hands of\n               the Empire.\n\n                           LUKE\n               I want to   come with you to\n               Alderaan.   There's nothing here for\n               me now. I   want to learn the ways of\n               the Force   and become a Jedi like my\n               father.\n\n54",
        "dictionary": {
            "Jawa": "Desert Nomad",
            "Sandcrawler": "Dune Mover"
        }
    },
    {
        "message_id": 241,
        "passage": "The Landspeeder with Luke, Artoo, Threepio, and Ben in it\n     zooms across the desert. The speeder stops on a bluff\n     overlooking the spaceport at Mos Eisley. It is a haphazard\n     array of low, grey, concrete structures and semi-domes. A\n     harsh gale blows across the stark canyon floor. Luke adjusts\n     his goggles and walks to the edge of the craggy bluff where\n     Ben is standing.\n\n                         BEN\n               Mos Eisley Spaceport. You will\n               never find a more wretched hive of\n               scum and villainy. We must be\n               cautious.\n\n     Ben looks over at Luke, who gives the old Jedi a determined\n     smile.\n\n55",
        "dictionary": {
            "Mos Eisley": "Seedy Spaceport",
            "scum and villainy": "ruthless and corrupt individuals"
        }
    },
    {
        "message_id": 242,
        "passage": "The speeder is stopped on a crowded street by several combat-\n     hardend stormtroopers who look over the two robots. A\n     Trooper questions Luke.\n\n                         TROOPER\n               How long have you had these droids?\n\n                         LUKE\n               About three or four seasons.\n\n                         BEN\n               They're for sale if you want them.\n\n                         TROOPER\n               Let me see your identification.\n\n     Luke becomes very nervous as he fumbles to find his ID while\n     Ben speaks to the Trooper in a very controlled voice.\n\n                         BEN\n               You don't need to see his\n               identification.\n\n                         TROOPER\n               We don't need to see his\n               identification.\n\n                         BEN\n               These are not the droids your\n               looking for.\n\n                         TROOPER\n               These are not the droids we're\n               looking for.\n\n                         BEN\n               He can go about his business.\n\n                         TROOPER\n               You can go about your business.\n\n                         BEN\n                   (to Luke)\n               Move along.\n\n                         TROOPER\n               Move along. Move along.\n\n56",
        "dictionary": {
            "stormtroopers": "armored soldiers",
            "Trooper": "soldier",
            "droids": "robots",
            "identification": "papers",
            "Ben": "older man",
            "These are not the droids you're looking for": "These are not what you're searching for",
            "Move along": "Keep moving"
        }
    },
    {
        "message_id": 243,
        "passage": "The speeder pulls up in front of a rundown blockhouse\n     cantina on the outskirts of the spaceport. Various strange\n     forms of transport, including several unusual beasts of\n     burden, are parked outside the bar. A Jawa runs up and\n     begins to fondle the speeder.\n\n                         THREEPIO\n               I can't abide these Jawas.\n               Disgusting creatures.\n\n     As Luke gets out of the speeder he tries to shoo the Jawa\n     away.\n\n                         LUKE\n               Go on, go on. I can't understand\n               how we got by those troopers. I\n               thought we were dead.\n\n                         BEN\n               The Force can have a strong\n               influence on the weak-minded. You\n               will find it a powerful ally.\n\n                         LUKE\n               Do you really think we're going to\n               find a pilot here that'll take us\n               to Alderaan?\n\n                         BEN\n               Well, most of the best freighter\n               pilots can be found here. Only\n               watch your step. This place can be\n               a little rough.\n\n                         LUKE\n               I'm ready for anything.\n\n                         THREEPIO\n               Come along, Artoo.\n\n57",
        "dictionary": {
            "Jawa": "nomadic trader",
            "Alderaan": "Distant Planet"
        }
    },
    {
        "message_id": 244,
        "passage": "The young adventurer and his two mechanical servants follow\n     Ben Kenobi into the smoke-filled cantina. The murky, moldy\n     den is filled with a startling array of weird and exotic\n     alien creatures and monsters at the long metallic bar. At\n     first the sight is horrifying. One-eyed, thousand-eyed,\n     slimy, furry, scaly, tentacled, and clawed creatures huddle\n     over drinks. Ben moves to an empty spot at the bar near a\n     group of repulsive but human scum. A huge, rough-looking\n     Bartender stops Luke and the robots.\n\n                         BARTENDER\n               We don't serve their kind here!\n\n     Luke still recovering from the shock of seeing so many\n     outlandish creatures, doesn't quite catch the bartender's\n     drift.\n\n                         LUKE\n               What?\n\n                    BARTENDER\n          Your droids. They'll have to wait\n          outside. We don't want them here.\n\nLuke looks at old Ben, who is busy talking to one of the\nGalactic pirates. He notices several of the gruesome\ncreatures along the bar are giving him a very unfriendly\nglare.\n\nLuke pats Threepio on the shoulder.\n\n                    LUKE\n          Listen, why don't you wait out by\n          the speeder. We don't want any\n          trouble.\n\n                    THREEPIO\n          I heartily agree with you sir.\n\nThreepio and his stubby partner go outside and most of the\ncreatures at the bar go back to their drinks.\n\nBen is standing next to Chewbacca, an eight-foot-tall savage-\nlooking creature resembling a huge grey bushbaby monkey with\nfierce baboon-like fangs. His large blue eyes dominate a fur-\ncovered face and soften his otherwise awesome appearance.\nOver his matted, furry body he wears two chrome bandoliers,\nand little else. He is a two-hundred-year-old Wookiee and a\nsight to behold.\n\nBen speaks to the Wookiee, pointing to Luke several times\nduring his conversation and the huge creature suddenly lets\nout a horrifying laugh. Luke is more than a little bit\ndisconcerted and pretends not to hear the conversation\nbetween Ben and the giant Wookiee.\n\nLuke is terrified but tries not to show it. He quietly sips\nhis drink, looking over the crowd for a more sympathetic ear\nor whatever.\n\nA large, multiple-eyed Creature gives Luke a rough shove.\n\n                    CREATURE\n          Negola dewaghi wooldugger?!?\n\nThe hideous freak is obviously drunk. Luke tries to ignore\nthe creature and turns back on his drink. A short, grubby\nHuman and an even smaller rodent-like beast join the\nbelligerent monstrosity.\n\n                    HUMAN\n          He doesn't like you.\n\n                       LUKE\n          I'm sorry.\n\n                    HUMAN\n          I don't like you either.\n\nThe big creature is getting agitated and yells out some\nunintelligible gibberish at the now rather nervous, young\nadventurer.\n\n                    HUMAN (CONT’D)\n          Don't insult us. You just watch\n          yourself. We're wanted men. I have\n          the death sentence in twelve\n          systems.\n\n                    LUKE\n          I'll be careful than.\n\n                    HUMAN\n          You'll be dead.\n\nThe rodent lets out a loud grunt and everything at the bar\nmoves away. Luke tries to remain cool but it isn't easy. His\nthree adversaries ready their weapons. Old Ben moves in\nbehind Luke.\n\n                    BEN\n          This little one isn't worth the\n          effort. Come let me buy you\n          something...\n\nA powerful blow from the unpleasant creature sends the young\nwould-be Jedi sailing across the room, crashing through\ntables and breaking a large jug filled with a foul-looking\nliquid. With a blood curdling shriek, the monster draws a\nwicked chrome laser pistol from his belt and levels it at\nold Ben. The bartender panics.\n\n                    BARTENDER\n          No blasters! No blaster!\n\nWith astounding agility old Ben's laser sword sparks to life\nand in a flash an arm lies on the floor. The rodent is cut\nin two and the giant multiple-eyed creature lies doubled,\ncut from chin to groin. Ben carefully and precisely turns\noff his laser sword and replaces it on his utility belt.\nLuke, shaking and totally amazed at the old man's abilities,\nattempts to stand. The entire fight has lasted only a matter\nof seconds. The cantina goes back to normal, although Ben is\ngiven a respectable amount of room at the bar. Luke, rubbing\nhis bruised head, approaches the old man with new awe. Ben\npoints the the Wookiee.\n\n                         BEN\n               This is Chewbacca. He's first-mate\n               on a ship that might suit our\n               needs.\n\n58",
        "dictionary": {
            "Ben Kenobi": "Old Man",
            "Threepio": "Robot",
            "Galactic pirates": "Space smugglers",
            "Wookiee": "Furry giant",
            "Laser sword": "Energy blade",
            "Chewbacca": "Furry companion",
            "Cantina": "Alien tavern"
        }
    },
    {
        "message_id": 245,
        "passage": "Threepio paces in front of the cantina as Artoo carries on\n     an electronic conversation with another little red astro-\n     droid. A creature comes out of the cantina and approaches\n     two stormtroopers in the street.\n\n                         THREEPIO\n               I don't like the look of this.\n\n59",
        "dictionary": {
            "Threepio": "Mechanic",
            "Artoo": "Robot",
            "astro-droid": "space robot",
            "stormtroopers": "armored soldiers"
        }
    },
    {
        "message_id": 246,
        "passage": "Strange creatures play exotic big band music on odd-looking\n     instruments as Luke, still giddy, downs a fresh drink and\n     follows Ben and Chewbacca to a booth where Han Solo is\n     sitting. Han is a tough, roguish starpilot about thirty\n     years old. A mercenary on a starship, he is simple,\n     sentimental, and cocksure.\n\n                         HAN\n               Han Solo. I'm captain of the\n               Millennium Falcon. Chewie here\n               tells me you're looking for passage\n               to the Alderaan system.\n\n                         BEN\n               Yes, indeed. If it's a fast ship.\n\n                         HAN\n               Fast ship? You've never heard of\n               the Millennium Falcon?\n\n                         BEN\n               Should I have?\n\n                         HAN\n               It's the ship that made the Kessel\n               run in less than twelve parsecs!\n\n     Ben reacts to Solo's stupid attempt to impress them with\n     obvious misinformation.\n\n                         HAN (CONT’D)\n               I've outrun Imperial starships, not\n               the local bulk-cruisers, mind you.\n               I'm talking about the big Corellian\n               ships now. She's fast enough for\n               you, old man. What's the cargo?\n\n                    BEN\n          Only passengers. Myself, the boy,\n          two droids, and no questions asked.\n\n                    HAN\n          What is it? Some kind of local\n          trouble?\n\n                    BEN\n          Let's just say we'd like to avoid\n          any Imperial entanglements.\n\n                    HAN\n          Well, that's the trick, isn't it?\n          And it's going to cost you\n          something extra. Ten thousand in\n          advance.\n\n                    LUKE\n          Ten thousand? We could almost buy\n          our own ship for that!\n\n                    HAN\n          But who's going to fly it, kid!\n          You?\n\n                    LUKE\n          You bet I could. I'm not such a bad\n          pilot myself! We don't have to sit\n          here and listen...\n\n                    BEN\n          We haven't that much with us. But\n          we could pay you two thousand now,\n          plus fifteen when we reach\n          Alderaan.\n\n                    HAN\n          Seventeen, huh!\n\nHan ponders this for a few moments.\n\n                    HAN (CONT’D)\n          Okay. You guys got yourself a ship.\n          We'll leave as soon as you're\n          ready. Docking bay Ninety-four.\n\n                    BEN\n          Ninety-four.\n\n                    HAN\n          Looks like somebody's beginning to\n          take an interest in your handiwork.\n\n     Ben and Luke turn around to see four Imperial stormtroopers\n     looking at the dead bodies and asking the bartenders some\n     questions. The bartender points to the booth.\n\n                         TROOPER\n               All right, we'll check it out.\n\n     The stormtroopers look over at the booth but Luke and Ben\n     are gone. The bartender shrugs his shoulders in puzzlement.\n\n                         HAN\n               Seventeen thousand! Those guys must\n               really be desperate. This could\n               really save my neck. Get back to\n               the ship and get her ready.\n\n60",
        "dictionary": {
            "Millennium Falcon": "Fastest Ship in the Galaxy",
            "Kessel run": "Fastest Run in the Galaxy",
            "parsecs": "light-years",
            "Corellian ships": "Galactic Cruisers",
            "Imperial entanglements": "Government Involvement",
            "Alderaan system": "Galactic Coordinates",
            "Starpilot": "Space Captain"
        }
    },
    {
        "message_id": 247,
        "passage": "BEN\n               You'll have to sell your speeder.\n\n                         LUKE\n               That's okay. I'm never coming back\n               to this planet again.\n\n61",
        "dictionary": {
            "speeder": "car",
            "Ben": "Grandfather"
        }
    },
    {
        "message_id": 248,
        "passage": "As Han is about to leave, Greedo, a slimy green-faced alien\n     with a short trunk-nose, pokes a gun in his side. The\n     creature speaks in a foreign tongue translated into English\n     subtitles.\n\n                         GREEDO\n               Going somewhere, Solo?\n\n                         HAN\n               Yes, Greedo. As a matter of fact, I\n               was just going to see your boss.\n               Tell Jabba that I've got his money.\n\n     Han sits down and the alien sits across from him holding the\n     gun on him.\n\n                         GREEDO\n               It's too late. You should have paid\n               him when you had the chance.\n               Jabba's put a price on your head,\n               so large that every bounty hunter\n               in the galaxy will be looking for\n               you. I'm lucky I found you first.\n\n                         HAN\n               Yeah, but this time I got the\n               money.\n\n                            GREEDO\n                  If you give it to me, I might\n                  forget I found you.\n\n                            HAN\n                  I don't have it with me. Tell\n                  Jabba...\n\n                            GREEDO\n                  Jabba's through with you. He has no\n                  time for smugglers who drop their\n                  shipments at the first sign of an\n                  Imperial cruiser.\n\n                            HAN\n                  Even I get boarded sometimes. Do\n                  you think I had a choice?\n\n     Han Solo slowly reaches for his gun under the table.\n\n                            GREEDO\n                  You can tell that to Jabba. He may\n                  only take your ship.\n\n                            HAN\n                  Over my dead body.\n\n                            GREEDO\n                  That's the idea. I've been looking\n                  forward to killing you for a long\n                  time.\n\n                            HAN\n                  Yes, I'll bet you have.\n\n     Suddenly the slimy alien disappears in a blinding flash of\n     light. Han pulls his smoking gun from beneath the table as\n     the other patron look on in bemused amazement. Han gets up\n     and starts out of the cantina, flipping the bartender some\n     coins as he leaves.\n\n                            HAN (CONT’D)\n                  Sorry about the mess.\n\n62",
        "dictionary": {
            "Jabba": "The crime lord",
            "bounty hunter": "mercenary",
            "Imperial cruiser": "space patrol",
            "smugglers": "traffickers",
            "cantina": "tavern"
        }
    },
    {
        "message_id": 249,
        "passage": "Several TIE fighters approach the Death Star.\n\n63",
        "dictionary": {
            "TIE": "Fighter Jet",
            "Death Star": "Space Station"
        }
    }
]