[
    {
        "message_id": 1410,
        "passage": "He gets in one, the hatch closes, and the escape pod blasts away from the damaged Cruiser. \n\n67",
        "dictionary": {
            "Cruiser": "Warship"
        }
    },
    {
        "message_id": 1411,
        "passage": "OBI-WAN and ANAKIN go over to the navigator's chair. \n\nANAKIN: All the escape pods have been launched. \n\nOBI-WAN: Grievous. Can you fly a cruiser like this? \n\nANAKIN: You mean, do I know how to land what's left of this thing? \n\nANAKIN sits in the pilot's chair and sees on a screen the back half of the ship break away. There is a great jolt, and the ship tilts forward. \n\nOBI-WAN: Well? \n\nANAKIN: Under the circumstances, I'd say the ability to pilot this thing is irrelevant. Strap yourselves in. \n\nOBI-WAN and PALPATINE strap themselves into chairs. ANAKIN struggles with the controls of the ship. The ship starts to glow, and pieces break off. ARTOO moves in on Palpatine 's controls and assists in flying the cruiser. \n\nOBI-WAN: Steady . . . Attitude . . . eighteen degrees. \n\nARTOO beeps. \n\nANAKIN: Pressure rising. We've got to slow this wreck down. Open all hatches, extend all flaps, and drag fins. \n\nOBI-WAN: Temp steady. Hatches open, flaps extended, drag fins . . . \n\nA large part of the ship breaks away. \n\nANAKIN: We lost something. \n\nOBI-WAN: Not to worry, we're still flying half the ship. \n\nANAKIN: Now we're really picking up speed . . . I'm going to shift a few degrees and see if I can slow us down. \n\nOBI-WAN: Careful . . . we're heating up-twelve thousand . . . thirteen thousand . . . \n\nANAKIN: What's our speed? \n\nOBI-WAN: Eight plus sixty-forty. Eight plus sixty-twenty. Eight plus sixty. Temp ten thousand, nine thousand . . . we're in the atmosphere . . . \n\nANAKIN points to one of the controls. ARTOO beeps madly. \n\nANAKIN: Grab that . . . Keep us level. \n\nOBI-WAN: Steady. Steady. \n\nANAKIN: Easy, Artoo. Hang on, this may get a little rough. We lost our heat shields. \n\nOBI-WAN: Five thousand. Three thousand . . . two thousand. Fireships on the left and the right. \n\nFlRESHIP PILOT: We'll take you in. \n\nOBI-WAN: Copy that. Landing strip's straight ahead. \n\nANAKIN: We're coming in too hot. \n\nOBI-WAN: Easy-easy. \n\nThe ship leaves a contrail as it streaks across the Coruscant skyline. PALPATINE and OBI-WAN hold on for dear life as the ship shakes and rattles toward an industrial landing platform. \n\n68",
        "dictionary": {
            "OBI-WAN": "Captain",
            "ANAKIN": "Pilot",
            "ARTOO": "Co-pilot",
            "PALPATINE": "Passenger",
            "Coruscant": "City Planet"
        }
    },
    {
        "message_id": 1412,
        "passage": "A large landing platform in the industrial part of the city is surrounded by Emergency Fire Speeders. The smoking ship approaches as five Fireships spray it with foam. The ship finally makes a rather hard landing. \n\nOBI-WAN: Another happy landing. \n\n69",
        "dictionary": {
            "Emergency Fire Speeders": "Emergency Response Vehicles",
            "Fireships": "Fireboats"
        }
    },
    {
        "message_id": 1413,
        "passage": "The small Jedi Shuttle carrying PALPATINE and the JEDI arrives at the landing platform. There are a DOZEN SENATORS, including BAIL ORGANA, JAR JAR BINKS, and C-3PO, waiting for them. PALPATINE, R2-D2, and ANAKIN get out. OBI-WAN and MACE stay in the doorway of the Jedi Shuttle. \n\nANAKIN: (to Obi-Wan) Are you coming, Master? \n\nOBI-WAN: Oh no. I'm not brave enough for politics. I have to report to the Council. Besides, someone needs to be the poster boy. \n\nANAKIN: Hold on, this whole operation was your idea. You planned it. You led the rescue operation. You have to be the one to take the bows this time. \n\nOBI-WAN: Sorry, old friend. Let us not forget that you rescued me from the Buzz Droids. And you killed Count Dooku. And you rescued the Chancellor, carrying me unconscious on your back, and you managed to land that bucket of bolts safely . . . \n\nANAKIN: All because of your training, Master. You deserve all those speeches of your greatness. \n\nOBI-WAN: . . . the endless speeches . . . Anakin, let's be fair. Today, you are the hero and you deserve your glorious day with the politicians. \n\nANAKIN: All right. But you owe me . . . and not for saving your skin for the tenth time . . . \n\nOBI-WAN: Ninth time . . . that business on Cato Nemoidia doesn't count. I'll see you at the briefing. \n\nANAKIN smiles and walks away from OBI-WAN. \nThe CHANCELLOR and his entourage approach MACE. \n\nMACE WlNDU: Chancellor Palpatine, what a welcome sight! Are you all right? \n\nPALPATINE: Yes, thanks to your two Jedi Knights. They killed Count Dooku, but General Grievous has escaped once again. \n\nMACE WlNDU: General Grievous will run and hide as he always does. He is a coward. \n\nPALPATINE: That maybe true, but with Count Dooku dead, he is the leader of the Droid Army, and I assure you, the Senate will vote to continue the war as long as Grievous is alive. \n\nMACE WlNDU: Then the Jedi Council will make finding Grievous our highest priority. \n\nBAIL, ANAKIN, and the crowd walk away from the platform toward the Senate Building Grand Hallway. \n\nBAIL ORGANA: Skywalker, the Republic cannot praise you enough. \n\nANAKIN and BAIL ORGANA, walking in the hallway. \n\nANAKIN: Thank you, Senator Organa. The kidnapping was a bold move by the Separatists, but it was a mistake that Obi-Wan and I were able to take advantage of. \n\nARTOO and THREEPIO follow behind the crowd. \n\nC-3PO: It couldn't possibly be as bad as all that. \n\nARTOO beeps. \n\nC-3PO: (continuing) Well, there, I agree with you. In fact, I could do with a tune-up myself. \n\n70",
        "dictionary": {
            "JEDI": "Guardians of Peace",
            "PALPATINE": "Supreme Leader",
            "DOZEN": "Group of Twelve",
            "SENATORS": "Elected Representatives",
            "BAIL ORGANA": "Senator",
            "JAR JAR BINKS": "Ambassador",
            "C-3PO": "Translator Droid",
            "R2-D2": "Astro-Mech Droid",
            "ANAKIN": "Young Padawan",
            "OBI-WAN": "Wise Mentor",
            "MACE WlNDU": "Senior Jedi Knight",
            "SENATE": "Legislative Assembly",
            "SEPARATISTS": "Rebel Alliance",
            "ARTOO": "Loyal Companion"
        }
    },
    {
        "message_id": 1414,
        "passage": "ANAKIN is at the back of the crowd of SENATORS, talking with BAIL ORGANA. R2-D2 and C-3PO scoot along ahead of them. \n\nBAIL ORGANA: The end of Count Dooku will surely bring an end to this war, and an end to the Chancellor's draconian security measures. \n\nANAKIN: I wish that were so, but the fighting is going to continue until General Grievous is spare parts . . . The Chancellor is very clear about that. \n\nBehind a row of large columns, a SHADOWY FIGURE follows the JEDI and the SENATOR. ANAKIN senses the figure. \n\nBAIL ORGANA: I'll do everything I can with the Senate. \n\nANAKIN: Excuse me. \n\nBAIL ORGANA: Certainly. \n\nANAKIN stops, and BAIL goes off after PALPATINE and the others. ANAKIN goes behind one of the giant columns to meet up with the SHADOWY FIGURE, who is revealed to be SENATOR PADME AMDALA. They embrace and kiss. \n\nPADME: Oh, Anakin! Thank goodness, you're back. \n\nANAKIN: I missed you, Padme. I've missed you so. \n\nPADME: There were whispers . . . that you'd been killed. I've been living with unbearable dread. \n\nANAKIN: I'm back, I'm all right. It feels like we've been apart for a lifetime. And it might have been ... If the Chancellor hadn't been kidnapped. I don't think they would have ever brought us back from the Outer Rim sieges. \n\nANAKIN starts to give her another kiss. She steps back. \n\nPADME: Wait, not here . . . \n\nHe grabs her again. \n\nANAKIN: Yes, here! I'm tired of all this deception. I don't care if they know we're married. \n\nPADME: Anakin, don't say things like that. You're important to the Republic ... to ending this war. I love you more than anything, but I won't let you give up your life as a Jedi for me . . . \n\nANAKIN: I've given my life to the Jedi order, but I'd only give up my life, for you. \n\nPADME: (playfully) I wouldn't like that. I wouldn't like that one bit. Patience, my handsome Jedi . . . Come to me later. \n\nANAKIN embraces her, then looks at her. \n\nANAKIN: Are you all right? You're trembling. What's going on? \n\nPADME: I'm just excited to see you. \n\nANAKIN: That's not it. I sense more . . . what is it? \n\nPADME: Nothing . . . nothing . . . \n\nANAKIN: You're frightened. (a little angry) Tell me what's going on! \n\nPADME begins to cry. \n\nPADME: You've been gone five months . . . it's been very hard for me. I've never felt so alone. There's . . . \n\nANAKIN: . . . Is there someone else? \n\nPADME: (peeved, angry) No! Why do you think that? Your jealousy upsets me so much, Anakin. I do nothing to betray you, yet you still don't trust me. Nothing has changed. \n\nANAKIN: (sheepish) I'm afraid of losing you, Padme . . . that's all. \n\nPADME: I will never stop loving you, Anakin. My only fear is losing you. \n\nANAKIN: It's just that I've never seen you like this . . . \n\nPADME: Something wonderful has happened. \n\nThey look at each other for a long moment. \n\nPADME: (continuing) I'm . . . Annie, I'm pregnant. \n\nANAKIN is stunned. He thinks through all of the ramifications of this. He takes her in his arms. \n\nANAKIN: That's . . . that's wonderful. \n\nPADME: What are we going to do? \n\nANAKIN: We're not going to worry about anything right now, all right? This is a happy moment. The happiest moment of my life. \n\n71",
        "dictionary": {
            "JEDI": "Knights",
            "SENATORS": "Government Officials",
            "SENATOR": "Politician",
            "COUNT DOOKU": "General",
            "GENERAL GRIEVOUS": "Warlord",
            "PALPATINE": "Leader",
            "OUTER RIM SIEGES": "Border Wars",
            "PADME AMDALA": "Senator's Wife"
        }
    },
    {
        "message_id": 1415,
        "passage": "A small NEIMOIDIAN SHUTTLE lands. BATTLE DROIDS surround the ramp as GENERAL GRIEVOUS descends onto the platform. SUPER BATTLE DROID G21 approaches. \n\nSUPER BATTLE DROID G21: The planet is secure, sir. The population is under control. \n\nGENERAL GRIEVOUS: Good. Where is the Separatist Council? \n\nSUPER BATTLE DROID G21: This way, sir ... \n\nGENERAL GRIEVOUS takes the elevator to an upper level. He enters a conference room and presses a series of buttons on the table, and bows. \n\n72",
        "dictionary": {
            "NEIMOIDIAN SHUTTLE": "Alien Transport",
            "BATTLE DROIDS": "War Drones",
            "GENERAL GRIEVOUS": "Military Commander",
            "SUPER BATTLE DROID G21": "Elite Combat Robot",
            "Separatist Council": "Rebel Leaders"
        }
    },
    {
        "message_id": 1416,
        "passage": "A hologram of Darth Sidious appears. \n\nGENERAL GRIEVOUS: Yes, Lord Sidious. \n\nDARTH SlDIOUS: General Grievous, I suggest you move the Separatist leaders to Mustafar. \n\nGENERAL GRIEVOUS: It will be done, My Lord. \n\nDARTH SlDIOUS: The end of the war is near, General, and I promise you, victory is assured. \n\nThe hologram of Sidious talks to GRIEVOUS about the death of Count Dooku. \n\nGENERAL GRIEVOUS: But the loss of Count Dooku? \n\nDARTH SlDIOUS: His death was a necessary loss, which will ensure our victory. Soon I will have a new apprentice . . . one far younger and more powerful than Lord Tyranus. \n\n73",
        "dictionary": {
            "Darth Sidious": "Supreme Leader",
            "Separatist leaders": "Rebel Commanders",
            "Mustafar": "The Inferno",
            "General Grievous": "Warlord",
            "Lord Sidious": "Supreme Commander",
            "My Lord": "Sir",
            "Count Dooku": "High Commander",
            "Lord Tyranus": "Vice Commander"
        }
    },
    {
        "message_id": 1417,
        "passage": "PADME stands in the balcony brushing her hair. ANAKIN leans against the wall, watching her lovingly. \n\nANAKIN: . . . every second I was thinking of you. Protecting the endless, nameless Outer Rim settlements became a torture . . . the battles were easy, the longing became unbearable . . . I've never been so happy as I am at this moment. \n\nPADME: Annie, I want to have our baby back home on Naboo. We could go to the lake country where no one would know . . . where we would be safe. I could go early-and fix up the baby's room. I know the perfect spot, right by the gardens. \n\nANAKIN: You are so beautiful! \n\nPADME: It's only because I'm so in love . . . \n\nANAKIN: No, it's because I'm so in love with you. \n\nPADME: So love has blinded you? \n\nANAKIN: Well, that's not exactly what I meant . . . \n\nPADME: But it's probably true! \n\nThey laugh. \n\nANAKIN: I haven't laughed in so long . . . \n\nPADME: Neither have I. \n\n74",
        "dictionary": {
            "Outer Rim": "Periphery",
            "Naboo": "Homeland",
            "Annie": "Honey",
            "Padmé": "Love"
        }
    },
    {
        "message_id": 1418,
        "passage": "The view is strangely distorted and disorienting. PADME is on a table in an alien medical chamber. She is giving birth and is screaming. \n\nPADME: Anakin, help me! Help, Anakin! Anakin, I love you. I love you. \n\nShe screams and dies. \n\n75",
        "dictionary": {
            "PADME": "The Queen",
            "Anakin": "The Jedi"
        }
    },
    {
        "message_id": 1419,
        "passage": "ANAKIN awakens in a panic. He is covered in sweat. He looks over in the bed and sees PADME sound asleep next to him. ANAKIN gets out from under the sheets and sits on the side of the bed. He is breathing heavily. He puts his head in his hands and weeps. He regains his composure and leaves the room down a set of stairs. PADME awakens, realizes Anakin is gone. \n\nPADME: Anakin?? \n\nShe gets out of bed and goes downstairs to look for him. \n\n76",
        "dictionary": {
            "ANAKIN": "Alex",
            "PADME": "Sarah"
        }
    }
]