[
    {
        "message_id": 1210,
        "passage": "A massive Star Destroyer hovers over the hacked ice planet.",
        "dictionary": {
            "Star Destroyer": "Giant Warship",
            "hacked": "taken over"
        }
    },
    {
        "message_id": 1211,
        "passage": "A dark space. Kylo Ren, CLOSE TO CAMERA, addresses someone\n          OFF-CAMERA whom we do not see.\n\n                          KYLO REN\n           Forgive me. I feel it again. The\n           pull to the light. Supreme Leader\n           senses it. Show me again, the power\n           of the darkness, and I will let\n           nothing stand in our way. Show me,\n           Grandfather, and I will finish what\n           you started.\n          As his emotion builds, he stands and heads off -- we FOLLOW\n          HIM, PIVOTING TO REVEAL who he was talking to: THE BURNT,\n\n          ASHEN, GHOSTLY DEFORMED MASK OF DARTH VADER.\n\n                          CUT TO:",
        "dictionary": {
            "Supreme Leader": "High Commander",
            "Grandfather": "Ancestor"
        }
    },
    {
        "message_id": 1212,
        "passage": "Maz is putting together some FOOD as she says:\n\n                          MAZ\n           A map to Skywalker himself? You're\n           right back in the mess.\n\n                          HAN\n           Maz, I need you to get this droid to\n           Leia.\n\n                         \n\n                          (CONTINUED)\n\n                         CONTINUED:\n\n                          MAZ\n           Hmm. No. You've been running away\n           from this fight for too long. Han,\n           nyakee nago wadda. Go home!\n\n                          HAN\n           Leia doesn't want to see me.\n\n                          FINN\n           Please, we came here for your help.\n\n                          REY\n           What fight?\n\n                          MAZ\n           The only fight: against the dark\n           side. Through the ages, I've seen\n           evil take many forms. The Sith.\n           The Empire. Today, it is the First\n           Order. Their shadow is spreading\n           across the galaxy. We must face\n           them. Fight them. All of us.\n\n                          FINN\n           There is no fight against the First\n           Order! Not one we can win. Look\n           around. There's no chance we haven't\n           been recognized already. I bet you\n           the First Order is on their way right--\n          Finn stops, seeing Maz adjusting her goggles, scrutinizing\n          him -- her eyes get HUGE.\n\n                          FINN (CONT'D)\n           What's this? What are you doing?\n          Maz adjusts the goggles again. Her eyes get impossibly\n          BIGGER. She grunts recognition. She hoists herself on the\n          tabletop, knocking over food and plates, crawling towards\n          Finn.\n\n                          FINN (CONT'D)\n           Solo, what is she doing?\n\n                          HAN\n           I don't know, but it ain't good.\n\n                          MAZ\n           If you live long enough you see the\n           same eyes in different people. I'm\n           looking at the eyes of a man who\n           wants to run.\n\n                          FINN\n           (eyes on Maz)\n           You don't know a thing about me.\n           Where I'm from. What I've seen.\n\n                          (MORE)\n\n                         \n\n                         \n\n                          (CONTINUED)\n\n                         CONTINUED:\n\n                          FINN (CONT'D)\n           You don't know the First Order like\n           I do. They'll slaughter us. We all\n           need to run.\n          Rey is stunned. Maz, not so much. She crawls back to her\n          chair. She points to some pirates in the corner.\n\n                          MAZ\n           You see those two? They'll trade\n           work for transportation to the Outer\n           Rim. There, you can disappear.\n          Finn sees them. Considers.\n\n                          REY\n           Finn!\n\n                          FINN\n           Come with me.\n\n                          REY\n           What about BB-8? We're not done\n           yet. We have to get him back to\n           your base.\n\n                          FINN\n           I can't.\n          Finn stands to leave. He offers the gun back to Han.\n\n                          HAN\n           Keep it, kid.\n          Finn heads off. Rey gets up to follow. Maz dials her lenses\n          back to normal, and turns to Han.\n\n                          MAZ\n           Who's the girl?\n\n                         ON FINN\n          Who has arrived at the table with the ALIEN SMUGGLERS.\n\n                          FINN\n           I was told you could get me to the\n           Outer Rim.\n          Rey barges into the conversation, interrupting.\n\n                          REY\n           What are you doing?\n          Finn gets up to talk to her.\n\n                          FINN\n           (to Big Head)\n           Don't leave without me.\n\n                         \n\n                         \n\n                          (CONTINUED)\n\n                         CONTINUED:\n          Embarrassed, Finn moves her away.\n\n                          REY\n           You can't just go. I won't let you.\n\n                          FINN\n           I'm not who you think I am.\n\n                          REY\n           Finn, what are you talking about?\n\n                          FINN\n           I'm not Resistance. I'm not a hero.\n           I'm a Stormtrooper.\n\n                          (STOPS HER)\n           Like all of them, I was taken from a\n           family I'll never know. And raised\n           to do one thing...\n\n                          (EMOTIONAL)\n           But my first battle, I made a choice.\n           I wasn't going to kill for them. So\n           I ran.\n\n                          FINN (CONT'D)\n           Right into you. And you looked at\n           me like no one ever had. I was\n           ashamed of what I was. But I'm done\n           with the First Order. I'm never\n           going back. Rey, come with me.\n\n                          REY\n           Don't go.\n\n                          FINN\n           Take care of yourself. Please.\n          Rey looks at him, crushed. With quiet resignation, Rey\n          watches Finn return to the aliens...\n          And all three head off. He gets to the front door and walks\n          through it.\n          Rey is heartsick, but she turns as she hears the sound of a\n          young girl in anguish, crying. She follows the sound into\n          the castle, turning so she can't see that Finn has looked\n          back at her one last time.",
        "dictionary": {
            "nyakee nago wadda": "Go home, it's time to leave",
            "ALIEN SMUGGLERS": "space smugglers"
        }
    },
    {
        "message_id": 1213,
        "passage": "Rey steps down into the basement corridor. BB-8 follows\n          her. Walking carefully and confused, she is not sure why\n          she's down here. She can hear the echoing sounds of a young\n          girl crying. She heads down the hall... to the very end,\n          where there is a door. It is almost as if a SOULFUL VIBRATION\n          draws her closer. She looks at the door lock -- AND THE\n\n          DOOR OPENS.\n          Hesitant, Rey enters.",
        "dictionary": {
            "SOULFUL VIBRATION": "Atmosphere of Peace",
            "BB-8": "Droid"
        }
    },
    {
        "message_id": 1214,
        "passage": "Rey moves into the dark, small, vaulted storage room. Old\n          treasures line the floors and walls, but there is something\n          specific Rey is drawn to: on a table, an old wooden BOX.\n          She moves to it, unsure, afraid, as if an energy from inside\n          the box has been calling her here. BB-8 nervously follows.\n          Rey reaches out, very slowly, to touch the box. A moment\n          heavy with tension.\n          Rey OPENS THE BOX and sees inside Luke Skywalker's original\n          lightsaber. With hesitation, she reaches towards it, but\n          she cannot resist. As her hand makes contact with it, there\n          is the piercing sound of a lightsaber igniting. She moves\n          her hand away, as REY HEARS A MECHANICAL BREATHING sound.\n          The CAMERA MOVES, LIGHTING CHANGES -- and we see behind her\n          something impossible: a HALLWAY OF FROM DEEP INSIDE CLOUD\n          CITY. Disembodied voices fill the air.\n\n                          YOUNG GIRL\n\n           NO!\n          She stands -- looks around, confused by all she sees and\n          hears. -- Turns and sees, through a DOORWAY.\n          We follow Rey and she runs down the corridor, but it all\n          TILTS -- TURNS -- and she lands on the\n          WALL -- which is now the GROUND -- dried GRASS.\n          She turns to look -- we PIVOT -- and see a BURNING TEMPLE AT\n          NIGHT. We PAN to:\n          R2-D2 -- who watches the flames -- and a MAN appears (LUKE,\n          whose face we do not see). He falls to his knees, reaches\n          out to the droid -- with a MECHANICAL RIGHT HAND.\n          We PUSH IN ON REY as RAIN BEGINS -- and DAY TURNS TO NIGHT --\n          and she LOOKS UP -- we TILT UP --\n          To see we're LOOKING UP AT A WARRIOR as he is STABBED BY A\n          FIERY LIGHTSABER! He screams and falls to the ground -- we\n          FOLLOW HIM, revealing Rey again, now in a nighttime\n          battlefield. She gets to her feet, frightened by what she\n          sees. We PIVOT AROUND HER to REVEAL KYLO REN, and the six\n          other KNIGHTS OF REN, who flank him!\n          Come back around to Rey, soaking now, as the RAIN STOPS and\n          SUNLIGHT illuminates her -- she turns to look -- we PIVOT --\n          and see...\n          A little girl. Rey as a child. She is sobbing, hysterical.\n          Unkar Plutt's meaty hand holds her thin arm. She is on Jakku,\n          watching a starship fly into the sky, abandoning her.\n\n                          YOUNG GIRL\n           No, come back!\n\n                         \n\n                         \n\n                          (CONTINUED)\n\n                         CONTINUED:\n\n                          UNKAR PLUTT\n           Quiet, girl!\n          The ship flies towards the desert sun, which is strangely\n          eclipsed, as if being eaten by darkness. Rey looks around\n          her to see she is..\n          In a NIGHTTIME, BARREN, SNOWY WOODS. She's losing her mind,\n          confounded and lost and she gets to her feet, her breath\n          seen in the frigid air -- and then: THE SOUND OF CLASHING\n          LIGHTSABERS! She moves through the woods, toward the sound.\n          Rey runs, heart pounding, when KYLO REN EMERGES FROM BEHIND\n          A TREE! She stops, SCREAMS, FALLS BACK and LANDS IN:",
        "dictionary": {
            "BOX": "Container",
            "lightsaber": "Energy Blade",
            "HALLWAY OF FROM DEEP INSIDE CLOUD CITY": "Asteroid Tunnel",
            "REY HEARS A MECHANICAL BREATHING sound": "She hears a strange humming noise",
            "CLOUD CITY": "Asteroid Base",
            "R2-D2": "Droid Companion",
            "LUKE, whose face we do not see": "A mysterious figure",
            "MECHANICAL RIGHT HAND": "Prosthetic Limb",
            "KNIGHTS OF REN": "Imperial Enforcers",
            "UNKAR PLUTT": "Tough Trader"
        }
    },
    {
        "message_id": 1215,
        "passage": "She falls back, out of the room, suddenly sitting in the\n          hall, out of breath, alarmed and perplexed.\n          She HEARS something and turns to look.\n          Maz stands at the end of the corridor, realizing what has\n          just happened.\n\n                          REY\n           What was that? I shouldn't have\n           gone in there.\n\n                          MAZ\n           That lightsaber was Luke's. And his\n           father's before him and now, it calls\n           to you!\n          Rey stands, fast. Still overwhelmed, emotional, speechless.\n\n                          REY\n           I have to get back to Jakku.\n\n                          MAZ\n           Han told me.\n           (reaches out, hold\n\n                          REY'S HAND)\n           Dear child. I see your eyes. You\n           already know the truth. Whomever\n           you're waiting for on Jakku, they're\n           never coming back. But... there's\n           someone who still could.\n\n                          REY\n           Luke.\n\n                          MAZ\n           The belonging you seek is not behind\n           you. It is ahead. I am no Jedi,\n           but I know the Force. It moves\n           through and surrounds every living\n           thing. Close your eyes. Feel it.\n\n                          (MORE)\n\n                         \n\n                          (CONTINUED)\n\n                         CONTINUED:\n\n                          MAZ (CONT'D)\n           The light. It's always been there.\n           It will guide you. The saber. Take\n           it.\n          Rey suddenly stands.\n\n                          REY\n           I'm never touching that again. I\n           don't want any part of this.\n          And Rey runs off, passing Maz.\n          Rey's mind is spinning -- she can't take it -- she turns and\n          heads off, fast. BB-8 follows her. TIGHT ON MAZ, watching\n          her go. Maz SIGHS, feeling for the young girl.",
        "dictionary": {
            "Jedi": "Warrior of the Force",
            "Force": "Energy Field"
        }
    },
    {
        "message_id": 1216,
        "passage": "Rey exits the castle, needs to run, but doesn't know where.\n          Heads toward the woods.",
        "dictionary": {
            "Rey": "Jade",
            "castle": "fortress"
        }
    },
    {
        "message_id": 1217,
        "passage": "Rey moves through the foliage, heart racing. Over this, we\n          HEAR a RUMBLING -- intense, an OMEN of something horrible to\n          come.",
        "dictionary": {
            "OMEN": "Sign of impending doom",
            "RUMBLING": "Thunderous noise"
        }
    },
    {
        "message_id": 1218,
        "passage": "A massive rally: a thousand STORMTROOPERS, TIE FIGHTERS,\n          OFFICERS and VEHICLES. BRUTALIST STRUCTURES, mountainous\n          SNOWY LANDSCAPE. Addressing them at a podium, flanked by\n          RED FIRST ORDER BANNERS, is HUX. His voice ECHOES:\n\n                          GENERAL HUX\n           Today is the end of the Republic!\n           The end of a regime that acquiesces\n           to disorder! At this very moment,\n           in a system far from here the New\n           Republic LIES to the GALAXY while\n           secretly supporting the treachery of\n           the loathsome Resistance. This fierce\n           machine which you have built, upon\n           which we stand, will bring an end to\n           the Senate! To their cherished fleet!\n           All remaining systems will bow to\n           the First Order! And will remember\n           this... as the last day of the\n           Republic!",
        "dictionary": {
            "STORMTROOPERS": "Elite Soldiers",
            "TIE FIGHTERS": "Spacecraft",
            "OFFICERS": "High-Ranking Officials",
            "VEHICLES": "Military Equipment",
            "BRUTALIST STRUCTURES": "Fortified Buildings",
            "SNOWY LANDSCAPE": "Frosty Environment",
            "RED FIRST ORDER BANNERS": "Symbolic Flags",
            "HUX": "Commander",
            "GALAXY": "Universe"
        }
    },
    {
        "message_id": 1219,
        "passage": "ENGINEERS perform FINAL FIRING PROTOCOL. There's a sense of\n          nervousness -- WILL THIS MASSIVE WEAPON ACTUALLY WORK?",
        "dictionary": {
            "FINAL FIRING PROTOCOL": "Final Launch Sequence",
            "WILL THIS MASSIVE WEAPON ACTUALLY WORK?": "Will This Device Function?"
        }
    }
]