[
    {
        "message_id": 1600,
        "passage": "Again, we are outside the cartoonish tree home of \n     Chewbacca's family. \n\n16.",
        "dictionary": {
            "Chewbacca's": "the Wookiee's",
            "Wookiee": "Canine"
        }
    },
    {
        "message_id": 1601,
        "passage": "Lumpy and Malla are in the kitchen finishing the dishes. \n     Lumpy gets done drying the dishes and hands the towel to \n     his mother. He then waves at her and leaves the kitchen. \n     Malla just shakes her head at him. She then turns on the\n     monitor above the counter to a cooking show. A strange\n     looking \"female\" cook, Chef Gormaanda, comes on.\n\n                           CHEF GORMAANDA\n               Hello...\n\n     Malla gives a greeting to the Chef Gormaanda.\n\n                           CHEF GORMAANDA\n               Today we are going to be preparing a very \n               succulent dish called \"Bantha Surprise.\" \n\n     Malla heads over to another counter and get a large pot. \n     She brings it over by the monitor.\n\n                           CHEF GORMAANDA\n               It's not only a very hearty, nourishing \n               dish, but it's very economical, too. So \n               all those hungry mouths in your household \n               will be going \"yummy yum for their tummy \n               tum.\" If you just follow along with me as \n               I prepare this popular favorite. \n\n     Chef Gormaanda picks up a hunk of meat off of her counter.\n\n                           CHEF GORMAANDA\n               Now, today I'm going to be using the \n               tenderest cut of the bantha: the loin. \n               The loin is very tasty and serves four \n               nicely. But, of course, if your family \n               has a hearty appetite, I would suggest \n               then that old popular holiday favorite: \n               The Bantha Rump.\n\n     Malla growls in agreement. Chef Gormaanda drops her meat onto \n     the counter with a plop.\n\n                           CHEF GORMAANDA\n               Um, very tender. Ah, we just slice into \n               bite-sized pieces.\n\n     Chef Gormaanda uses a small knife to slice up her's. Malla \n     (whose meat is already in front of her) uses a large \n     meat cleaver to \"slice\" hers.\n\n                           CHEF GORMAANDA\n               And only you know the size of a bite in \n               your family! \n\n     Chef Gormaanda points her knife at the camera and winks to\n     emphasize her point.\n\n                           CHEF GORMAANDA\n               Oh! Alright, now it's time to put our \n               chunks into our pots.\n\n     The two put their meat in the respective pots.\n\n                           CHEF GORMAANDA\n               Nicely... nicely... Add a dash of negavo. \n\n     Chef Gormaanda tastes every ingredient she names before putting \n     it in her pot.\n\n                           CHEF GORMAANDA\n               Umm, very good. A sprig of celentery. Umm, \n               umm, just a bit of turshum, always nice. \n               And, uh. Um! Turshum is nice! And, just a \n               little whisper of chelchum. Ah, looking \n               very nice.\n\n     Malla growls.\n\n                           CHEF GORMAANDA\n               Guess what I forgot? A bit of the \n               calarantrum root! Wonderful! Just adds \n               that touch of piquancy. There we go. \n               Very nice. Um! Now we add enough liquid \n               to cover. \n\n     They both pour liquid into their pots.\n\n                           CHEF GORMAANDA\n               And guess what we're ready for now: the \n               cooking! Step one - we stir the mixture. \n               Stir, stir, stir, stir, stir, stir, stir, \n               stir, stir, stir, stir, very nice. \n\n     Chef Gormaanda stirs her mixture with every \"stir\" she says \n     with a spoon. Malla is stirring hers, too.\n\n                           CHEF GORMAANDA\n               Now, step two - while we're stirring, we \n               also whip. \n\n     Chef Gormaanda picks up a whip with her free hand. Malla follows\n     suit.\n\n                           CHEF GORMAANDA\n               So it's  stir, whip, stir, whip, whip, \n               whip, stir, stir, whip, stir, whip, whip, \n               whip, stir. Now, let's try it again \n               together at an increased tempo because \n               precision is very important in this \n               recipe and we do want a fine consistency, \n               don't we? So, and on the count of one - \n               stir, whip, stir, whip, whip, whip, stir, \n               stir, whip, stir, whip, whip, whip, stir. \n               Come on, faster altogether now. Cooking \n               can be fun. \n                    (faster)\n               Stir, whip, stir, whip, whip, whip, stir, \n               stir, whip, stir, whip, whip, whip, stir. \n               Wah! Having fun, having fun, alright. \n               Having it all nicely, now. Step three - \n               we also have to beat. \n\n     A \"third\" hand comes from behind Chef Gormaanda and picks up a\n     mallet. It places it in the pot.\n\n                           CHEF GORMAANDA\n               So it's: beat, beat, beat, stir, whip, \n               stir, whip, beat, beat, stir. That's not \n               right. I'm sorry. Stir, whip, stir, whip, \n               whip, whip, stir, beat, stir, whip, stir, \n               whip, whip, whip, stir, beat. A ha ha,ha \n               ha ha, huh huh huh, huh huh huh. Coming... \n               coming along nicely. Mmmm, starting to \n               have a fine aroma.\n\n     Chef Gormaanda starts to sneeze. A \"fourth\" hand appears from\n     behind the cook. The hand puts a finger to her nose to \n     stop the sneeze.\n\n                           CHEF GORMAANDA\n               Whew, caught it just in time. Now at this \n               time, I usually like to taste the broth. \n               So, we'll have a little taste and see how \n               it's coming along. \n\n     The fourth hand picks up a ladle and dips it in the pot \n     to get some broth. Chef Gormaanda tastes it. Malla just picks up \n     her whole pot and tastes it from there.\n\n                           CHEF GORMAANDA\n               Mmmm, a little bit more turshum. A bit \n               negavo. A little tunkell. One for the pot, \n               um! Coming along very nice. Mmm! Oh, \n               wonderful! Coming along nicely...\n\n     Malla gets frustrated with keeping up with Chef Gormaanda and \n     shuts off her monitor. She takes her pot and puts it on \n     the floor.\n\n17.",
        "dictionary": {
            "Bantha Surprise": "Exotic Stew",
            "Bantha Rump": "Holiday Roast",
            "negavo": "seasoning",
            "celentery": "celery",
            "turshum": "spices",
            "chelchum": "herbs",
            "calarantrum root": "special ingredient",
            "tunkell": "flavor enhancer"
        }
    },
    {
        "message_id": 1602,
        "passage": "Several TIE fighters are attacking the Falcon. The ships\n     exchange fire and one of the TIEs are destroyed.\n\n18.",
        "dictionary": {
            "TIE": "enemy fighter",
            "Falcon": "spaceship"
        }
    },
    {
        "message_id": 1603,
        "passage": "Chewie puts his arm around Han and growls. Han smiles at\n     Chewie in return. Chewie growls again as the cockpit is\n     rocked from laser blasts.\n\n                            HAN\n               Alright. Alright, the coordinates weren't \n               the best.\n\n     Chewie growls in agreement to Han's statement.\n\n                            HAN\n               Out of the frying pan into the fryer, huh \n               pal? How should I know we'd come outta \n               hyperspace into the middle of an Imperial \n               convoy. At least against these fighters \n               we got more of a chance. However slim...\n\n     Chewie growls something to Han.\n\n                            HAN \n               You can say that again. This is one Life \n               Day we won't soon forget. Wait, I lost \n               control of the remote cannons.\n\n     Chewie growls.\n\n                            HAN\n               I'm gonna hafta run back and operate the \n               aft gun manually. Stay on things here. \n               Why do I always think that taking you \n               home for Life Day's gonna be easy?\n\n     Chewie just growls back at Han.\n\n19.",
        "dictionary": {
            "Chewie": "the Wookiee",
            "Life Day": "Christmas",
            "Hyperspace": "deep space",
            "Imperial convoy": "enemy fleet"
        }
    },
    {
        "message_id": 1604,
        "passage": "Malla is standing near their shelves staring at the \n     picture of Chewie that she is holding. Itchy is sleeping \n     in a chair. A loud buzzer sounds and wakes him up. The \n     two look around in alarm, not knowing what it means. The \n     wall screen comes on and an Imperial Officer appears on \n     it.\n\n                            IMPERIAL OFFICER\n               Attention all viewers.\n\n     Malla and Itchy walk over to the screen to see what is the\n     problem.\n\n                            IMPERIAL OFFICER\n               Due to suspected Rebel activity on the \n               Kashyyyk planet, the Empire has declared \n               martial law. A blockade has been set up \n               around the planet. No ships will be \n               permitted to land or take off until \n               further notice.\n\n     A knock is heard at the door. Malla takes Lumpy towards \n     the kitchen and Itchy goes to answer the door. He growls \n     to see who is at the door.\n\n                            SAUNDAN\n                    (off screen)\n               It's me Saundan.\n\n     Itchy opens the door and lets him in. Saundan is carrying \n     a bag with a box in it in one hand and something that \n     looks like a \"boom box\" in the other. Both have bows on \n     them.\n\n                            SAUNDAN\n                    (on screen)\n               Hi, Itchy. I brought you that proton pack. \n               You know, for the, uh, the whatsis, the\n               whatchamalcalit, the, the thingamabob, \n               the mind evaporator. That's it, the mind\n               evaporator. Boy am I glad to see you \n               folks. How are my favorite wookiees today? \n               Why all the long hairy faces? I made it \n               through the Imperial patrol, didn't I? If \n               I made it, Chewie and Han will. Is this \n               all the big hello I get? \n\n     Lumpy runs up to him and gives him a hug. Saundan takes \n     the box out of the bag and hands it to Lumpy.\n\n                            SAUNDAN\n               I brought you somethin' special short \n               stuff. You want it? You got it. Happy Life \n               Day. I love to make a wookiee happy. \n\n     Lumpy takes the box and runs upstairs.\n\n                            SAUNDAN\n               And now, for the lovely lady of the house. \n\n     He picks up the \"boom box.\"\n\n                            SAUNDAN\n               Happy Life Day. \n\n     Malla starts to take the box from him but Saundan holds on \n     to it.\n\n                            SAUNDAN\n               Now wait a, wait a minute, not so fast.\n               What does an old friend get? Well? \n\n     Malla gives him a kiss on the cheek and he gives her the \n     box.\n\n                            SAUNDAN\n               That's more like it.\n\n20.",
        "dictionary": {
            "Chewie": "Loyal Companion",
            "Kashyyyk": "Remote Planet",
            "Rebel activity": "Resistance Movement",
            "Malla": "Lady of the House",
            "Itchy": "Furry Friend",
            "Lumpy": "Young One",
            "Saundan": "Old Friend",
            "proton pack": "Special Delivery",
            "whatchamalcalit": "Mysterious Device",
            "mind evaporator": "Secret Tool",
            "Life Day": "Special Celebration"
        }
    },
    {
        "message_id": 1605,
        "passage": "Lumpy runs up into his bedroom. There are toys scattered \n     all over, including a stuffed bantha. He sits the box on \n     the floor and opens it. Inside is some kind of electronic \n     do-it-yourself kit. Lumpy pulls it out and dumps all the\n     parts on his floor.\n\n21.",
        "dictionary": {
            "bantha": "camel"
        }
    },
    {
        "message_id": 1606,
        "passage": "SAUNDAN\n                    (to Itchy)\n               Itchy, I know what you'd like. \n\n     Itchy and Saundan walk over to the mind evaporator. It is \n     a chair with a helmet and visor. Itchy sits in the chair.\n\n                            SAUNDAN\n               I'll insert this proton pack. \n\n     Saundan inserts the proton pack into the back of the chair.\n\n                            SAUNDAN\n               Now then Itchy, I thought you might like \n               this. It's one of those uh... oh, it's a \n               real... it's kinda hard to explain... WOW, \n               if you know what I mean. \n                    (to himself)\n               Put that right in there.\n\n     He places a small cartridge in the arm of the chair.\n\n                            SAUNDAN\n                    (to Itchy)\n               Happy Life Day. And I do mean happy Life \n               Day.\n\n     The program starts. It is a swirling kaleidoscope of light.\n     Several beings swim through the designs. \n\n                            WOMAN\n                    (voice only)\n               I know you're searching for me. Searching,\n               searching... I'm here. My voice is for you \n               alone. \n\n     A blurry image of a woman appears in the middle of the\n     swirling.\n\n                            WOMAN\n               I am found in your eyes only. I exist for \n               you alone. I am in your mind as you create \n               me. Oh, yes... I can feel my creation.\n\n     A woman with pink stringy hair comes completely in focus. \n     She giggles. \n\n                            WOMAN\n                    (on monitor)\n               I'm getting your message. Are you getting \n               mine?\n\n     Itchy growls a happy affirmative.\n\n                            WOMAN\n               Oh, oh... We are excited, aren't we? Well, \n               just relax. Just relax. Yes, a little more. \n               Now, we can have a good time, can't we? \n               I'll tell you a secret, I find you \n               adorable.\n\n     Itchy hits the repeat button.\n\n                            WOMAN\n               I'll tell you a secret, I find you \n               adorable.\n\n     Itchy hits the repeat button again.\n\n                            WOMAN\n               I find you adorable.\n\n     Itchy hits the repeat button one more time.\n\n                            WOMAN\n               I find you adorable.\n\n     Itchy growls.\n\n                            WOMAN\n               I don't need to ask how you find me.\n                    (with echo)\n               You see, I am your fantasy. I am your \n               experience. So experience me. I am your \n               pleasure. Enjoy me. This is our moment \n               together in time that we might turn this \n               moment into an eternity.\n\n     Music starts to play.\n\n                            WOMAN\n                    (singing)\n               If we could only bend this minute. \n               Infinitely extend this minute. Then I \n               could live my whole life right now. \n               Reality is sweet this minute. Can't we \n               repeat and repeat this minute? Why can't \n               it always be right now? I've parted with \n               yesterday. Yesterday's moment is cold. All \n               I ask is this moment to hold. How can we \n               ever lose this minute? From all my life, I \n               choose this minute. I will give up the old \n               and the new. Sharing with you this minute \n               now. If I could just hold my breath and \n               close my eyes and not make a sound. Will \n               the universe stop going 'round? Still the \n               universe keeps going 'round and 'round and \n               on and on and on and on and on. A minute's \n               almost gone. How can we ever, ever lose \n               this minute? From all my life, I choose \n               this minute. I will never need anything \n               more than living for this minute now. This \n               minute now. This minute now. This minute \n               now. This minute now. This minute now. \n               This minute now. This minute now. This \n               minute now. This minute now.\n\n     The program ends with the woman fading into the swirling\n     that it started with.\n\n22.",
        "dictionary": {
            "SAUNDAN": "Technician",
            "Itchy": "Colleague"
        }
    },
    {
        "message_id": 1607,
        "passage": "Threepio is trying to make a connection on the \n     communications device. Leia is behind a desk working on\n     something. Malla answers at her end of the line.\n \n                            THREEPIO\n                    (to Leia)\n               Ah, I have made the connection. You may \n               speak now, if you wish.\n\n     Leia gets up from he desk and walks over to the monitor.\n\n                            LEIA\n               Malla, it's good to see you. Happy Life \n               Day.\n\n     Malla growls.\n\n                            THREEPIO\n                    (translating)\n               Oh, she says it may be a happy Life Day \n               for you, but personally, she's seen \n               happier ones.\n\n                            LEIA\n                    (to Threepio)\n               I... I don't want to tie up the channels. \n                    (to Malla)\n               So, could you do me a favor and send \n               either Chewbacca or Han Solo to the \n               screen please?\n\n     Malla growls and shakes he head \"no.\".\n\n                            THREEPIO\n                    (translating)\n               She says that she would like to grant your \n               request, but is quite unable to do so.\n\n                            LEIA\n                    (to Malla)\n               You mean they haven't arrived yet?\n\n     Malla growls.\n\n                            THREEPIO\n                    (translating)\n               She says, there has been no contact.\n\n                            LEIA\n                    (to Threepio)\n               Yes, I think I understand her message. Oh, \n               that Imperial patrol must be giving them \n               more trouble than we bargained for. Oh...\n                    (to Malla)\n               Malla, are, are you alone?\n\n     Malla growls that she isn't.\n\n                            THREEPIO\n                    (to Leia)\n               If, you would permit me.\n                    (translating)\n               No, she says she is not alone. She's with \n               a friend.\n\n                            LEIA\n                    (to Malla)\n               Could he come to the screen, please?\n\n     Malla growls and motions for Saundan to come over to the\n     monitor. He does as she says.\n\n                            SAUNDAN\n                    (to Leia)\n               Good afternoon, ma'am. I'm Saundan, a local \n               trader. A friend of the rebellion and a \n               member of the Alliance.\n\n                            LEIA\n                    (to Saundan)\n               Good. Look, I know I can count on you to \n               take care of my friends until their leader \n               returns. You'll do that for me, won't you?\n\n                            SAUNDAN\n               Yes indeed, ma'am. That's what I'm here \n               for.\n\n     Malla growls and puts her arm around Saundan very\n     affectionately.\n\n                            THREEPIO\n                    (translating)\n               She is expressing her warmth towards the \n               trader.\n\n     Leia is slightly amused by Threepio's need to translate \n     that and smiles.\n\n                            LEIA\n                    (to Malla)\n               Look, I can see you're in good hands, \n               Malla. I'll contact you again, soon.\n\n     The call ends.\n\n23.",
        "dictionary": {
            "Threepio": "Translator",
            "Life Day": "Holiday",
            "Rebel Alliance": "Resistance Movement"
        }
    },
    {
        "message_id": 1608,
        "passage": "SAUNDAN\n                    (to Malla)\n               Now then, what's that I smell? Oh, could \n               it be some of those famous wookiee \n               ookiees?\n\n     Malla shakes her head \"yes\" and they head towards the \n     kitchen. They also leave open the panels that conceal \n     their secret communications monitor.\n\n24.",
        "dictionary": {
            "ookiees": "cookies",
            "wookiee": "canine"
        }
    },
    {
        "message_id": 1609,
        "passage": "Chewie growls at Han.\n\n                            HAN\n               I told you we'd make it. Did I ever let \n               you down?\n\n     Chewie growls affectionately at Han.\n\n                            HAN\n               I feel the same way about you too, pal. \n               And your family. \n\n25.",
        "dictionary": {
            "Chewie": "Loyal Companion",
            "Han": "Captain"
        }
    }
]