[
    {
        "message_id": 390,
        "passage": "Tarkin and Vader watch the computer projected screen with\n      interest, as a circle of lights intertwines around one\n      another on the screen showing it's position in relation to\n      Yavin and the forth moon.\n\n206   DEATH STAR INTERCOM VOICE                              206\n\n      Orbiting the planet at maximum velocity. The moon with the\n      Rebel base will be in range in thirty minutes.\n\n                           VADER\n                This will be a day long remembered.\n                It has seen the end of Kenobi and\n                it will soon see the end of the\n                Rebellion.\n\n207",
        "dictionary": {
            "Death Star": "Galactic Fortress",
            "Rebellion": "Resistance"
        }
    },
    {
        "message_id": 391,
        "passage": "Luke, Threepio and little Artoo enter the huge spaceship\n      hangar and hurry along a long line of gleaming\n      spacefighters. Flight crews rush around loading last-minute\n      armaments and unlocking power couplings. In an area isolated\n      from this activity Luke finds Han and Chewbacca loading\n      small boxes onto an armored speeder.\n\n                          MAN'S VOICE\n                    (over loudspeaker)\n                All flight trooper, man your\n                stations. All flight troops, man\n                your stations.\n\n      Han is deliberately ignoring the activity of the fighter\n      pilots' preparation. Luke is quite saddened at the sight of\n      his friend's departure.\n\n                          LUKE\n                So... you got your reward and\n                you're just leaving then?\n\n                          HAN\n                That's right, yeah! I got some old\n                debts I've got to pay off with this\n                stuff. Even if I didn't, you don't\n                think I'd be fool enough to stick\n                around here, do you? Why don't you\n                come with us? You're pretty good in\n                a fight. I could use you.\n\n                          LUKE\n                    (getting angry)\n                Come on! Why don't you take a look\n                around?\n                          (MORE)\n\n                          LUKE (CONT'D)\n                You know what's about to happen,\n                what they're up against. They could\n                use a good pilot like you. You're\n                turning your back on them.\n\n                          HAN\n                What good's a reward if you ain't\n                around to use it? Besides,\n                attacking that battle station ain't\n                my idea of courage. It's more like\n                suicide.\n\n                          LUKE\n                All right. Well, take care of\n                yourself, Han. I guess that's what\n                you're best at, isn't it?\n\n      Luke goes off and Han hesitates, then calls to him.\n\n                          HAN\n                Hey, Luke... may the Force be with\n                you!\n\n      Luke turns and sees Han wink at him. Luke lifts his hand in\n      a small wave and then goes off.\n\n      Han turns to Chewie who growls at his captain,\n\n                           HAN (CONT’D)\n                What're you lookin' at? I know what\n                I'm doing.\n\n208",
        "dictionary": {
            "May the Force be with you": "Wishing you good luck",
            "Threepio": "Robot",
            "Artoo": "Droid",
            "spacefighters": "fighter jets",
            "power couplings": "energy connections"
        }
    },
    {
        "message_id": 392,
        "passage": "Luke, Leia, and Dodonna meet under a huge space fighter.\n\n                          LEIA\n                What's wrong?\n\n                          LUKE\n                Oh, it's Han! I don't know, I\n                really thought he'd change his\n                mind.\n\n                          LEIA\n                He's got to follow his own path. No\n                one can choose it for him.\n\n                          LUKE\n                I only wish Ben were here.\n\n      Leia gives Luke a little kiss, turns, and goes off. As Luke\n      heads for his ship, another pilot rushes up to him and grabs\n      his arm.\n\n                    BIGGS\n          Luke! I don't believe it! How'd you\n          get here... are you going out with\n          us?!\n\n                    LUKE\n          Biggs! Of course, I'll be up there\n          with you! Listen, have I got some\n          stories to tell...\n\nRed Leader, a rugged handsome man in his forties, comes up\nbehind Luke and Biggs. He has the confident smile of a born\nleader.\n\n                    RED LEADER\n          Are you... Luke Skywalker? Have you\n          been checked out on the Incom T-\n          sixty- five?\n\n                    BIGGS\n          Sir, Luke is the best bushpilot in\n          the outer rim territories.\n\nRed Leader pats Luke on the back as they stop in front of\nhis fighter.\n\n                    RED LEADER\n          I met your father once when I was\n          just a boy, he was a great pilot.\n          You'll do all right. If you've got\n          half of your father's skill, you'll\n          do better than all right.\n\n                    LUKE\n          Thank you, sir. I'll try.\n\nRed Leader hurries to his own ship.\n\n                    BIGGS\n          I've got to get aboard. Listen,\n          you'll tell me your stories when we\n          come back. All right?\n\n                    LUKE\n          I told you I'd make it someday,\n          Biggs.\n\n                    BIGGS\n              (going off)\n          You did, all right. It's going to\n          be like old times, Luke. We're a\n          couple of shooting stars that'll\n          never be stopped!\n\nLuke laughs and shakes his head in agreement. He heads for\nhis ship.\n\nAs Luke begins to climb up the ladder into his sleek, deadly\nspaceship, the crew chief, who is working on the craft,\npoints to little Artoo, who is being hoisted into a socket\non the back of the fighter.\n\n                    CHIEF\n          This R2 unit of your seems a bit\n          beat up. Do you want a new one?\n\n                    LUKE\n          Not on your life! That little droid\n          and I have been through a lot\n          together.\n              (to Artoo)\n          You okay, Artoo?\n\nThe crewmen lower Artoo-Detoo into the craft. Now a part of\nthe exterior shell of the starship, the little droid beeps\nthat he is fine.\n\nLuke climbs up into the cockpit of his fighter and puts an\nhis helmet. Threepio looks on from the floor of the massive\nhangar as the crewmen secure his little electronic partner\ninto Luke's X-wing. It's an emotional-filled moment as Artoo\nbeeps good-bye.\n\n                    CHIEF\n          Okay, easy she goes!\n\n                     THREEPIO\n          Hang on tight,Artoo, you've got to\n          come back.\n\nArtoo beeps in agreement.\n\n                    THREEPIO (CONT’D)\n          You wouldn't want my life to get\n          boring, would you?\n\nArtoo whistles his reply.\n\nAll final preparations are made for the approaching battle.\nThe hangar is buzzing with the last minute activity as the\npilots and crewmen alike make their final adjustments. The\nhum of activity is occasionally trespassed by the distorted\nvoice of the loudspeaker issuing commands. Coupling hoses\nare disconnected from the ships as they are fueled. Cockpit\nshields roll smoothly into place over each pilot. A\nsignalman, holding red guiding lights, directs the ships.\nLuke, a trace of a smile gracing his lips, peers about\nthrough his goggles.\n\n                             BEN'S VOICE\n                   Luke, the Force will be with you.\n\n      Luke is confused at the voice and taps his headphones.\n\n209",
        "dictionary": {
            "Incom T-sixty-five": "Advanced Fighter Jet",
            "outer rim territories": "remote regions",
            "Red Leader": "Commander",
            "X-wing": "Starfighter",
            "Artoo-Detoo": "Robot Companion",
            "Threepio": "Droid Translator"
        }
    },
    {
        "message_id": 393,
        "passage": "All that can be seen of the fortress is a lone guard\n      standing on a small pedestal jutting out above the dense\n      jungle. The muted gruesome crying sounds that naturally\n      permeate this eerie purgatory are overwhelmed by the\n      thundering din of ion rockets as four silver starships\n      catapult from the foliage in a tight formation and\n      disappears into the morning cloud cover.\n\n210",
        "dictionary": {
            "ion rockets": "high-powered engines",
            "starships": "spaceships"
        }
    },
    {
        "message_id": 394,
        "passage": "The princess, Threepio, and a field commander sit quietly\n      before the giant display showing the planet Yavin and its\n      four moons. The red dot that represents the Death Star moves\n      ever closer to the system. A series of green dots appear\n      around the fourth moon. A din of indistinct chatter fills\n      the war room.\n\n                             MASSASSI INTERCOM VOICE\n                   Stand-by alert. Death Star\n                   approaching. Estimated time to\n                   firing range, fifteen minutes.\n\n211",
        "dictionary": {
            "Death Star": "Planet-Killer",
            "Massassi": "Unknown Planet"
        }
    },
    {
        "message_id": 395,
        "passage": "The Death Star slowly moves behind the massive yellow\n      surface of Yavin in the foreground, as many X-wing fighters\n      flying in formation zoom toward us and out of the frame.\n\n212",
        "dictionary": {
            "Death Star": "Imperial Space Station",
            "Yavin": "Asteroid Base",
            "X-wing fighters": "Pilot Squadrons"
        }
    },
    {
        "message_id": 396,
        "passage": "Light from a distant sun creates an eerie atmospheric glow\n      around a huge planet, Yavin. Rebel fighters flying in\n      formation settle ominously in the foreground and very slowly\n      pull away.\n\n213",
        "dictionary": {
            "Yavin": "Distant Planet"
        }
    },
    {
        "message_id": 397,
        "passage": "Red Leader lowers his visor and adjusts his gun sights,\n      looking to each side at his wing men.\n\n                             RED LEADER\n                   All wings report in.\n\n214",
        "dictionary": {
            "RED LEADER": "Flight Commander",
            "wing men": "pilots"
        }
    },
    {
        "message_id": 398,
        "passage": "One of the Rebel fighters checks in through his mike.\n\n                             RED TEN\n                   Red Ten standing by.\n\n215",
        "dictionary": {
            "Red Ten": "Alpha Leader"
        }
    },
    {
        "message_id": 399,
        "passage": "Biggs checks his fighter's controls, alert and ready for\n      combat.\n\n                             RED SEVEN\n                       (over Biggs' headset)\n                   Red Seven standing by.\n\n                             BIGGS\n                   Red Three standing by.\n\n216",
        "dictionary": {
            "RED SEVEN": "Flight Leader",
            "Red Seven": "Flight Leader"
        }
    }
]