[
    {
        "message_id": 1980,
        "passage": "Leia is struggling against her chains in desperation as Artoo\n     zips through the tumult of confused monsters to the rescue;\n     the stubby little droid extends a small laser gun and blasts\n     the chain apart.\n\n                         LEIA\n               Come on. We gotta get out of here\n               quick.\n\n     Artoo and Leia race for the exit, passing Threepio, who is\n     kicking and screaming as Salacious Crumb, the reptilian\n     monkey- monster picks out one of the golden droid's eyes.\n\n                         THREEPIO\n               Not my eyes! Artoo, help! Quickly,\n               Artoo. Oh! Ohhh! You beast!\n\n     Artoo zips over and zaps Salacious, sending him skyward with\n     a scream, crashing into the rafters as Artoo, Leia, and\n     Threepio (with his eye dangling from a wire) hurry off.\n\n40",
        "dictionary": {
            "Artoo": "The Droid",
            "Threepio": "The Protocol Droid",
            "Salacious Crumb": "The Monster",
            "Reptilian monkey-monster": "The Fearsome Creature"
        }
    },
    {
        "message_id": 1981,
        "passage": "Luke is warding off laser blasts with his lightsaber,\n     surrounded by guards and fighting like a demon. Leia emerges\n     onto the deck as Luke turns to face another guard.\n\n                         LUKE   (TO LEIA)\n               Get the gun! Point it at the deck!\n\n     Leia turns toward the barge cannon, climbs on the platform,\n     and swivels the gun around.\n\n                         LUKE (CONT’D)\n               Point it at the deck!\n\n     A laser blast hits Luke's mechanical hand and he bends over\n     in pain, but manages to swing his lightsaber upward and take\n     out the last of the guards. He looks at the wounded hand,\n     which reveals the mechanism. He flexes the hand; it still\n     works.\n\n     Near the rail of the upper deck, Artoo and Threepio steady\n     themselves as Threepio gets ready to jump. Artoo beeps\n     wildly.\n\n                           THREEPIO\n                 Artoo, where are we going? I\n                 couldn't possibly jump.\n\n     Artoo butts the golden droid over the edge and steps off\n     himself, tumbling toward the sand.\n\n     Luke runs along the empty deck toward Leia and the barge gun,\n     which she has brought around to point down at the deck.\n\n                            LUKE\n                 Come on!\n\n     Luke has hold on one of the rigging ropes from the mast. He\n     gathers Leia in his other arm and kicks the trigger of the\n     deck gun. The gun explodes into the deck as Luke and Leia\n     swing out toward the skiff.\n\n41",
        "dictionary": {
            "lightsaber": "energy sword",
            "laser blasts": "energy beams",
            "mechanical hand": "prosthetic limb",
            "Threepio": "R2-D2's companion",
            "Artoo": "R2-D2"
        }
    },
    {
        "message_id": 1982,
        "passage": "Han leans panting against the rail as Chewie helps Lando onto\n     the deck. Luke and Leia land on the skiff with flair.\n\n                           LUKE\n                 Let's go! And don't forget the\n                 droids.\n\n                           LANDO\n                 We're on our way.\n\n     The Sail Barge is exploding in stages in the distance. Half\n     of the huge craft is on fire.\n\n42",
        "dictionary": {
            "Sail Barge": "Luxury Liner",
            "droids": "robots"
        }
    },
    {
        "message_id": 1983,
        "passage": "Threepio's legs stick straight up from the dune where he\n     landed. Next to it, Artoo's periscope is the only thing above\n     the sand. The skiff floats above them and two large\n     electromagnets dangle down on a wire. With a loud CLANG, both\n     droids are pulled from the sand.\n\n43",
        "dictionary": {
            "Threepio": "Robot",
            "Artoo": "Mechanic",
            "skiff": "Airboat",
            "electromagnets": "Magnetic Pulleys"
        }
    },
    {
        "message_id": 1984,
        "passage": "The little skiff skips around the burning Sail Barge, which\n     continues its chain of explosions. As the skiff sails off\n     across the desert, the barge settles to the sand and\n     disappears in one final conflagration.\n\n44",
        "dictionary": {
            "Sail Barge": "Explosive Cargo Ship"
        }
    },
    {
        "message_id": 1985,
        "passage": "A ferocious sandstorm blocks our view. Then, through the\n     ROAR, we HEAR THE VOICES of our heroes. They emerge slowly\n     from the veil of sand, pressing on against the wind.\n\nFirst come Artoo and Threepio, followed by Leia guiding Han,\nthen Luke and Lando come into view, each supporting one side\nof the towering Chewbacca, who hobbles from his wound.\n\nSoon, they can make out some large vague shapes in the\nblowing sand. It is the Millennium Falcon and, parked beside\nit, Luke's trusty X-wing and a two-seated Y-wing. They must\nshout to be heard.\n\n                    HAN\n          I don't know. All I can see is a\n          lot of blowing sand!\n\n                    LEIA\n          That's all any of us can see.\n\n                    HAN (BLINKING)\n          Then I guess I'm getting better.\n\nAs soon as the group huddles under the bulk of the Falcon,\nthe wind dies down to something more describable as a severe\nweather condition. Threepio hits a switch, and the gang-plank\nlowers with a HUM.\n\n                    HAN   (TURNING TO LUKE) (CONT’D)\n          I've got to hand it to you, kid,\n          you were pretty good out there.\n\n                    LUKE   (SHRUGGING IT OFF)\n          I had a lot of help. Think nothing\n          of it.\n\n                    HAN\n          No, I'm thinking a lot about it.\n          That carbon freeze was the closest\n          thing to dead there is. And it\n          wasn't just sleepin'. It was a big\n          wide awake nothing!\n\nLuke nods, as Chewie growls affectionately at the young Jedi\nwarrior, mussing his hair like a proud uncle. And Leia warmly\nhugs him.\n\n                    LUKE (MOVING TO HIS SHIP)\n          I'll see you back at the fleet.\n\n                    HAN\n          Why don't you leave that crate and\n          come with us?\n\n                    LUKE\n          I have a promise I have to keep\n          first... to an old friend.\n\n      Luke and Artoo take off in their spacecraft.\n\n                           HAN\n                    (looking dubiously at\n                     Lando, obviously\n                     remembering his friend's\n                     betrayal and subsequent\n                     aide)\n                Guess I owe you some thanks, too,\n                Lando.\n\n                          LANDO\n                Figured if I left you frozen like\n                that you'd just give me bad luck\n                the rest of my life, so I might as\n                well get you unfrozen sooner or\n                later.\n\n                          LEIA\n                He means \"You're welcome.\"\n\n                          LANDO\n                Come on, let's get off this\n                miserable dust ball.\n\n44A",
        "dictionary": {
            "ROAR": "loud noise",
            "HAN (BLINKING)": "Han (smiling)",
            "HUM": "low rumble",
            "carbon freeze": "deep freeze",
            "Jedi warrior": "brave fighter"
        }
    },
    {
        "message_id": 1986,
        "passage": "The desolate yellow planet fills the screen, Luke's X-wing\n      appears and peels off to the left. A moment later, the FALCON\n      appears as a dot and grows huge, to roar directly over the\n      CAMERA.\n\n45",
        "dictionary": {
            "X-wing": "fighter jet",
            "FALCON": "spaceship"
        }
    },
    {
        "message_id": 1987,
        "passage": "Luke is at the controls, with Artoo attached behind him\n      outside the canopy. Luke speaks into his comlink to the\n      others, in the MILLENNIUM FALCON.\n\n                          LUKE\n                I'll meet you back at the fleet.\n\n                          LEIA    (OVER COMLINK)\n                Hurry. The Alliance should be\n                assembled by now.\n\n                             LUKE\n                I will.\n\n                          HAN (OVER COMLINK)\n                Hey, Luke, thanks. Thanks for\n                comin' after me. Now I owe you one.\n\n      A message from Artoo appears on the small monitor screen in\n      front of Luke.\n\n     He smiles at the monitor and speaks to Artoo, as he pulls a\n     black glove on to cover his wounded mechanical hand.\n\n                         LUKE\n               That's right, Artoo. We're going to\n               the Dagobah system. I have a\n               promise to keep... to an old\n               friend.\n\n46",
        "dictionary": {
            "MILLENNIUM FALCON": "Spacecraft",
            "comlink": "radio",
            "Dagobah system": "Remote Planet"
        }
    },
    {
        "message_id": 1988,
        "passage": "A Super Star Destroyer and several ships of the Imperial\n     Fleet rest in space above the half-completed Death Star and\n     its green neighbor, Endor. Four squads of TIE fighters escort\n     an Imperial shuttle toward the Death Star.\n\n47",
        "dictionary": {
            "TIE fighters": "enemy jets",
            "Death Star": "space station",
            "Imperial Fleet": "naval forces",
            "Endor": "remote planet"
        }
    },
    {
        "message_id": 1989,
        "passage": "Lord Vader strides down the hallway, accompanied by a very\n     nervous Death Star commander.\n\n48",
        "dictionary": {
            "Death Star": "Imperial Space Station"
        }
    }
]