[
    {
        "message_id": 2000,
        "passage": "There is a great deal of Imperial traffic in the area as\n     construction proceeds on the Death Star. Transports, TIE\n     fighters, and a few Star Destroyers move about. Now the huge\n     Super Star Destroyer announces itself with a low roar and\n     soon fills the frame.\n\n59",
        "dictionary": {
            "Death Star": "Galactic Base",
            "Star Destroyers": "Warships",
            "Super Star Destroyer": "Mega Warship"
        }
    },
    {
        "message_id": 2001,
        "passage": "Han looks back at Luke and Leia as Chewie flips several\n     switches. Through the viewscreen, the Death Star and the huge\n     Super Star Destroyer can be seen.\n\n                         HAN\n               If they don't go for this, we're\n               gonna have to get outta here pretty\n               quick, Chewie.\n\n     Chewie growls his agreement.\n\n                         CONTROLLER   (OVER RADIO)\n               We have you on our screen now.\n               Please identify.\n\n                         HAN\n               Shuttle Tydirium requesting\n               deactivation of the deflector\n               shield.\n\n                         CONTROLLER   (OVER RADIO)\n               Shuttle Tydirium, transmit the\n               clearance code for shield passage.\n\n                         HAN\n               Transmission commencing.\n\n     Leia and Chewbacca listen tensely as the sound of a high\n     speed transmission begins.\n\n                         LEIA\n               Now we find out if that code is\n               worth the price we paid.\n\n                         HAN\n               It'll work. It'll work.\n\n     Chewie whines nervously. Luke stares at the Huge Super Star\n     Destroyer that looms ever larger before them.\n\n                         LUKE\n               Vader's on that ship.\n\n                         HAN\n               Now don't get jittery, Luke. There\n               are a lot of command ships. Keep\n               your distance though, Chewie, but\n               don't look like you're trying to\n               keep your distance.\n\n     Chewie barks a question.\n\n                         HAN (CONT’D)\n               I don't know. Fly casual.\n\n                         LUKE\n               I'm endangering the mission. I\n               shouldn't have come.\n\n                         HAN\n               It's your imagination, kid. Come\n               on. Let's keep a little optimism\n               here.\n\n     Chewie barks his worries as the Super Star Destroyer grows\n     larger out the window.\n\n60",
        "dictionary": {
            "Death Star": "Galactic Fortress",
            "Super Star Destroyer": "Imperial Dreadnought",
            "Shuttle Tydirium": "Starcraft Voyager",
            "Deflector shield": "Force Field"
        }
    },
    {
        "message_id": 2002,
        "passage": "Lord Vader stands, back to us, staring out a window at the\n     Death Star. Now, some vibration felt only by him causes him\n     to turn. After a moment of stillness, he walks down the row\n     of controllers to where ADMIRAL PIETT is leaning over the\n     tracking screen of the controller we've seen earlier. Piett\n     straightens at Vader's approach.\n\n                         VADER\n               Where is that shuttle going?\n\n                         PIETT (INTO COMLINK)\n               Shuttle Tydirium, what is your\n               cargo and destination?\n\n                         PILOT VOICE    (HAN)   (FILTERED)\n               Parts and technical crew for the\n               forest moon.\n\n     The Bridge Commander looks to Vader for a reaction.\n\n                         VADER\n               Do they have a code clearance?\n\n                         PIETT\n               It's an older code, sir, but it\n               checks out. I was about to clear\n               them.\n\n     Vader looks upward, as he senses Luke's presence.\n\n                         PIETT (CONT’D)\n               Shall I hold them?\n\n                         VADER\n               No. Leave them to me. I will deal\n               with them myself.\n\n                         PIETT (SURPRISED)\n               As you wish, my lord.\n                   (to controller)\n               Carry on.\n\n     Piett nods at controller, who switches on his comlink.\n\n61",
        "dictionary": {
            "Death Star": "Galactic Fortress",
            "Lord Vader": "Dark Lord",
            "Admiral Piett": "High Commander",
            "Shuttle Tydirium": "Cargo Transport",
            "forest moon": "remote planet"
        }
    },
    {
        "message_id": 2003,
        "passage": "The group waits tensely.\n\n                         HAN\n               They're not goin' for it, Chewie.\n\n                         CONTROLLER   (FILTERED)\n               Shuttle Tydirium, deactivation of\n               the shield will commence\n               immediately. Follow your\n\n     present course.\n\n     Everyone breaths a sigh of relief. Everyone but Luke, who\n     looks worried. Chewie barks.\n\n                         HAN\n               Okay! I told you it was gonna work.\n               No problem.\n\n62",
        "dictionary": {
            "Han": "Captain",
            "Chewie": "Loyal Companion",
            "Shuttle Tydirium": "Spacecraft",
            "Deactivation": "Disabling"
        }
    },
    {
        "message_id": 2004,
        "passage": "The stolen Imperial shuttle moves off toward the green\n     Sanctuary Moon.\n\n63",
        "dictionary": {
            "Imperial": "Government",
            "Sanctuary Moon": "Refuge Moon"
        }
    },
    {
        "message_id": 2005,
        "passage": "The stolen Imperial shuttle sits in a clearing of the moon's\n     dark, primeval forest, dwarfed by the ancient towering trees.\n\n     On an adjacent hill, the helmeted Rebel contingent makes its\n     way up a steep trail. Leia and Han are slightly ahead of\n     Chewie and Luke. The troops of the strike-team squad follow,\n     with Artoo and Threepio bringing up the rear. Artoo beeps.\n\n     Up ahead, Chewie and Leia reach a crest in the hill and drop\n     suddenly to the ground, signaling the rest of the group to\n     stop. Han and Luke crawl up to take a look.\n\n                         THREEPIO\n               Oh, I told you it was dangerous\n               here.\n\n     THEIR POV. Not far below them, two IMPERIAL SCOUTS are\n     wandering through bushes in the valley below. Their two\n     ROCKET BIKES are parked nearby.\n\n                         LEIA\n               Shall we try and go around?\n\n                         HAN\n               It'll take time. This whole\n               party'll be for nothing if they see\n               us.\n\n     Leia motions for the squad to stay put, then she, Han, Luke\n     and Chewie start quietly down.\n\n64",
        "dictionary": {
            "Imperial": "Government",
            "Rebel": "Resistance",
            "Threepio": "Mechanic",
            "Artoo": "Robot",
            "ROCKET BIKES": "Motorcycles"
        }
    },
    {
        "message_id": 2006,
        "passage": "The four friends make their way to the edge of the clearing\n     not far from the two Imperial scouts.\n\n                         HAN\n               Chewie and I will take care of\n               this. You stay here.\n\n                         LUKE\n               Quietly, there might be more of\n               them out there.\n\n                         HAN (GRINS)\n               Hey... it's me.\n\n     Han and Chewie turn and start through the bushes toward the\n     scouts. Luke and Leia exchange smiles.\n\n     Han sneaks up behind one of the scouts, steps on a twig and\n     the scout whirls, knocking Han into a tree. The scout shouts\n     for his companion.\n\n                         SCOUT #1\n               Go for help! Go!\n\n     The second scout jumps on his speeder bike and takes off, but\n     Chewie gets off a shot on his crossbow laser weapon, causing\n     the scout to crash into a tree. Han and Scout #1 are in a\n     rousing fistfight.\n\n                         LUKE      (SARCASTIC)\n               Great. Come on.\n\n     Luke starts for the scuffle, followed by Leia with her laser\n     pistol drawn. As they run through the bushes, Leia stops and\n     points to where two more scouts are sitting on their speeder\n     bikes, with an unoccupied bike parked nearby.\n\n                         LEIA\n               Over there! Two more of them!\n\n                         LUKE\n               I see them. Wait, Leia!\n\n     But Leia doesn't hear him and races for the remaining speeder\n     bike. She starts it up and takes off as Luke jumps on the\n     bike behind her.\n\n                         LUKE   (POINTING TO THE CONTROLS)\n                         (CONT’D)\n               Quick! Jam their comlink. Center\n               switch!\n\n     Luke and Leia speed into the dense foliage in hot pursuit,\n     barely avoiding two huge trees.\n\n                         HAN\n               Hey, wait! Ahhh!\n\n     He flips the remaining scout to the ground.\n\n65",
        "dictionary": {
            "Imperial": "Government",
            "crossbow laser weapon": "Energy Rifle",
            "speeder bike": "Motorcycle",
            "comlink": "Radio",
            "scout": "Soldier"
        }
    },
    {
        "message_id": 2007,
        "passage": "The two fleeing Imperial scouts have a good lead as Luke and\n     Leia pursue through the giant trees at 200 miles an hour, the\n     fire from their bike's laser cannon hitting harmlessly near\n     the moving targets.\n\n                         LUKE\n               Move closer!\n\n     Leia guns it, closing the gap, as the two scouts recklessly\n     veer through a narrow gap in the trees. One of the bikes\n     SCRAPES a tree, slowing the scout.\n\n                         LUKE (CONT’D)\n               Get alongside that one!\n\n     Leia pulls her speeder bike up so close to the scout's bike\n     that their steering vanes SCRAPE noisily. Luke leaps from his\n     bike to the back of the scout's, grabs the Imperial warrior\n     around the neck, and flips him off the bike, into a thick\n     tree trunk.\n\nLuke gains control of the bike and follows Leia, who has\npulled ahead. They tear off after the remaining scout.\n\n                     LUKE (CONT’D)\n          Get him!\n\nThe speeding chase passes TWO MORE IMPERIAL SCOUTS. These two\nswing into pursuit, chasing Luke and Leia, firing away with\ntheir laser cannon. The two Rebels look behind them just as\nLuke's bike takes a glancing hit.\n\n                    LUKE   (INDICATING THE ONE AHEAD)\n                    (CONT’D)\n          Keep on that one! I'll take these\n          two!\n\nWith Leia shooting ahead, Luke suddenly slams his steering\nvanes into the braking mode. Luke's bike is a blur to the two\npursuing scouts as they zip by him on either side. Luke slams\nhis bike into forward and starts firing away, having switched\nplaces with his pursuers in a manner of seconds. Luke's aim\nis good and one scout's bike is blasted out of control. It\nexplodes against a tree trunk.\n\nThe scout's cohort takes one glance back at the flash and\nshifts into turbo drive, going even faster. Luke keeps on his\ntail.\n\nFAR AHEAD, Leia and the first scout are doing a highspeed\nslalom through the death-dealing trunks. Now Leia aims her\nbike skyward and rises out of sight.\n\nThe scout turns in confusion, unable to see his pursuer.\nSuddenly, Leia dives down upon him from above, cannon\nblasting. The scout's bike takes a glancing hit.\n\nLeia moves in alongside him. The scout eyes her beside him,\nreaches down, and pulls out a handgun. Before Leia can react,\nthe scout has blasted her bike, sending it out of control.\nLeia dives off as her bike explodes against a tree. The happy\nscout looks back at the explosion. But when he turns forward\nagain, he is on a collision course with a giant fallen tree.\nHe hits his brakes to no avail and disappears in a\nconflagration.\n\nANOTHER PART OF THE FOREST: Luke and the last remaining scout\ncontinue their weaving chase through the trees. Now Luke\nmoves up close. The scout responds by slamming his bike into\nLuke's. A fallen tree forms a bridge across their path. The\nscout zips under. Luke goes over the top and crashes his bike\ndown on the scout's. Both riders look ahead - a wide trunk\nlooms directly in Luke's path, but the scout's bike beside\nhim makes it almost impossible for him to avoid it.\n\n     Luke banks with all his might, leaning almost horizontal over\n     the scout's bike, and is able to make it by, just clipping\n     the tree. When he straightens, he and the scout discover that\n     their two bikes have locked front vanes and are moving as\n     one.\n\n     Another big tree looms in Luke's path. He reacts\n     instinctively and dives off his bike. The two bikes come\n     apart a second before Luke's explodes against a tree. The\n     scout sweeps out and circles back to find Luke.\n\n     Luke rises from the undergrowth as the scout bears down on\n     him and opens fire with his laser cannon. Luke ignites his\n     laser sword and begins deflecting the bolts. The scout's bike\n     keeps coming and it appears that in a second it will cut Luke\n     in half. At the last instant, Luke steps aside and chops off\n     the bike's control vanes with one mighty slash. The scout's\n     bike begins to shudder, then, pitching and rolling, it rises\n     up to slam directly into a tree in a giant ball of fire.\n\n66",
        "dictionary": {
            "speeder bike": "high-speed motorcycle",
            "laser cannon": "energy blaster",
            "steering vanes": "handlebars",
            "Imperial warrior": "enemy soldier",
            "TWO MORE IMPERIAL SCOUTS": "two more enemy bikers",
            "braking mode": "emergency brake",
            "turbo drive": "high-speed mode",
            "death-dealing trunks": "dangerous trees",
            "skyward": "upward",
            "handgun": "pistol",
            "conflagration": "explosion"
        }
    },
    {
        "message_id": 2008,
        "passage": "Han, Chewie, and the droids, along with the rest of the\n     squad, wait anxiously in the clearing. Artoo's radar screen\n     sticks out of his domed head and revolves, scanning the\n     forest. He beeps.\n\n                         THREEPIO\n               Oh, General Solo, somebody's\n               coming. Oh!\n\n     Han, Chewie, and the rest of the squad raise their weapons.\n\n     Luke steps out of the foliage to find the weapons trained on\n     him. He's too tired to care. He plops himself down on a\n     boulder and looks around.\n\n                         HAN\n               Luke! Where's Leia?\n\n                         LUKE   (CONCERNED)\n               What? She didn't come back?\n\n                         HAN\n               I thought she was with you.\n\n                         LUKE\n               We got separated.\n\n     Luke and Han exchange a silent, grim look. Luke gets up\n     wearily.\n\n                         LUKE (CONT’D)\n               Hey, we better go look for her.\n\n     Han nods, and signals to a Rebel officer.\n\n                         HAN\n               Take the squad ahead. We'll meet\n               at the shield generator at 0300.\n\n                         LUKE\n               Come on, Artoo.   We'll need your\n               scanners.\n\n     Luke, Chewie, Han, and the droids move off in one direction\n     as the squad proceeds in another.\n\n                         THREEPIO\n               Don't worry, Master Luke.   We know\n               what to do.\n\n     They move off into the woods.\n\n                         THREEPIO   (TO ARTOO) (CONT’D)\n               And you said it was pretty here.\n               Ugh!\n\n67",
        "dictionary": {
            "Han": "Commander Smith",
            "Chewie": "Loyal Companion",
            "droids": "robots",
            "Rebel officer": "Military Leader",
            "shield generator": "Energy Source",
            "Rebel squad": "Military Unit"
        }
    },
    {
        "message_id": 2009,
        "passage": "A strange little furry face with huge black eyes comes slowly\n     into view. The creature is an EWOK, by the name of WICKET. He\n     seems somewhat puzzled, and prods Leia with a spear. The\n     princess groans; this frightens the stubby ball of fuzz and\n     he prods her again. Leia sits up and stares at the three-foot-\n     high Ewok. She tries to figure out where she is and what has\n     happened. Her clothes are torn; she's bruised and disheveled.\n\n     The Ewok jumps up and grabs a four-foot-long spear, which he\n     holds in a defensive position. Leia watches him as he circles\n     warily and begins poking her with the sharp point of the\n     spear.\n\n                         LEIA\n               Cut it out!\n\n     She stands up, and the Ewok quickly backs away.\n\n                         LEIA (CONT’D)\n               I'm not gonna hurt you.\n\n     Leia looks around at the dense forest, and at the charred\n     remains of her speeder bike, then sits down, with a sigh, on\n     a fallen log.\n\n                         LEIA (CONT’D)\n               Well, looks like I'm stuck here.\n               Trouble is, I don't know where here\n               is.\n\nShe puts her head in her hands to rub away some of the\nsoreness from her fall. She looks over at the watchful little\nEwok and pats the log beside her.\n\n                    LEIA (CONT’D)\n          Well, maybe you can help me. Come\n          on, sit down.\n\nWicket holds his spear up warily and growls at her like a\npuppy. Leia pats the log again.\n\n                     LEIA (CONT’D)\n          I promise I won't hurt you. Now\n          come here.\n\nMore growls and squeaks from the little bear creature.\n\n                    LEIA (CONT’D)\n          All right. You want something to\n          eat?\n\nShe takes a scrap of food out of her pocket and offers it to\nhim. Wicket takes a step backward, then cocks his head and\nmoves cautiously toward Leia, chattering in his squeaky Ewok\nlanguage.\n\n                    LEIA (CONT’D)\n          That's right. Come on. Hmmm?\n\nSniffing the food curiously, the Ewok comes toward Leia and\nsits on the log beside her. She takes off her helmet, and the\nlittle creature jumps back, startled again. He runs along the\nlog, pointing his spear at her and chattering a blue streak.\nLeia holds out the helmet to him.\n\n                    LEIA (CONT’D)\n          Look, it's a hat. It's not gonna\n          hurt you. Look. You're a jittery\n          little thing, aren't you?\n\nReassured, Wicket lowers his spear and climbs back on the\nlog, coming to investigate the helmet. Suddenly his ears perk\nup and he begins to sniff the air. He looks around warily,\nwhispering some Ewokese warning to Leia.\n\n                    LEIA (CONT’D)\n          What is it?\n\nSuddenly a laser bolt comes out of the foliage and explodes\non the log next to Leia. Leia and Wicket both roll backwards\noff the log, hiding behind it. Leia holds her own laser gun\nready, while Wicket disappears underneath the log. Another\nshot, and still no sight of anyone in the forest.\n\n     Then Leia senses something and turns to find a large IMPERIAL\n     SCOUT standing over her with his weapon pointed at her head.\n     He reaches out his hand for her weapon.\n\n     SCOUT #l Freeze!   Come on, get up!\n\n     She hands the weapon over, as a second scout emerges from the\n     foliage in front of the log.\n\n                         SCOUT #1\n               Go get your ride and take her back\n               to base.\n\n                           SCOUT #2\n               Yes, sir.\n\n     The second scout starts toward his bike, as Wicket, crouched\n     under the log, extends his spear and hits the first scout on\n     the leg. The scout jumps and lets out an exclamation, and\n     looks down at Wicket, puzzled. Leia grabs a branch and knocks\n     him out. She dives for his laser pistol, and the second\n     scout, now on his bike, takes off. Leia fires away and hits\n     the escaping bike, causing it to crash into the first scout's\n     bike, which flies end over end and explodes. The forest is\n     quiet once more. Wicket pokes his fuzzy head up from behind\n     the log and regards Leia with a new respect. He mumbles his\n     awe. Leia hurries over, looking around all the time, and\n     motions the chubby little creature into the dense foliage.\n\n                         LEIA\n               Come on, let's get outta here.\n\n     As they move into the foliage, Wicket takes the lead. He\n     shrieks and tugs at Leia to follow him.\n\n68",
        "dictionary": {
            "EWOK": "small, furry creature",
            "WICKET": "Fuzzy",
            "Ewokese": "unknown language",
            "Imperial Scout": "forest guard"
        }
    }
]