[
    {
        "message_id": 1550,
        "passage": "OBI-WAN and ANAKIN work their way across the small pipe, fighting ferociously as they go. OBI-WAN slips, throws his lightsaber up in the air, grabs on to the pipe, swings around, grabs on to an upper pipe, retrieves his lightsaber, and lands back on the original pipe. They continue to fight across the pipe until they reach the Main Collection Plant. \n\n207",
        "dictionary": {
            "lightsaber": "energy blade",
            "Main Collection Plant": "Central Storage Facility"
        }
    },
    {
        "message_id": 1551,
        "passage": "YODA squishes his way through a mass of wires in a small chute. He talks on his comlink. \n\nYODA: Hurry. Careful timing we will need. \n\nBAIL ORGANA: (in speeder) There aren't many troops on this side. Activate your homing beacon when you're ready. \n\n208",
        "dictionary": {
            "YODA": "The wise one",
            "comlink": "communication device"
        }
    },
    {
        "message_id": 1552,
        "passage": "A Senate pod with COMMANDER THIRE (4477) and SEVERAL OTHER CLONE TROOPERS climb up to where MAS AMEDDA and PALPATINE are waiting. Beneath the Main Podium, TWENTY CLONE TROOPERS search for Yoda 's body. \n\nCLONE COMMANDER THIRE: There is no sign of his body, sir. \n\nMAS AMEDDA: Then he is not dead. \n\nPALPATINE: Double your search. \n\nCLONE COMMANDER THIRE: Yes sir. Right away, sir. \n\nPALPATINE: (to Mas Amedda) Tell Captain Kagi to prepare my shuttle for immediate takeoff. \n\nMAS AMEDDA: Yes, Master. \n\nPALPATINE: I sense Lord Vader is in danger. \n\nPALPATINE walks into the Arena hallway. COMMANDER THIRE descends down to the floor of the Arena, where an intense search is taking place. SEVERAL CURIOUS SENATORS rubberneck in scattered pods. \n\n209",
        "dictionary": {
            "CLONE TROOPERS": "Elite Soldiers",
            "MAS AMEDDA": "Chancellor's Aide",
            "PALPATINE": "Supreme Leader",
            "COMMANDER THIRE": "Military Officer",
            "SEVERAL OTHER": "Multiple",
            "TWENTY": "Twenty-Five",
            "YODA": "The Wise One"
        }
    },
    {
        "message_id": 1553,
        "passage": "OBI-WAN and ANAKIN battle on the top of the multispired collection panels, jumping from one to the other. At the end of the collection cluster, a huge spray of lava covers the attachments that hold up the collectors. The frame begins to melt. It's raining lava. Both ANAKIN and OBI-WAN run for cover under the collection cluster. They continue to fight in the lava rain, darting from cover to attack, then quickly retreating to cover. \nSupport for the entire structure begins to fall away, and the collection cluster falls into the lava river. The Jedi continue their fight, climbing to the highest point on the tower as the rest begins to melt away as it rides the swift current down the river. \n\nIt bends toward the lava as they get out toward the end. The fighting gets fierce. OBI-WAN gets to the end and is trapped. The tower slowly starts to sink under the lava. \n\n210",
        "dictionary": {
            "Jedi": "Warriors",
            "lava": "molten rock",
            "collection cluster": "structure",
            "attachments": "supports",
            "collection panels": "platforms"
        }
    },
    {
        "message_id": 1554,
        "passage": "BAIL ORGANA, in his open Cockpit Speeder, flies along next to the roof eave of the huge Senate Building. He slows and moves closer to a long row of recessed lights. Suddenly YODA falls out of one of the light recesses and lands in the Speeder. BAIL guns it and heads away from the Senate Building. \n\n211",
        "dictionary": {
            "Cockpit Speeder": "High-Speed Vehicle",
            "YODA": "The Wise One",
            "BAIL ORGANA": "Senator Jenkins"
        }
    },
    {
        "message_id": 1555,
        "passage": "YODA straightens himself out. \n\nYODA: Into exile I must go. Failed, I have. \n\nYODA and BAIL fly into the traffic of the city. \n\n212",
        "dictionary": {
            "YODA": "The Wise One",
            "exile": "self-imposed isolation"
        }
    },
    {
        "message_id": 1556,
        "passage": "OBI-WAN realizes he is getting very close to the edge of the lava falls. He grabs a rope and leaps from the collection arm. ANAKIN follows. \nANAKIN and OBI-WAN continue their sword fight hanging from cables as they swing past each other. \n\n213",
        "dictionary": {
            "OBI-WAN": "Master Jedi",
            "ANAKIN": "Young Padawan"
        }
    },
    {
        "message_id": 1557,
        "passage": "C-3PO carefully lifts PADME into his arms. R2-D2 nervously looks on. BEEPING. \n\nC-3PO: I am being careful. I've got a good hold on her, but . . . I'm worried about my back. I hope it's able to hold up under this weight. \n\nC-3PO carries PADME into the Naboo Skiff. \n\n214",
        "dictionary": {
            "PADME": "the princess",
            "Naboo Skiff": "a rescue vessel"
        }
    },
    {
        "message_id": 1558,
        "passage": "From their cables, ANAKIN and OBI-WAN both spot something that causes them to stop fighting. The lava river ahead drops off in a tremendous lava fall. \n\nSNAPPING AND METAL GROANS are heard as the main part of the collector starts to break away and move toward the lava fall. OBI-WAN looks around and sees a small floating platform making its way toward the tower. \n\nOBI-WAN does a double hack-flip and lands squarely on the floating platform. He immediately leans to one side and moves away from the tower. \n\nANAKIN realizes he is doomed as the entire tower heads for the falls. In the distance he sees some CONSTRUCTION DROIDS. He swings back to the tower, climbs up and makes a running leap and miraculously lands on A WORKER DROID. The DROID is confused and chatters to his CO-WORKER. The giant collector goes over the lava flow and disappears in the mist of sparks below. \n\nOBI-WAN heads for the bank of the lava river, but Anakin's DROID is faster. He catches up with his old Master. \n\nOBI-WAN and ANAKIN continue the swordfight. They battle away, balancing on the tiny platform and puzzled DROID. ANAKIN, standing on the Droid, approaches OBI-WAN on the work platform. \n\nOBI-WAN: I have failed you, Anakin. I was never able to teach you to think. \n\nANAKIN and OBI-WAN confront each other on the lava river. \n\nANAKIN: I should have known the Jedi were plotting to take over . . . \n\nOBI-WAN: From the Sith!!! Anakin, Chancellor Palpatine is evil. \n\nANAKIN: From the Jedi point of view! From my point of view, the Jedi are evil. \n\nOBI-WAN: Well, then you are lost! \n\nANAKIN: This is the end for you, My Master. I wish it were otherwise. \n\nANAKIN jumps and flips onto OBI- WAN's platform. The fighting continues again until OBI-WAN jumps toward the safety of the black sandy edge of the lava river. He yells at Anakin. \n\nOBI-WAN: It's over, Anakin. I have the high ground. \n\nANAKIN: You underestimate my power! \n\nOBI-WAN: Don't try it. \n\nANAKIN follows, and OBI-WAN cuts his young apprentice at the knees, then cuts off his left arm in the blink of an eye. ANAKIN tumbles down the embankment and rolls to a stop near the edge of the lava. \n\nANAKIN struggles to pull himself up the embankment with his mechanical hand. His thin leather glove has been burned off. He keeps sliding down in the black sand. \n\nOBI-WAN: (continuing) . . . You were the Chosen One! It was said that you would, destroy the Sith, not join them. It was you who would bring balance to the Force, not leave it in Darkness. \n\nOBI-WAN picks up Anakin's light saber and begins to walk away. He stops and looks back. \n\nANAKIN: I hate you! \n\nOBI-WAN: You were my brother, Anakin. I loved you. \n\nANAKIN'S clothing blows into the lava river and ignites. Suddenly ANAKIN bursts into flames and starts SCREAMING. \n\n215",
        "dictionary": {
            "ANAKIN": "Alex",
            "OBI-WAN": "Owen",
            "Sith": "Dark Sorcerers",
            "Jedi": "Peacekeepers",
            "Chosen One": "Destined Hero",
            "Force": "Energy Field",
            "Chancellor Palpatine": "Supreme Leader",
            "CONSTRUCTION DROIDS": "Industrial Robots",
            "WORKER DROID": "Factory Robot",
            "CO-WORKER": "Colleague"
        }
    },
    {
        "message_id": 1559,
        "passage": "OBI-WAN looks in horror as ANAKIN becomes engulfed in flames. OBI-WAN can't watch him as he struggles to climb the embankment, covered in flames. \n\nHe runs back to Padme's ship as ANAKIN drops, smoldering, near the top of the lava pit. \n\n216",
        "dictionary": {
            "OBI-WAN": "Commander",
            "ANAKIN": "Lieutenant"
        }
    }
]